type: mapping
id: active_directory_users_5003_user_inventory_1.1.0
version: '9'
name: Active Directory Users to OCSF class User Inventory
data-types:
- active-directory-users
mapping:
  fields:
    activity_id: (2)::NUMBER
    activity_name: (CASE ((2)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Log' WHEN
      2 THEN 'Collect' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((5)::NUMBER) WHEN 5 THEN 'Discovery' END)::VARCHAR
    category_uid: (5)::NUMBER
    class_name: ('user_inventory')::VARCHAR
    class_uid: ('5003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (LASTLOGONDATE)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (LASTLOGONDATE)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: (DESCRIPTION)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('active-directory-users')::VARCHAR
    metadata.product.vendor_name: ('windows-active-directory')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (EMAILADDRESS)::VARCHAR
    - name: '''user.ldap_person.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.ldap_person.manager'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.ldap_person.manager.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (MANAGER)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: (date_part('epoch_milliseconds', (CREATED)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (CREATED)::TIMESTAMP_LTZ
    status: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2
      THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (0)::NUMBER
    time: (date_part('epoch_milliseconds', snapshot_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (snapshot_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((500302)::NUMBER) WHEN 500300 THEN ''User Inventory Info: Unknown''
      WHEN 500301 THEN ''User Inventory Info: Log'' WHEN 500302 THEN ''User Inventory
      Info: Collect'' WHEN 500399 THEN ''User Inventory Info: Other'' END)::VARCHAR'
    type_uid: (500302)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (EMAILADDRESS)::VARCHAR
    user.full_name: (DISPLAYNAME)::VARCHAR
    user.ldap_person.employee_uid: (EMPLOYEEID)::VARCHAR
    user.ldap_person.given_name: (GIVENNAME)::VARCHAR
    user.ldap_person.job_title: (TITLE)::VARCHAR
    user.ldap_person.location.city: (CITY)::VARCHAR
    user.ldap_person.location.country: (COUNTRY)::VARCHAR
    user.ldap_person.manager.name: (MANAGER)::VARCHAR
    user.ldap_person.office_location: (STATE)::VARCHAR
    user.ldap_person.surname: (SURNAME)::VARCHAR
    user.name: (NAME)::VARCHAR
    user.org.name: (COMPANY)::VARCHAR
    user.org.ou_name: (DEPARTMENT)::VARCHAR
    user.type: (CASE ((CASE WHEN OBJECTCLASS = 'user' THEN 1 WHEN OBJECTCLASS IS NULL
      THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2
      THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN OBJECTCLASS = 'user' THEN 1 WHEN OBJECTCLASS IS NULL
      THEN 0 ELSE 99 END)::NUMBER
    user.uid: (OBJECTSID)::VARCHAR
