type: mapping
id: alibaba_kubernetes_audit_logs_6003_api_activity_1.1.0
version: '9'
name: Alibaba Kubernetes Audit Logs to OCSF class Api Activity
data-types:
- alibaba-kubernetes-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN VERB IS NULL THEN 0 WHEN VERB = 'create' THEN 1 WHEN VERB
      IN ('get', 'watch', 'list') THEN 2 WHEN VERB IN ('update', 'patch') THEN 3 WHEN
      VERB = 'delete' THEN 4 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN VERB IS NULL THEN 0 WHEN VERB = 'create' THEN
      1 WHEN VERB IN ('get', 'watch', 'list') THEN 2 WHEN VERB IN ('update', 'patch')
      THEN 3 WHEN VERB = 'delete' THEN 4 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Create' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.authorizations: (OBJECT_CONSTRUCT_KEEP_NULL('decision', GET(ANNOTATIONS,
      'authorization.k8s.io/decision'), 'policy', OBJECT_CONSTRUCT_KEEP_NULL('desc',
      GET(ANNOTATIONS, 'authorization.k8s.io/reason'))))::ARRAY
    actor.process.file.path: (TAG_PATH)::VARCHAR
    actor.user.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', USER_GROUPS[0])))::ARRAY
    actor.user.name: (USERNAME)::VARCHAR
    actor.user.uid: (RAW:user:uid)::VARCHAR
    api.group.name: (OBJECT_REFERENCE:apiGroup)::VARCHAR
    api.operation: (VERB)::VARCHAR
    api.request.data: (REQUEST_OBJECT)::VARIANT
    api.response.code: (RESPONSE_STATUS_CODE)::NUMBER
    api.response.data: (RESPONSE_OBJECT)::VARIANT
    api.response.error: (IFF(RESPONSE_STATUS_CODE::VARCHAR NOT ILIKE '2%', RESPONSE_STATUS_CODE,
      NULL))::VARCHAR
    api.response.error_message: (RESPONSE_STATUS_REASON)::VARCHAR
    api.response.message: (RAW:responseStatus:message)::VARCHAR
    api.version: (API_VERSION)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (REQUEST_RECEIVED_TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (REQUEST_RECEIVED_TIMESTAMP)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.url.path: (SPLIT_PART(REQUEST_URI, '?', 1))::VARCHAR
    http_request.url.query_string: (SPLIT_PART(REQUEST_URI, '?', 2))::VARCHAR
    http_request.user_agent: (USER_AGENT)::VARCHAR
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('alibaba-kubernetes-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('alibaba')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USERNAME)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (TAG_HOSTNAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IPS[0])::VARCHAR
    raw_data: NULL::VARCHAR
    resources: (OBJECT_CONSTRUCT_KEEP_NULL('name', OBJECT_REFERENCE:name, 'namespace',
      OBJECT_REFERENCE:namespace, 'type', COALESCE(OBJECT_REFERENCE:resource, RESOURCE_TYPE)))::ARRAY
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.hostname: (TAG_HOSTNAME)::VARCHAR
    src_endpoint.ip: (SOURCE_IPS[0])::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RESPONSE_STATUS_STATUS IS NULL THEN 0 WHEN RESPONSE_STATUS_STATUS
      = 'Success' THEN 1 WHEN RESPONSE_STATUS_STATUS = 'Failure' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: (RESPONSE_STATUS_CODE)::VARCHAR
    status_detail: (COALESCE(RESPONSE_STATUS_REASON, RAW:responseStatus:message))::VARCHAR
    status_id: (CASE WHEN RESPONSE_STATUS_STATUS IS NULL THEN 0 WHEN RESPONSE_STATUS_STATUS
      = 'Success' THEN 1 WHEN RESPONSE_STATUS_STATUS = 'Failure' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', request_received_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (request_received_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN VERB IS NULL THEN 600300 WHEN VERB = ''create''
      THEN 600301 WHEN VERB IN (''get'', ''watch'', ''list'') THEN 600302 WHEN VERB
      IN (''update'', ''patch'') THEN 600303 WHEN VERB = ''delete'' THEN 600304 ELSE
      600399 END)::NUMBER) WHEN 600300 THEN ''API Activity: Unknown'' WHEN 600301
      THEN ''API Activity: Create'' WHEN 600302 THEN ''API Activity: Read'' WHEN 600303
      THEN ''API Activity: Update'' WHEN 600304 THEN ''API Activity: Delete'' WHEN
      600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN VERB IS NULL THEN 600300 WHEN VERB = 'create' THEN 600301
      WHEN VERB IN ('get', 'watch', 'list') THEN 600302 WHEN VERB IN ('update', 'patch')
      THEN 600303 WHEN VERB = 'delete' THEN 600304 ELSE 600399 END)::NUMBER
    unmapped: NULL::VARIANT
  predicate: VERB IS NOT NULL
