type: mapping
id: aws_nlb_logs_4001_network_activity_1.1.0
version: '1'
name: Aws Nlb Logs to OCSF class Network Activity
data-types:
- aws-nlb-logs
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (6)::NUMBER
    activity_name: (CASE ((6)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN
      2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.provider: ('AWS')::VARCHAR
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.domain: (DOMAIN_NAME)::VARCHAR
    dst_endpoint.ip: (DESTINATION_IP)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    duration: (CONNECTION_TIME)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer.name: (ELASTIC_LOAD_BALANCER)::VARCHAR
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('aws-nlb-logs')::VARCHAR
    metadata.product.vendor_name: ('aws')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    src_endpoint.port: (CLIENT_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls.alert: (INCOMING_TLS_ALERT)::NUMBER
    tls.certificate.serial_number: (CHOSEN_CERT_SERIAL)::VARCHAR
    tls.cipher: (TLS_CIPHER)::VARCHAR
    tls.handshake_dur: (TLS_HANDSHAKE_TIME)::NUMBER
    tls.version: (TLS_PROTOCOL_VERSION)::VARCHAR
    traffic.bytes: (RECEIVED_BYTES+SENT_BYTES)::NUMBER
    traffic.bytes_in: (RECEIVED_BYTES)::NUMBER
    traffic.bytes_out: (SENT_BYTES)::NUMBER
    type_name: '(CASE ((400106)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown''
      WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400106)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
