type: mapping
id: aws_rds_aurora_mysql_audit_logs_6005_datastore_activity_1.1.0
version: '9'
name: Aws Rds Aurora Mysql Audit Logs to OCSF class Datastore Activity
data-types:
- aws-rds-aurora-mysql-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION = 'READ' THEN
      1 WHEN OPERATION = 'ALTER' THEN 2 WHEN OPERATION = 'CONNECT' THEN 3 WHEN OPERATION
      = 'QUERY' THEN 4 WHEN OPERATION = 'WRITE' THEN 5 WHEN OPERATION = 'CREATE' THEN
      6 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION = 'READ'
      THEN 1 WHEN OPERATION = 'ALTER' THEN 2 WHEN OPERATION = 'CONNECT' THEN 3 WHEN
      OPERATION = 'QUERY' THEN 4 WHEN OPERATION = 'WRITE' THEN 5 WHEN OPERATION =
      'CREATE' THEN 6 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Read'
      WHEN 2 THEN 'Update' WHEN 3 THEN 'Connect' WHEN 4 THEN 'Query' WHEN 5 THEN 'Write'
      WHEN 6 THEN 'Create' WHEN 7 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.name: (USERNAME)::VARCHAR
    api: NULL::VARIANT
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('datastore_activity')::VARCHAR
    class_uid: ('6005')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    database.name: (DATABASE)::VARCHAR
    databucket: NULL::VARIANT
    dst_endpoint.hostname: (SERVER_HOST)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('aws-rds-aurora-mysql-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('aws')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USERNAME)::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SERVER_HOST)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (HOST)::VARCHAR
    query_info.query_string: (QUERY)::VARCHAR
    query_info.uid: (QUERY_ID)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (HOST)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (RETURN_CODE)::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type: NULL::VARCHAR
    type_id: NULL::NUMBER
    type_name: '(CASE ((600500 + (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION
      = ''READ'' THEN 1 WHEN OPERATION = ''ALTER'' THEN 2 WHEN OPERATION = ''CONNECT''
      THEN 3 WHEN OPERATION = ''QUERY'' THEN 4 WHEN OPERATION = ''WRITE'' THEN 5 WHEN
      OPERATION = ''CREATE'' THEN 6 ELSE 99 END))::NUMBER) WHEN 600500 THEN ''Datastore
      Activity: Unknown'' WHEN 600501 THEN ''Datastore Activity: Read'' WHEN 600502
      THEN ''Datastore Activity: Update'' WHEN 600503 THEN ''Datastore Activity: Connect''
      WHEN 600504 THEN ''Datastore Activity: Query'' WHEN 600505 THEN ''Datastore
      Activity: Write'' WHEN 600506 THEN ''Datastore Activity: Create'' WHEN 600507
      THEN ''Datastore Activity: Delete'' WHEN 600599 THEN ''Datastore Activity: Other''
      END)::VARCHAR'
    type_uid: (600500 + (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION = 'READ'
      THEN 1 WHEN OPERATION = 'ALTER' THEN 2 WHEN OPERATION = 'CONNECT' THEN 3 WHEN
      OPERATION = 'QUERY' THEN 4 WHEN OPERATION = 'WRITE' THEN 5 WHEN OPERATION =
      'CREATE' THEN 6 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
