type: mapping
id: aws_vpc_flow_logs_4001_network_activity_1.1.0
version: '18'
name: Aws Vpc Flow Logs to OCSF class Network Activity
data-types:
- aws-vpc-flow-logs
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION = 'Block' then 2 WHEN ACTION = 'ACCEPT' then
      1 WHEN ACTION is null then 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION = 'Block' then 2 WHEN ACTION = 'ACCEPT' then 1 WHEN
      ACTION is null then 0 ELSE 99 END)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN
      2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.account.uid: (ACCOUNT_ID)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.region: (REGION)::VARCHAR
    connection_info.direction: (CASE ((CASE FLOW_DIRECTION WHEN 'ingress' THEN 1::NUMBER
      WHEN 'egress' THEN 2::NUMBER ELSE 0::NUMBER END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN
      'Other' END)::VARCHAR
    connection_info.direction_id: (CASE FLOW_DIRECTION WHEN 'ingress' THEN 1::NUMBER
      WHEN 'egress' THEN 2::NUMBER ELSE 0::NUMBER END)::NUMBER
    connection_info.protocol_num: (IANA_PROTOCOL_NUMBER)::NUMBER
    connection_info.protocol_ver: (CASE ((CASE TRAFFIC_TYPE WHEN 'IPv4' THEN 4::NUMBER
      WHEN 'IPv6' THEN 6 ELSE 0 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 4 THEN 'Internet
      Protocol version 4 (IPv4)' WHEN 6 THEN 'Internet Protocol version 6 (IPv6)'
      WHEN 99 THEN 'Other' END)::VARCHAR
    connection_info.protocol_ver_id: (CASE TRAFFIC_TYPE WHEN 'IPv4' THEN 4::NUMBER
      WHEN 'IPv6' THEN 6 ELSE 0 END)::NUMBER
    connection_info.tcp_flags: (TCP_FLAGS)::NUMBER
    count: NULL::NUMBER
    device.instance_uid: (INSTANCE_ID)::VARCHAR
    device.interface_uid: (INTERFACE_ID)::VARCHAR
    device.subnet_uid: (SUBNET_ID)::VARCHAR
    device.vpc_uid: (VPC_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (DESTINATION_ADDRESS)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (END_TIME)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (END_TIME)::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('aws-vpc-flow-logs')::VARCHAR
    metadata.product.vendor_name: ('aws')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_ADDRESS)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_ADDRESS)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (1)::NUMBER
    src_endpoint.ip: (SOURCE_ADDRESS)::VARCHAR
    src_endpoint.port: (SOURCE_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', start_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (start_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes_out: (TOTAL_BYTES_TRANSFERRED)::NUMBER
    traffic.packets_out: (TOTAL_PACKETS_TRANSFERRED)::NUMBER
    type_name: '(CASE ((400100)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown''
      WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400100)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
