type: mapping
id: aws_client_vpn_logs_3002_authentication_1.1.0
version: '10'
name: Aws Client Vpn Logs to OCSF class Authentication
data-types:
- aws-client-vpn-logs
mapping:
  fields:
    activity_id: (1)::NUMBER
    activity_name: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN
      2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket' WHEN 4 THEN 'Service Ticket
      Request' WHEN 5 THEN 'Service Ticket Renew' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: NULL::VARCHAR
    auth_protocol_id: NULL::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.ip: (DEVICE_IP)::VARCHAR
    device.os.type: (CASE ((CASE WHEN DEVICE_TYPE IS NULL THEN 0 WHEN DEVICE_TYPE
      = 'windows' THEN 100 WHEN DEVICE_TYPE = 'linux' THEN 200 WHEN DEVICE_TYPE =
      'android' THEN 201 WHEN DEVICE_TYPE = 'mac' THEN 300 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN
      200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN
      'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN
      402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN DEVICE_TYPE IS NULL THEN 0 WHEN DEVICE_TYPE = 'windows'
      THEN 100 WHEN DEVICE_TYPE = 'linux' THEN 200 WHEN DEVICE_TYPE = 'android' THEN
      201 WHEN DEVICE_TYPE = 'mac' THEN 300 ELSE 99 END)::NUMBER
    device.uid: (CLIENT_VPN_ENDPOINT_ID)::VARCHAR
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (CONNECTION_END_TIME)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (CONNECTION_END_TIME)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: (CONNECTION_ATTEMPT_FAILURE_REASON)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('aws-client-vpn-logs')::VARCHAR
    metadata.product.vendor_name: ('aws')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DEVICE_IP)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USERNAME)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session.is_vpn: (IFF(CONNECTION_ID IS NOT NULL, TRUE, FALSE))::BOOLEAN
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    src_endpoint.port: (PORT)::NUMBER
    start_time: (date_part('epoch_milliseconds', (CONNECTION_START_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (CONNECTION_START_TIME)::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN CONNECTION_ATTEMPT_STATUS IS NULL THEN 0 WHEN CONNECTION_ATTEMPT_STATUS
      = 'successful' THEN 1 WHEN CONNECTION_ATTEMPT_STATUS = 'failed' THEN 2 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure'
      WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (CONNECTION_LOG_TYPE)::VARCHAR
    status_id: (CASE WHEN CONNECTION_ATTEMPT_STATUS IS NULL THEN 0 WHEN CONNECTION_ATTEMPT_STATUS
      = 'successful' THEN 1 WHEN CONNECTION_ATTEMPT_STATUS = 'failed' THEN 2 ELSE
      99 END)::NUMBER
    time: (date_part('epoch_milliseconds', connection_start_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (connection_start_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300201)::NUMBER) WHEN 300200 THEN ''Authentication: Unknown''
      WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (300201)::NUMBER
    unmapped: NULL::VARIANT
    user.name: (USERNAME)::VARCHAR
