type: mapping
id: aws_waf_4002_http_activity_1.1.0
version: '17'
name: Aws Waf to OCSF class Http Activity
data-types:
- aws-waf
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION = 'ALLOW' THEN 1 WHEN ACTION = 'BLOCK' THEN 2
      WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION = 'ALLOW' THEN 1 WHEN ACTION = 'BLOCK' THEN 2 WHEN
      ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (CASE   WHEN HTTP_REQUEST_HTTP_METHOD = 'CONNECT' THEN 1   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'DELETE' THEN 2   WHEN HTTP_REQUEST_HTTP_METHOD = 'GET' THEN 3   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'HEAD' THEN 4   WHEN HTTP_REQUEST_HTTP_METHOD = 'OPTIONS' THEN 5   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'POST' THEN 6   WHEN HTTP_REQUEST_HTTP_METHOD = 'PUT' THEN 7   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'TRACE' THEN 8 WHEN HTTP_REQUEST_HTTP_METHOD = NULL THEN 0   ELSE 99  END)::NUMBER
    activity_name: (CASE ((CASE   WHEN HTTP_REQUEST_HTTP_METHOD = 'CONNECT' THEN 1   WHEN
      HTTP_REQUEST_HTTP_METHOD = 'DELETE' THEN 2   WHEN HTTP_REQUEST_HTTP_METHOD =
      'GET' THEN 3   WHEN HTTP_REQUEST_HTTP_METHOD = 'HEAD' THEN 4   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'OPTIONS' THEN 5   WHEN HTTP_REQUEST_HTTP_METHOD = 'POST' THEN 6   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'PUT' THEN 7   WHEN HTTP_REQUEST_HTTP_METHOD = 'TRACE' THEN 8 WHEN HTTP_REQUEST_HTTP_METHOD
      = NULL THEN 0   ELSE 99  END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Connect'
      WHEN 2 THEN 'Delete' WHEN 3 THEN 'Get' WHEN 4 THEN 'Head' WHEN 5 THEN 'Options'
      WHEN 6 THEN 'Post' WHEN 7 THEN 'Put' WHEN 8 THEN 'Trace' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('http_activity')::VARCHAR
    class_uid: ('4002')::NUMBER
    cloud.provider: ('AWS')::VARCHAR
    connection_info.boundary: (CASE ((5)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Localhost' WHEN 10 THEN 'Gateway VPC' WHEN 11 THEN 'Internet Gateway' WHEN
      2 THEN 'Internal' WHEN 3 THEN 'External' WHEN 4 THEN 'Same VPC' WHEN 5 THEN
      'Internet/VPC Gateway' WHEN 6 THEN 'Virtual Private Gateway' WHEN 7 THEN 'Intra-region
      VPC' WHEN 8 THEN 'Inter-region VPC' WHEN 9 THEN 'Local Gateway' WHEN 99 THEN
      'Other' END)::VARCHAR
    connection_info.boundary_id: (5)::NUMBER
    connection_info.direction: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.direction_id: (1)::NUMBER
    connection_info.protocol_ver: (CASE ((PARSE_IP(HTTP_REQUEST_CLIENT_IP, 'INET',
      1):family)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 4 THEN 'Internet Protocol version
      4 (IPv4)' WHEN 6 THEN 'Internet Protocol version 6 (IPv6)' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.protocol_ver_id: (PARSE_IP(HTTP_REQUEST_CLIENT_IP, 'INET', 1):family)::NUMBER
    connection_info.uid: (HTTP_REQUEST_REQUEST_ID)::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.hostname: (HTTP_REQUEST_HEADERS:host)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    firewall_rule.match_details: (TERMINATING_RULE_MATCH_DETAILS)::ARRAY
    firewall_rule.rate_limit: (RATE_BASED_RULE_LIST[0]:maxRateAllowed)::NUMBER
    firewall_rule.type: (TERMINATING_RULE_TYPE)::VARCHAR
    firewall_rule.uid: (TERMINATING_RULE_ID)::VARCHAR
    http_cookies: NULL::ARRAY
    http_request.args: (HTTP_REQUEST_ARGS)::VARCHAR
    http_request.http_method: (CASE   WHEN HTTP_REQUEST_HTTP_METHOD = 'CONNECT' THEN
      'CONNECT'   WHEN HTTP_REQUEST_HTTP_METHOD = 'DELETE' THEN 'DELETE'   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'GET' THEN 'GET'   WHEN HTTP_REQUEST_HTTP_METHOD = 'HEAD' THEN 'HEAD'   WHEN
      HTTP_REQUEST_HTTP_METHOD = 'OPTIONS' THEN 'OPTIONS'   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'POST' THEN 'POST'   WHEN HTTP_REQUEST_HTTP_METHOD = 'PUT' THEN 'PUT'   WHEN
      HTTP_REQUEST_HTTP_METHOD = 'TRACE' THEN 'TRACE'   ELSE NULL  END)::VARCHAR
    http_request.referrer: (HTTP_REQUEST_HEADERS:referer)::VARCHAR
    http_request.uid: (HTTP_REQUEST_REQUEST_ID)::VARCHAR
    http_request.url.hostname: (HTTP_REQUEST_HEADERS:host)::VARCHAR
    http_request.url.path: (HTTP_REQUEST_URI)::VARCHAR
    http_request.url.query_string: (HTTP_REQUEST_ARGS)::VARCHAR
    http_request.user_agent: (HTTP_REQUEST_HEADERS:"user-agent")::VARCHAR
    http_request.version: (HTTP_REQUEST_HTTP_VERSION)::VARCHAR
    http_response: NULL::VARIANT
    http_status: NULL::NUMBER
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('aws-waf')::VARCHAR
    metadata.product.vendor_name: ('aws')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HTTP_REQUEST_HEADERS:host)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HTTP_REQUEST_HEADERS:host)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (HTTP_REQUEST_CLIENT_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (HTTP_REQUEST_CLIENT_IP)::VARCHAR
    src_endpoint.location.country: (HTTP_REQUEST_COUNTRY)::VARCHAR
    src_endpoint.name: (HTTP_SOURCE_NAME)::VARCHAR
    src_endpoint.uid: (HTTP_SOURCE_ID)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400200 + (CASE   WHEN HTTP_REQUEST_HTTP_METHOD = ''CONNECT''
      THEN 1   WHEN HTTP_REQUEST_HTTP_METHOD = ''DELETE'' THEN 2   WHEN HTTP_REQUEST_HTTP_METHOD
      = ''GET'' THEN 3   WHEN HTTP_REQUEST_HTTP_METHOD = ''HEAD'' THEN 4   WHEN HTTP_REQUEST_HTTP_METHOD
      = ''OPTIONS'' THEN 5   WHEN HTTP_REQUEST_HTTP_METHOD = ''POST'' THEN 6   WHEN
      HTTP_REQUEST_HTTP_METHOD = ''PUT'' THEN 7   WHEN HTTP_REQUEST_HTTP_METHOD =
      ''TRACE'' THEN 8 WHEN HTTP_REQUEST_HTTP_METHOD = NULL THEN 0   ELSE 99  END))::NUMBER)
      WHEN 400200 THEN ''HTTP Activity: Unknown'' WHEN 400201 THEN ''HTTP Activity:
      Connect'' WHEN 400202 THEN ''HTTP Activity: Delete'' WHEN 400203 THEN ''HTTP
      Activity: Get'' WHEN 400204 THEN ''HTTP Activity: Head'' WHEN 400205 THEN ''HTTP
      Activity: Options'' WHEN 400206 THEN ''HTTP Activity: Post'' WHEN 400207 THEN
      ''HTTP Activity: Put'' WHEN 400208 THEN ''HTTP Activity: Trace'' WHEN 400299
      THEN ''HTTP Activity: Other'' END)::VARCHAR'
    type_uid: (400200 + (CASE   WHEN HTTP_REQUEST_HTTP_METHOD = 'CONNECT' THEN 1   WHEN
      HTTP_REQUEST_HTTP_METHOD = 'DELETE' THEN 2   WHEN HTTP_REQUEST_HTTP_METHOD =
      'GET' THEN 3   WHEN HTTP_REQUEST_HTTP_METHOD = 'HEAD' THEN 4   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'OPTIONS' THEN 5   WHEN HTTP_REQUEST_HTTP_METHOD = 'POST' THEN 6   WHEN HTTP_REQUEST_HTTP_METHOD
      = 'PUT' THEN 7   WHEN HTTP_REQUEST_HTTP_METHOD = 'TRACE' THEN 8 WHEN HTTP_REQUEST_HTTP_METHOD
      = NULL THEN 0   ELSE 99  END))::NUMBER
    unmapped: NULL::VARIANT
