type: mapping
id: aws_guard_duty_2004_detection_finding_1.1.0
version: '1'
name: Aws Guard Duty to OCSF class Detection Finding
data-types:
- aws-guard-duty
mapping:
  fields:
    action: (CASE (CASE COALESCE(SERVICE_DNS_REQUEST_ACTION_BLOCKED, SERVICE_NETWORK_CONNECTION_BLOCKED)
      WHEN 'FALSE' THEN 1 WHEN 'TRUE' THEN 2 WHEN NULL THEN 0 ELSE 99 END::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN
      'Other' END)::VARCHAR
    action_id: (CASE COALESCE(SERVICE_DNS_REQUEST_ACTION_BLOCKED, SERVICE_NETWORK_CONNECTION_BLOCKED)
      WHEN 'FALSE' THEN 1 WHEN 'TRUE' THEN 2 WHEN NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN
      2 THEN 'Update' WHEN 3 THEN 'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api.service.name: (SERVICE_API_CALL_SERVICE_NAME)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (2::NUMBER) WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: (2)::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud.account.uid: (ACCOUNT_ID)::VARCHAR
    cloud.provider: ('AWS')::VARCHAR
    cloud.region: (REGION)::VARCHAR
    comment: NULL::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: NULL::NUMBER
    confidence_score: NULL::NUMBER
    count: NULL::NUMBER
    device.image.uid: (RESOURCE_INSTANCE_DETAILS:imageId)::VARCHAR
    device.instance_uid: (RESOURCE_INSTANCE_DETAILS:instanceId)::VARCHAR
    device.network_interfaces: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('uid', RESOURCE_INSTANCE_DETAILS:networkInterfaces[0]:networkInterfaceId,
      'ip', RESOURCE_INSTANCE_DETAILS:networkInterfaces[0]:privateIpAddress, 'type_id',
      0, 'type', 'Unknown')))::ARRAY
    device.subnet_uid: (RESOURCE_INSTANCE_DETAILS:networkInterfaces[0]:subnetId)::VARCHAR
    device.vpc_uid: (RESOURCE_INSTANCE_DETAILS:networkInterfaces[0]:vpcId)::VARCHAR
    device.zone: (RESOURCE_INSTANCE_DETAILS:availabilityZone)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: NULL::ARRAY
    finding_info.analytic.desc: (TYPE)::VARCHAR
    finding_info.analytic.name: (SERVICE_ACTION_TYPE)::VARCHAR
    finding_info.analytic.type: (CASE (CASE SERVICE_ACTION_TYPE WHEN NULL THEN 0 ELSE
      99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Rule' WHEN 2 THEN 'Behavioral'
      WHEN 3 THEN 'Statistical' WHEN 4 THEN 'Learning (ML/DL)' WHEN 99 THEN 'Other'
      END)::VARCHAR
    finding_info.analytic.type_id: (CASE SERVICE_ACTION_TYPE WHEN NULL THEN 0 ELSE
      99 END)::NUMBER
    finding_info.desc: (DESCRIPTION)::VARCHAR
    finding_info.first_seen_time: (date_part('epoch_milliseconds', SERVICE_EVENT_FIRST_SEEN::TIMESTAMP_LTZ))::NUMBER
    finding_info.first_seen_time_dt: (SERVICE_EVENT_FIRST_SEEN)::TIMESTAMP_LTZ
    finding_info.last_seen_time: (date_part('epoch_milliseconds', SERVICE_EVENT_LAST_SEEN::TIMESTAMP_LTZ))::NUMBER
    finding_info.last_seen_time_dt: (SERVICE_EVENT_LAST_SEEN)::TIMESTAMP_LTZ
    finding_info.title: (TITLE)::VARCHAR
    finding_info.uid: (SERVICE_DETECTOR_ID)::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('aws-guard-duty')::VARCHAR
    metadata.product.vendor_name: ('aws')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: NULL::ARRAY
    risk_level: NULL::VARCHAR
    risk_level_id: NULL::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE (CASE SEVERITY WHEN NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium'
      WHEN 4 THEN 'High' WHEN 5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other'
      END)::VARCHAR
    severity_id: (CASE SEVERITY WHEN NULL THEN 0 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', updated_at::TIMESTAMP_LTZ))::NUMBER
    time_dt: (updated_at)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (200400::NUMBER) WHEN 200400 THEN ''Detection Finding: Unknown''
      WHEN 200401 THEN ''Detection Finding: Create'' WHEN 200402 THEN ''Detection
      Finding: Update'' WHEN 200403 THEN ''Detection Finding: Close'' WHEN 200499
      THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: (200400)::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
