type: mapping
id: axis_activity_logs_4003_dns_activity_1.1.0
version: '11'
name: Axis Activity Logs to OCSF class Dns Activity
data-types:
- axis-activity-logs
mapping:
  fields:
    action: (CASE ((CASE WHEN IS_BLOCKED='FALSE' THEN 1 WHEN IS_BLOCKED='TRUE' THEN
      2 WHEN IS_BLOCKED IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN IS_BLOCKED='FALSE' THEN 1 WHEN IS_BLOCKED='TRUE' THEN 2
      WHEN IS_BLOCKED IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (2)::NUMBER
    activity_name: (CASE ((2)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Query' WHEN
      2 THEN 'Response' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (USER_EMAIL)::VARCHAR
    actor.user.name: (USERNAME)::VARCHAR
    actor.user.org.name: (ORGANIZATION_NAME)::VARCHAR
    actor.user.org.uid: (ORGANIZATION_ID)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    answers: NULL::ARRAY
    api: NULL::VARIANT
    app_name: (APP_NAME)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('dns_activity')::VARCHAR
    class_uid: ('4003')::NUMBER
    cloud.provider: (IDENTITY_PROVIDER_NAME)::VARCHAR
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device.os.name: (OPERATING_SYSTEM)::VARCHAR
    device.os.type: (CASE ((CASE WHEN OPERATING_SYSTEM='Windows' THEN 100 WHEN OPERATING_SYSTEM='Windows
      Mobile' THEN 101 WHEN OPERATING_SYSTEM='Linux' THEN 200 WHEN OPERATING_SYSTEM='Android'
      THEN 201 WHEN OPERATING_SYSTEM='Mac OS X' THEN 300 WHEN OPERATING_SYSTEM='iOS'
      THEN 301 WHEN OPERATING_SYSTEM='iPadOS' THEN 302 WHEN OPERATING_SYSTEM='Solaris'
      THEN 400 WHEN OPERATING_SYSTEM='AIX' THEN 401 WHEN OPERATING_SYSTEM='HP-UX'
      THEN 402 WHEN OPERATING_SYSTEM IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN
      'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN
      302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN
      'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN OPERATING_SYSTEM='Windows' THEN 100 WHEN OPERATING_SYSTEM='Windows
      Mobile' THEN 101 WHEN OPERATING_SYSTEM='Linux' THEN 200 WHEN OPERATING_SYSTEM='Android'
      THEN 201 WHEN OPERATING_SYSTEM='Mac OS X' THEN 300 WHEN OPERATING_SYSTEM='iOS'
      THEN 301 WHEN OPERATING_SYSTEM='iPadOS' THEN 302 WHEN OPERATING_SYSTEM='Solaris'
      THEN 400 WHEN OPERATING_SYSTEM='AIX' THEN 401 WHEN OPERATING_SYSTEM='HP-UX'
      THEN 402 WHEN OPERATING_SYSTEM IS NULL THEN 0 ELSE 99 END)::NUMBER
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.name: (RULE_NAME)::VARCHAR
    firewall_rule.uid: (RULE_ID)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('axis-activity-logs')::VARCHAR
    metadata.product.vendor_name: ('axis')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER_EMAIL)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USERNAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''query.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOST_NAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    query.hostname: (HOST_NAME)::VARCHAR
    query_time: NULL::NUMBER
    query_time_dt: NULL::TIMESTAMP_LTZ
    raw_data: NULL::VARCHAR
    rcode: NULL::VARCHAR
    rcode_id: NULL::NUMBER
    response_time: NULL::NUMBER
    response_time_dt: NULL::TIMESTAMP_LTZ
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.location.country: (GEOLOCATION)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400302)::NUMBER) WHEN 400300 THEN ''DNS Activity: Unknown''
      WHEN 400301 THEN ''DNS Activity: Query'' WHEN 400302 THEN ''DNS Activity: Response''
      WHEN 400306 THEN ''DNS Activity: Traffic'' WHEN 400399 THEN ''DNS Activity:
      Other'' END)::VARCHAR'
    type_uid: (400302)::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_TYPE = 'DnsRequest'
