type: mapping
id: azure_aks_6003_api_activity_1.1.0
version: '4'
name: Azure Aks to OCSF class Api Activity
data-types:
- azure-aks
mapping:
  fields:
    activity_id: (CASE WHEN PROPERTIES_LOG:verb::VARCHAR IS NULL THEN 0 WHEN PROPERTIES_LOG:verb::VARCHAR
      IN ('create', 'post') THEN 1 WHEN PROPERTIES_LOG:verb::VARCHAR IN ('watch',
      'list', 'get', 'options') THEN 2 WHEN PROPERTIES_LOG:verb::VARCHAR IN ('update',
      'patch') THEN 3 WHEN PROPERTIES_LOG:verb::VARCHAR ILIKE '%delete%' THEN 4 ELSE
      99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN PROPERTIES_LOG:verb::VARCHAR IS NULL THEN 0 WHEN
      PROPERTIES_LOG:verb::VARCHAR IN ('create', 'post') THEN 1 WHEN PROPERTIES_LOG:verb::VARCHAR
      IN ('watch', 'list', 'get', 'options') THEN 2 WHEN PROPERTIES_LOG:verb::VARCHAR
      IN ('update', 'patch') THEN 3 WHEN PROPERTIES_LOG:verb::VARCHAR ILIKE '%delete%'
      THEN 4 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN
      2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.authorizations: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('decision', PROPERTIES_LOG:annotations:"authorization.k8s.io/decision"::VARCHAR,
      'policy', OBJECT_CONSTRUCT('desc', PROPERTIES_LOG:annotations:"authorization.k8s.io/reason"::VARCHAR))))::ARRAY
    actor.user.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', PROPERTIES_LOG:user:groups[0]::VARCHAR)))::ARRAY
    actor.user.name: (PROPERTIES_LOG:user:username)::VARCHAR
    api.operation: (PROPERTIES_LOG:verb)::VARCHAR
    api.response.code: (PROPERTIES_LOG:responseStatus:code)::NUMBER
    api.version: (PROPERTIES_LOG:responseObject:apiVersion)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud.provider: ('Azure')::VARCHAR
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.url.path: (LOWER(RESOURCE_ID))::VARCHAR
    http_request.user_agent: (PROPERTIES_LOG:userAgent)::VARCHAR
    message: (PROPERTIES_LOG:responseObject:message)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('azure-aks')::VARCHAR
    metadata.product.vendor_name: ('azure')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PROPERTIES_LOG:user:username)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PROPERTIES_LOG:sourceIPs[0])::VARCHAR
    raw_data: NULL::VARCHAR
    resources: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', PROPERTIES_LOG:responseObject:metadata:name::VARCHAR,
      'namespace', PROPERTIES_LOG:responseObject:metadata:namespace::VARCHAR, 'uid',
      PROPERTIES_LOG:responseObject:metadata:uid::VARCHAR, 'version', PROPERTIES_LOG:responseObject:metadata:resourceVersion::VARCHAR)))::ARRAY
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (PROPERTIES_LOG:sourceIPs[0])::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: (PROPERTIES_LOG:responseStatus:code)::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((600300 + (CASE WHEN PROPERTIES_LOG:verb::VARCHAR IS NULL THEN
      0 WHEN PROPERTIES_LOG:verb::VARCHAR IN (''create'', ''post'') THEN 1 WHEN PROPERTIES_LOG:verb::VARCHAR
      IN (''watch'', ''list'', ''get'', ''options'') THEN 2 WHEN PROPERTIES_LOG:verb::VARCHAR
      IN (''update'', ''patch'') THEN 3 WHEN PROPERTIES_LOG:verb::VARCHAR ILIKE ''%delete%''
      THEN 4 ELSE 99 END))::NUMBER) WHEN 600300 THEN ''API Activity: Unknown'' WHEN
      600301 THEN ''API Activity: Create'' WHEN 600302 THEN ''API Activity: Read''
      WHEN 600303 THEN ''API Activity: Update'' WHEN 600304 THEN ''API Activity: Delete''
      WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (600300 + (CASE WHEN PROPERTIES_LOG:verb::VARCHAR IS NULL THEN 0 WHEN
      PROPERTIES_LOG:verb::VARCHAR IN ('create', 'post') THEN 1 WHEN PROPERTIES_LOG:verb::VARCHAR
      IN ('watch', 'list', 'get', 'options') THEN 2 WHEN PROPERTIES_LOG:verb::VARCHAR
      IN ('update', 'patch') THEN 3 WHEN PROPERTIES_LOG:verb::VARCHAR ILIKE '%delete%'
      THEN 4 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
