type: mapping
id: azure_ad_identity_protection_2004_detection_finding_1.1.0
version: '1'
name: Azure Ad Identity Protection to OCSF class Detection Finding
data-types:
- azure-ad-identity-protection
mapping:
  fields:
    action: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN
      'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN
      2 THEN 'Update' WHEN 3 THEN 'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (USER_PRINCIPAL_NAME)::VARCHAR
    actor.user.name: (USER_DISPLAY_NAME)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    api.request.uid: (REQUEST_ID)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (2::NUMBER) WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: (2)::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud.provider: ('Azure')::VARCHAR
    comment: NULL::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: NULL::NUMBER
    confidence_score: NULL::NUMBER
    count: NULL::NUMBER
    device.ip: (IP_ADDRESS)::VARCHAR
    device.location.city: (LOCATION:city)::VARCHAR
    device.location.coordinates: (ARRAY_CONSTRUCT(LOCATION:geoCoordinates:longitude,
      LOCATION:geoCoordinates:latitude))::ARRAY
    device.location.country: (LOCATION:countryOrRegion)::VARCHAR
    device.location.region: (LOCATION:state)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: NULL::ARRAY
    finding_info.first_seen_time: (date_part('epoch_milliseconds', DETECTED_DATE_TIME::TIMESTAMP_LTZ))::NUMBER
    finding_info.first_seen_time_dt: (DETECTED_DATE_TIME)::TIMESTAMP_LTZ
    finding_info.modified_time: (date_part('epoch_milliseconds', LAST_UPDATED_DATE_TIME::TIMESTAMP_LTZ))::NUMBER
    finding_info.modified_time_dt: (LAST_UPDATED_DATE_TIME)::TIMESTAMP_LTZ
    finding_info.title: (SOURCE)::VARCHAR
    finding_info.uid: (ID)::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('azure-ad-identity-protection')::VARCHAR
    metadata.product.vendor_name: ('azureAD')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER_PRINCIPAL_NAME)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER_DISPLAY_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IP_ADDRESS)::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: NULL::ARRAY
    risk_level: (CASE (CASE WHEN RISK_LEVEL ILIKE '%low%' THEN 1 WHEN RISK_LEVEL ILIKE
      '%medium%' THEN 2 WHEN RISK_LEVEL ILIKE '%high%' OR RISK_STATE ILIKE '%risk%'
      THEN 3 WHEN RISK_LEVEL ILIKE '%critical%' THEN 4 ELSE 0 END::NUMBER) WHEN 0
      THEN 'Info' WHEN 1 THEN 'Low' WHEN 2 THEN 'Medium' WHEN 3 THEN 'High' WHEN 4
      THEN 'Critical' END)::VARCHAR
    risk_level_id: (CASE WHEN RISK_LEVEL ILIKE '%low%' THEN 1 WHEN RISK_LEVEL ILIKE
      '%medium%' THEN 2 WHEN RISK_LEVEL ILIKE '%high%' OR RISK_STATE ILIKE '%risk%'
      THEN 3 WHEN RISK_LEVEL ILIKE '%critical%' THEN 4 ELSE 0 END)::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', last_updated_date_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (last_updated_date_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (200400::NUMBER) WHEN 200400 THEN ''Detection Finding: Unknown''
      WHEN 200401 THEN ''Detection Finding: Create'' WHEN 200402 THEN ''Detection
      Finding: Update'' WHEN 200403 THEN ''Detection Finding: Close'' WHEN 200499
      THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: (200400)::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
