type: mapping
id: azure_audit_6003_api_activity_1.1.0
version: '9'
name: Azure Audit to OCSF class Api Activity
data-types:
- azure-audit
mapping:
  fields:
    activity_id: (CASE WHEN PROPERTIES_OPERATION_TYPE IS NULL THEN 0 WHEN PROPERTIES_OPERATION_TYPE
      ILIKE '%Create%' THEN 1 WHEN PROPERTIES_OPERATION_TYPE = 'Get' THEN 2 WHEN PROPERTIES_OPERATION_TYPE
      ILIKE '%Update%' THEN 3 WHEN PROPERTIES_OPERATION_TYPE ILIKE '%delete%' OR PROPERTIES_OPERATION_TYPE
      ILIKE '%remove%' THEN 4 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN PROPERTIES_OPERATION_TYPE IS NULL THEN 0 WHEN
      PROPERTIES_OPERATION_TYPE ILIKE '%Create%' THEN 1 WHEN PROPERTIES_OPERATION_TYPE
      = 'Get' THEN 2 WHEN PROPERTIES_OPERATION_TYPE ILIKE '%Update%' THEN 3 WHEN PROPERTIES_OPERATION_TYPE
      ILIKE '%delete%' OR PROPERTIES_OPERATION_TYPE ILIKE '%remove%' THEN 4 ELSE 99
      END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Read'
      WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (PROPERTIES_INITIATED_BY:user:userPrincipalName)::VARCHAR
    actor.user.name: (PROPERTIES_INITIATED_BY:user:displayName)::VARCHAR
    actor.user.type: (CASE ((IFF(PROPERTIES_INITIATED_BY:user IS NOT NULL, 1, 99))::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (IFF(PROPERTIES_INITIATED_BY:user IS NOT NULL, 1, 99))::NUMBER
    actor.user.uid: (PROPERTIES_INITIATED_BY:user:id)::VARCHAR
    api.operation: (PROPERTIES_OPERATION_TYPE)::VARCHAR
    api.response.message: (OPERATION_NAME)::VARCHAR
    api.service.name: (PROPERTIES_LOGGED_BY_SERVICE)::VARCHAR
    api.service.uid: (PROPERTIES_ID)::VARCHAR
    api.version: (OPERATION_VERSION)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: (DURATION_MS)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.user_agent: (PROPERTIES:userAgent)::VARCHAR
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('azure-audit')::VARCHAR
    metadata.product.vendor_name: ('azure')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (PROPERTIES_INITIATED_BY:user:userPrincipalName)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PROPERTIES_INITIATED_BY:user:displayName)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CALLER_IP_ADDRESS)::VARCHAR
    raw_data: NULL::VARCHAR
    resources: (OBJECT_CONSTRUCT_KEEP_NULL('data', PROPERTIES_TARGET_RESOURCES[0]:modifiedProperties[0],
      'group', OBJECT_CONSTRUCT_KEEP_NULL('type', PROPERTIES_TARGET_RESOURCES[0]:groupType),
      'name', PROPERTIES_TARGET_RESOURCES[0]:displayName, 'owner', OBJECT_CONSTRUCT_KEEP_NULL('name',
      PROPERTIES_TARGET_RESOURCES[0]:userPrincipalName), 'type', PROPERTIES_TARGET_RESOURCES[0]:type,
      'uid', COALESCE(PROPERTIES_TARGET_RESOURCES[0]:id, RESOURCE_ID)))::ARRAY
    severity: (CASE ((CASE WHEN LEVEL IS NULL THEN 0 WHEN LEVEL ILIKE '%Information%'
      THEN 1 WHEN LEVEL = 'Warning' THEN 3 WHEN LEVEL = 'Error' THEN 4 WHEN LEVEL
      = 'Critical' THEN 5 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN
      5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN LEVEL IS NULL THEN 0 WHEN LEVEL ILIKE '%Information%'
      THEN 1 WHEN LEVEL = 'Warning' THEN 3 WHEN LEVEL = 'Error' THEN 4 WHEN LEVEL
      = 'Critical' THEN 5 ELSE 99 END)::NUMBER
    src_endpoint.ip: (CALLER_IP_ADDRESS)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE) IS NULL
      OR COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE) = 'None' THEN 0 WHEN COALESCE(PROPERTIES_RESULT,
      RESULT_SIGNATURE) = 'success' OR COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE)
      ILIKE '%Succeeded%' THEN 1 WHEN COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE)
      = 'failure' OR COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE) ILIKE '%Failed%'
      THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN
      2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE, PROPERTIES:resultReason))::VARCHAR
    status_id: (CASE WHEN COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE) IS NULL OR
      COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE) = 'None' THEN 0 WHEN COALESCE(PROPERTIES_RESULT,
      RESULT_SIGNATURE) = 'success' OR COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE)
      ILIKE '%Succeeded%' THEN 1 WHEN COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE)
      = 'failure' OR COALESCE(PROPERTIES_RESULT, RESULT_SIGNATURE) ILIKE '%Failed%'
      THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN PROPERTIES_OPERATION_TYPE IS NULL THEN 600300 WHEN
      PROPERTIES_OPERATION_TYPE ILIKE ''%Create%'' THEN 600301 WHEN PROPERTIES_OPERATION_TYPE
      = ''Get'' THEN 600302 WHEN PROPERTIES_OPERATION_TYPE ILIKE ''%Update%'' THEN
      600303 WHEN PROPERTIES_OPERATION_TYPE ILIKE ''%delete%'' OR PROPERTIES_OPERATION_TYPE
      ILIKE ''%remove%'' THEN 600304 ELSE 600399 END)::NUMBER) WHEN 600300 THEN ''API
      Activity: Unknown'' WHEN 600301 THEN ''API Activity: Create'' WHEN 600302 THEN
      ''API Activity: Read'' WHEN 600303 THEN ''API Activity: Update'' WHEN 600304
      THEN ''API Activity: Delete'' WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN PROPERTIES_OPERATION_TYPE IS NULL THEN 600300 WHEN PROPERTIES_OPERATION_TYPE
      ILIKE '%Create%' THEN 600301 WHEN PROPERTIES_OPERATION_TYPE = 'Get' THEN 600302
      WHEN PROPERTIES_OPERATION_TYPE ILIKE '%Update%' THEN 600303 WHEN PROPERTIES_OPERATION_TYPE
      ILIKE '%delete%' OR PROPERTIES_OPERATION_TYPE ILIKE '%remove%' THEN 600304 ELSE
      600399 END)::NUMBER
    unmapped: NULL::VARIANT
  predicate: PROPERTIES_OPERATION_TYPE IS NOT NULL
