type: mapping
id: azure_nsg_flow_logs_4001_network_activity_1.1.0
version: '12'
name: Azure Nsg Flow Logs to OCSF class Network Activity
data-types:
- azure-nsg-flow-logs
mapping:
  fields:
    action: (CASE ((CASE WHEN TRAFFIC_DECISION IS NULL THEN 0 WHEN TRAFFIC_DECISION
      = 'A' THEN 1 WHEN TRAFFIC_DECISION = 'D' THEN 2 ELSE 99 END)::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other'
      END)::VARCHAR
    action_id: (CASE WHEN TRAFFIC_DECISION IS NULL THEN 0 WHEN TRAFFIC_DECISION =
      'A' THEN 1 WHEN TRAFFIC_DECISION = 'D' THEN 2 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN FLOW_STATE IS NULL THEN 0 WHEN FLOW_STATE = 'B' THEN 1
      WHEN FLOW_STATE = 'E' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN FLOW_STATE IS NULL THEN 0 WHEN FLOW_STATE = 'B'
      THEN 1 WHEN FLOW_STATE = 'E' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Open' WHEN 2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail'
      WHEN 5 THEN 'Refuse' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((CASE WHEN TRAFFIC_DIRECTION IS NULL THEN 0
      WHEN lower(TRAFFIC_DIRECTION) = 'o' THEN 2 WHEN lower(TRAFFIC_DIRECTION) = 'i'
      THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Inbound' WHEN
      2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other' END)::VARCHAR
    connection_info.direction_id: (CASE WHEN TRAFFIC_DIRECTION IS NULL THEN 0 WHEN
      lower(TRAFFIC_DIRECTION) = 'o' THEN 2 WHEN lower(TRAFFIC_DIRECTION) = 'i' THEN
      1 ELSE 99 END)::NUMBER
    connection_info.protocol_name: (CASE WHEN LOWER(PROTOCOL) = 'u' THEN 'udp' WHEN
      LOWER(PROTOCOL) = 't' THEN 'tcp' ELSE NULL END)::VARCHAR
    connection_info.protocol_num: (CASE WHEN LOWER(PROTOCOL) = 'u' THEN 17 WHEN LOWER(PROTOCOL)
      = 't' THEN 6 ELSE NULL END)::NUMBER
    count: NULL::NUMBER
    device.network_interfaces: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('mac', MAC_ADDRESS)))::ARRAY
    disposition: (CASE ((CASE WHEN TRAFFIC_DECISION IS NULL THEN 0 WHEN TRAFFIC_DECISION
      = 'A' THEN 1 WHEN TRAFFIC_DECISION = 'D' THEN 2 ELSE 99 END)::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 10 THEN 'Exonerated' WHEN 11 THEN
      'Corrected' WHEN 12 THEN 'Partially Corrected' WHEN 13 THEN 'Uncorrected' WHEN
      14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN 16 THEN 'No Action' WHEN 17 THEN
      'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN 'Alert' WHEN 2 THEN 'Blocked' WHEN
      20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN 22 THEN 'Captcha' WHEN 23 THEN 'Challenge'
      WHEN 24 THEN 'Access Revoked' WHEN 25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized'
      WHEN 27 THEN 'Error' WHEN 3 THEN 'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5
      THEN 'Deleted' WHEN 6 THEN 'Dropped' WHEN 7 THEN 'Custom Action' WHEN 8 THEN
      'Approved' WHEN 9 THEN 'Restored' WHEN 99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN TRAFFIC_DECISION IS NULL THEN 0 WHEN TRAFFIC_DECISION
      = 'A' THEN 1 WHEN TRAFFIC_DECISION = 'D' THEN 2 ELSE 99 END)::NUMBER
    dst_endpoint.ip: (DESTINATION_IP)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.name: (RULE_NAME)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('azure-nsg-flow-logs')::VARCHAR
    metadata.product.vendor_name: ('azure')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.port: (SOURCE_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes: (BYTES_SOURCE_TO_DESTINATION + BYTES_DESTINATION_TO_SOURCE)::NUMBER
    traffic.bytes_in: (BYTES_DESTINATION_TO_SOURCE)::NUMBER
    traffic.bytes_out: (BYTES_SOURCE_TO_DESTINATION)::NUMBER
    traffic.packets: (PACKETS_SOURCE_TO_DESTINATION + PACKETS_DESTINATION_TO_SOURCE)::NUMBER
    traffic.packets_in: (PACKETS_DESTINATION_TO_SOURCE)::NUMBER
    traffic.packets_out: (PACKETS_SOURCE_TO_DESTINATION)::NUMBER
    type_name: '(CASE ((400100 + (CASE WHEN FLOW_STATE IS NULL THEN 0 WHEN FLOW_STATE
      = ''B'' THEN 1 WHEN FLOW_STATE = ''E'' THEN 2 ELSE 99 END))::NUMBER) WHEN 400100
      THEN ''Network Activity: Unknown'' WHEN 400101 THEN ''Network Activity: Open''
      WHEN 400102 THEN ''Network Activity: Close'' WHEN 400103 THEN ''Network Activity:
      Reset'' WHEN 400104 THEN ''Network Activity: Fail'' WHEN 400105 THEN ''Network
      Activity: Refuse'' WHEN 400106 THEN ''Network Activity: Traffic'' WHEN 400199
      THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400100 + (CASE WHEN FLOW_STATE IS NULL THEN 0 WHEN FLOW_STATE = 'B'
      THEN 1 WHEN FLOW_STATE = 'E' THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
