type: mapping
id: azure_audit_3006_group_management_1.1.0
version: '8'
name: Azure Audit to OCSF class Group Management
data-types:
- azure-audit
mapping:
  fields:
    activity_id: (CASE WHEN OPERATION_NAME IS NULL THEN 0 WHEN OPERATION_NAME ILIKE
      '%policy%added%' THEN 1 WHEN OPERATION_NAME ILIKE '%policy%removed%' THEN 2
      WHEN OPERATION_NAME ILIKE '%add%member%group%' OR OPERATION_NAME ILIKE '%add%owner%group%'
      THEN 3 WHEN OPERATION_NAME ILIKE '%remove%group%member%' OR OPERATION_NAME ILIKE
      '%remove%member%group%' OR OPERATION_NAME ILIKE '%remove%owner%group%' THEN
      4 WHEN OPERATION_NAME ILIKE '%delete%group%' THEN 5 WHEN OPERATION_NAME ILIKE
      '%group%create%' OR OPERATION_NAME ILIKE '%add%group%' THEN 6 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION_NAME IS NULL THEN 0 WHEN OPERATION_NAME
      ILIKE '%policy%added%' THEN 1 WHEN OPERATION_NAME ILIKE '%policy%removed%' THEN
      2 WHEN OPERATION_NAME ILIKE '%add%member%group%' OR OPERATION_NAME ILIKE '%add%owner%group%'
      THEN 3 WHEN OPERATION_NAME ILIKE '%remove%group%member%' OR OPERATION_NAME ILIKE
      '%remove%member%group%' OR OPERATION_NAME ILIKE '%remove%owner%group%' THEN
      4 WHEN OPERATION_NAME ILIKE '%delete%group%' THEN 5 WHEN OPERATION_NAME ILIKE
      '%group%create%' OR OPERATION_NAME ILIKE '%add%group%' THEN 6 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Assign Privileges' WHEN 2 THEN 'Revoke Privileges'
      WHEN 3 THEN 'Add User' WHEN 4 THEN 'Remove User' WHEN 5 THEN 'Delete' WHEN 6
      THEN 'Create' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.invoked_by: (PROPERTIES_LOGGED_BY_SERVICE)::VARCHAR
    api.operation: (PROPERTIES_OPERATION_TYPE)::VARCHAR
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('group_management')::VARCHAR
    class_uid: ('3006')::NUMBER
    cloud.provider: ('MS Azure')::VARCHAR
    count: NULL::NUMBER
    device.ip: (CALLER_IP_ADDRESS)::VARCHAR
    duration: (DURATION_MS)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    group.name: (IFF(PROPERTIES_TARGET_RESOURCES[0]:type ILIKE '%group%', PROPERTIES_TARGET_RESOURCES[0]:displayName,
      NULL))::VARCHAR
    group.type: (IFF(PROPERTIES_TARGET_RESOURCES[0]:type ILIKE '%group%', PROPERTIES_TARGET_RESOURCES[0]:groupType,
      NULL))::VARCHAR
    group.uid: (IFF(PROPERTIES_TARGET_RESOURCES[0]:type ILIKE '%group%', PROPERTIES_TARGET_RESOURCES[0]:id,
      NULL))::VARCHAR
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('azure-audit')::VARCHAR
    metadata.product.vendor_name: ('azure')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CALLER_IP_ADDRESS)::VARCHAR
    - name: '''resource.owner.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (PROPERTIES_TARGET_RESOURCES[0]:userPrincipalName)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (PROPERTIES_INITIATED_BY:user:userPrincipalName)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PROPERTIES_INITIATED_BY:user:displayName)::VARCHAR
    privileges: NULL::ARRAY
    raw_data: NULL::VARCHAR
    resource.data: (PROPERTIES_TARGET_RESOURCES[0]:modifiedProperties[0])::VARIANT
    resource.name: (PROPERTIES_TARGET_RESOURCES[0]:displayName)::VARCHAR
    resource.owner.email_addr: (PROPERTIES_TARGET_RESOURCES[0]:userPrincipalName)::VARCHAR
    resource.type: (PROPERTIES_TARGET_RESOURCES[0]:type)::VARCHAR
    resource.uid: (RESOURCE_ID)::VARCHAR
    severity: (CASE ((CASE WHEN LEVEL IS NULL THEN 0 WHEN LEVEL ILIKE '%Information%'
      THEN 1 WHEN LEVEL = 'Warning' THEN 3 WHEN LEVEL = 'Error' THEN 4 WHEN LEVEL
      = 'Critical' THEN 5 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN
      5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN LEVEL IS NULL THEN 0 WHEN LEVEL ILIKE '%Information%'
      THEN 1 WHEN LEVEL = 'Warning' THEN 3 WHEN LEVEL = 'Error' THEN 4 WHEN LEVEL
      = 'Critical' THEN 5 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN PROPERTIES_RESULT IS NULL THEN 0 WHEN PROPERTIES_RESULT
      ILIKE '%success%' THEN 1 WHEN PROPERTIES_RESULT ILIKE '%failure%' THEN 2 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure'
      WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (PROPERTIES_RESULT_REASON)::VARCHAR
    status_id: (CASE WHEN PROPERTIES_RESULT IS NULL THEN 0 WHEN PROPERTIES_RESULT
      ILIKE '%success%' THEN 1 WHEN PROPERTIES_RESULT ILIKE '%failure%' THEN 2 ELSE
      99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN OPERATION_NAME IS NULL THEN 300600 WHEN OPERATION_NAME
      ILIKE ''%policy%added%'' THEN 300601 WHEN OPERATION_NAME ILIKE ''%policy%removed%''
      THEN 300602 WHEN OPERATION_NAME ILIKE ''%add%member%group%'' OR OPERATION_NAME
      ILIKE ''%add%owner%group%'' THEN 300603 WHEN OPERATION_NAME ILIKE ''%remove%group%member%''
      OR OPERATION_NAME ILIKE ''%remove%member%group%'' OR OPERATION_NAME ILIKE ''%remove%owner%group%''
      THEN 300604 WHEN OPERATION_NAME ILIKE ''%delete%group%'' THEN 300605 WHEN OPERATION_NAME
      ILIKE ''%group%create%'' OR OPERATION_NAME ILIKE ''%add%group%'' THEN 300606
      ELSE 300699 END)::NUMBER) WHEN 300600 THEN ''Group Management: Unknown'' WHEN
      300601 THEN ''Group Management: Assign Privileges'' WHEN 300602 THEN ''Group
      Management: Revoke Privileges'' WHEN 300603 THEN ''Group Management: Add User''
      WHEN 300604 THEN ''Group Management: Remove User'' WHEN 300605 THEN ''Group
      Management: Delete'' WHEN 300606 THEN ''Group Management: Create'' WHEN 300699
      THEN ''Group Management: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN OPERATION_NAME IS NULL THEN 300600 WHEN OPERATION_NAME ILIKE
      '%policy%added%' THEN 300601 WHEN OPERATION_NAME ILIKE '%policy%removed%' THEN
      300602 WHEN OPERATION_NAME ILIKE '%add%member%group%' OR OPERATION_NAME ILIKE
      '%add%owner%group%' THEN 300603 WHEN OPERATION_NAME ILIKE '%remove%group%member%'
      OR OPERATION_NAME ILIKE '%remove%member%group%' OR OPERATION_NAME ILIKE '%remove%owner%group%'
      THEN 300604 WHEN OPERATION_NAME ILIKE '%delete%group%' THEN 300605 WHEN OPERATION_NAME
      ILIKE '%group%create%' OR OPERATION_NAME ILIKE '%add%group%' THEN 300606 ELSE
      300699 END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (PROPERTIES_INITIATED_BY:user:userPrincipalName)::VARCHAR
    user.name: (PROPERTIES_INITIATED_BY:user:displayName)::VARCHAR
    user.org.uid: (TENANT_ID)::VARCHAR
    user.uid: (PROPERTIES_INITIATED_BY:user:id)::VARCHAR
  predicate: PROPERTIES_CATEGORY = 'GroupManagement'
