type: mapping
id: azure_audit_3005_user_access_1.1.0
version: '8'
name: Azure Audit to OCSF class User Access
data-types:
- azure-audit
mapping:
  fields:
    activity_id: (CASE WHEN OPERATION_NAME ILIKE ANY ('%assign%', '%add%', '%Update%')
      THEN 1 WHEN OPERATION_NAME ILIKE '%remove%' THEN 2 WHEN OPERATION_NAME IS NULL
      THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION_NAME ILIKE ANY ('%assign%', '%add%',
      '%Update%') THEN 1 WHEN OPERATION_NAME ILIKE '%remove%' THEN 2 WHEN OPERATION_NAME
      IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Assign
      Privileges' WHEN 2 THEN 'Revoke Privileges' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api.operation: (PROPERTIES_OPERATION_TYPE)::VARCHAR
    api.service.name: (PROPERTIES_LOGGED_BY_SERVICE)::VARCHAR
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('user_access')::VARCHAR
    class_uid: ('3005')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.ip: (CALLER_IP_ADDRESS)::VARCHAR
    duration: (DURATION_MS)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: (OPERATION_NAME)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('azure-audit')::VARCHAR
    metadata.product.vendor_name: ('azure')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CALLER_IP_ADDRESS)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (PROPERTIES_INITIATED_BY:user:userPrincipalName)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PROPERTIES_INITIATED_BY:user:displayName)::VARCHAR
    privileges: (ARRAY_CONSTRUCT(IFF(PROPERTIES_TARGET_RESOURCES[0]:type='Role', PROPERTIES_TARGET_RESOURCES[0]:displayName,
      NULL)))::ARRAY
    raw_data: NULL::VARCHAR
    resource.uid: (RESOURCE_ID)::VARCHAR
    severity: (CASE ((CASE WHEN LEVEL=4 THEN 1 WHEN LEVEL IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN
      'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN
      99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN LEVEL=4 THEN 1 WHEN LEVEL IS NULL THEN 0 ELSE 99 END)::NUMBER
    start_time: (date_part('epoch_milliseconds', (PROPERTIES_ACTIVITY_DATE_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (PROPERTIES_ACTIVITY_DATE_TIME)::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN PROPERTIES_RESULT='success' THEN 1 WHEN PROPERTIES_RESULT='failure'
      THEN 2 WHEN PROPERTIES_RESULT IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (COALESCE(PROPERTIES_RESULT, PROPERTIES_RESULT_REASON))::VARCHAR
    status_id: (CASE WHEN PROPERTIES_RESULT='success' THEN 1 WHEN PROPERTIES_RESULT='failure'
      THEN 2 WHEN PROPERTIES_RESULT IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN OPERATION_NAME ILIKE ANY (''%assign%'', ''%add%'',
      ''%Update%'') THEN 300501 WHEN OPERATION_NAME ILIKE ''%remove%'' THEN 300502
      WHEN OPERATION_NAME IS NULL THEN 300500 ELSE 300599 END)::NUMBER) WHEN 300500
      THEN ''User Access Management: Unknown'' WHEN 300501 THEN ''User Access Management:
      Assign Privileges'' WHEN 300502 THEN ''User Access Management: Revoke Privileges''
      WHEN 300599 THEN ''User Access Management: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN OPERATION_NAME ILIKE ANY ('%assign%', '%add%', '%Update%')
      THEN 300501 WHEN OPERATION_NAME ILIKE '%remove%' THEN 300502 WHEN OPERATION_NAME
      IS NULL THEN 300500 ELSE 300599 END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (PROPERTIES_INITIATED_BY:user:userPrincipalName)::VARCHAR
    user.name: (PROPERTIES_INITIATED_BY:user:displayName)::VARCHAR
    user.org.uid: (TENANT_ID)::VARCHAR
    user.uid: (PROPERTIES_INITIATED_BY:user:id)::VARCHAR
  predicate: OPERATION_NAME ILIKE ANY ('%policy%', '%role%')
