type: mapping
id: azure_active_directory_users_5003_user_inventory_1.1.0
version: '9'
name: Azure Active Directory Users to OCSF class User Inventory
data-types:
- azure-active-directory-users
mapping:
  fields:
    activity_id: (2)::NUMBER
    activity_name: (CASE ((2)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Log' WHEN
      2 THEN 'Collect' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((5)::NUMBER) WHEN 5 THEN 'Discovery' END)::VARCHAR
    category_uid: (5)::NUMBER
    class_name: ('user_inventory')::VARCHAR
    class_uid: ('5003')::NUMBER
    cloud.provider: ('MS Azure')::VARCHAR
    count: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('azure-active-directory-users')::VARCHAR
    metadata.product.vendor_name: ('azureAD')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (COALESCE(USER_PRINCIPAL_NAME, MAIL))::VARCHAR
    - name: '''user.ldap_person.email_addrs'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (OTHER_MAILS)::ARRAY
    - name: '''user.ldap_person.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (MAIL_NICKNAME)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', snapshot_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (snapshot_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((500302)::NUMBER) WHEN 500300 THEN ''User Inventory Info: Unknown''
      WHEN 500301 THEN ''User Inventory Info: Log'' WHEN 500302 THEN ''User Inventory
      Info: Collect'' WHEN 500399 THEN ''User Inventory Info: Other'' END)::VARCHAR'
    type_uid: (500302)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (COALESCE(USER_PRINCIPAL_NAME, MAIL))::VARCHAR
    user.full_name: (DISPLAY_NAME)::VARCHAR
    user.ldap_person.email_addrs: (OTHER_MAILS)::ARRAY
    user.ldap_person.employee_uid: (EMPLOYEE_ID)::VARCHAR
    user.ldap_person.given_name: (GIVEN_NAME)::VARCHAR
    user.ldap_person.job_title: (JOB_TITLE)::VARCHAR
    user.ldap_person.location.city: (CITY)::VARCHAR
    user.ldap_person.location.country: (COUNTRY)::VARCHAR
    user.ldap_person.location.postal_code: (POSTAL_CODE)::VARCHAR
    user.ldap_person.surname: (SURNAME)::VARCHAR
    user.name: (MAIL_NICKNAME)::VARCHAR
    user.org.ou_name: (DEPARTMENT)::VARCHAR
    user.type: (CASE ((CASE WHEN USER_TYPE IS NULL THEN 0 WHEN USER_TYPE ILIKE '%user%'
      OR USER_TYPE = 'Member' THEN 1 WHEN USER_TYPE ILIKE '%admin%' THEN 2 WHEN USER_TYPE
      ILIKE '%system%' THEN 3 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN USER_TYPE IS NULL THEN 0 WHEN USER_TYPE ILIKE '%user%'
      OR USER_TYPE = 'Member' THEN 1 WHEN USER_TYPE ILIKE '%admin%' THEN 2 WHEN USER_TYPE
      ILIKE '%system%' THEN 3 ELSE 99 END)::NUMBER
