type: mapping
id: azure_activity_6003_api_activity_1.1.0
version: '10'
name: Azure Activity to OCSF class Api Activity
data-types:
- azure-activity
mapping:
  fields:
    activity_id: (CASE WHEN OPERATION_NAME ILIKE '%LIST%' THEN 2 WHEN OPERATION_NAME
      ILIKE '%DELETE%' THEN 4 WHEN OPERATION_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION_NAME ILIKE '%LIST%' THEN 2 WHEN OPERATION_NAME
      ILIKE '%DELETE%' THEN 4 WHEN OPERATION_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update'
      WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.authorizations: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('policy', IDENTITY_AUTHORIZATION:evidence:role)))::ARRAY
    actor.user.email_addr: (identity:claims:"http://schemas.xmlsoap.org/ws/2005/05/identity/claims/upn")::VARCHAR
    actor.user.org.name: (RAW:source:as:organization:name)::VARCHAR
    api.operation: (OPERATION_NAME)::VARCHAR
    api.request.data: (OBJECT_CONSTRUCT('request_body', PROPERTIES:requestbody))::VARIANT
    api.response.data: (OBJECT_CONSTRUCT('response_body', PROPERTIES:responseBody))::VARIANT
    api.response.error_message: (PROPERTIES:errorMessage)::VARCHAR
    api.service.name: (PROPERTIES:service)::VARCHAR
    api.service.uid: (PROPERTIES:serviceRequestId)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: (DURATION_MS)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: (PROPERTIES:message)::VARCHAR
    metadata.event_code: (operation_name)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('azure-activity')::VARCHAR
    metadata.product.vendor_name: ('azure')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (identity:claims:"http://schemas.xmlsoap.org/ws/2005/05/identity/claims/upn")::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(CALLER_IP_ADDRESS, RAW:source_ip, RAW:source:as:ip))::VARCHAR
    raw_data: NULL::VARCHAR
    resources: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('uid', COALESCE(RESOURCE_ID, PROPERTIES:legacyResourceId),
      'type', PROPERTIES:legacyResourceType, 'data', OBJECT_CONSTRUCT('ResourceProviderName',
      PROPERTIES:legacyResourceProviderName, 'resourceLocation', PROPERTIES:resourceLocation),
      'group', OBJECT_CONSTRUCT( 'name', PROPERTIES:legacyResourceGroup))))::ARRAY
    severity: (CASE ((CASE WHEN LEVEL IN ('Information', 'Informational') THEN 1 WHEN
      LEVEL='Warning' THEN 3 WHEN LEVEL='Error' THEN 6 WHEN LEVEL IS NULL THEN 0 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN 2 THEN
      'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical' WHEN 6
      THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN LEVEL IN ('Information', 'Informational') THEN 1 WHEN
      LEVEL='Warning' THEN 3 WHEN LEVEL='Error' THEN 6 WHEN LEVEL IS NULL THEN 0 ELSE
      99 END)::NUMBER
    src_endpoint.ip: (COALESCE(CALLER_IP_ADDRESS, RAW:source_ip, RAW:source:as:ip))::VARCHAR
    src_endpoint.location.city: (RAW:source:geo:city_name)::VARCHAR
    src_endpoint.location.continent: (RAW:source:geo:continent_code)::VARCHAR
    src_endpoint.location.coordinates: (ARRAY_CONSTRUCT(RAW:source:geo:longitude,
      RAW:source:geo:latitude))::ARRAY
    src_endpoint.location.country: (RAW:source:geo:country_name)::VARCHAR
    src_endpoint.location.postal_code: (RAW:source:geo:postal_code)::VARCHAR
    src_endpoint.location.region: (RAW:source:geo:region_name)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RESULT_TYPE='Success' THEN 1 WHEN RESULT_TYPE='Failure'
      THEN 2 WHEN RESULT_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: (PROPERTIES:statusCode)::VARCHAR
    status_detail: (COALESCE(RAW:resultDescription, RESULT_SIGNATURE))::VARCHAR
    status_id: (CASE WHEN RESULT_TYPE='Success' THEN 1 WHEN RESULT_TYPE='Failure'
      THEN 2 WHEN RESULT_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN OPERATION_NAME ILIKE ''%LIST%'' THEN 600302 WHEN
      OPERATION_NAME ILIKE ''%DELETE%'' THEN 600304 WHEN OPERATION_NAME IS NULL THEN
      600300 ELSE 600399 END)::NUMBER) WHEN 600300 THEN ''API Activity: Unknown''
      WHEN 600301 THEN ''API Activity: Create'' WHEN 600302 THEN ''API Activity: Read''
      WHEN 600303 THEN ''API Activity: Update'' WHEN 600304 THEN ''API Activity: Delete''
      WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN OPERATION_NAME ILIKE '%LIST%' THEN 600302 WHEN OPERATION_NAME
      ILIKE '%DELETE%' THEN 600304 WHEN OPERATION_NAME IS NULL THEN 600300 ELSE 600399
      END)::NUMBER
    unmapped: NULL::VARIANT
