type: mapping
id: barracuda_box_auth_control_services_logs_3002_authentication_1.1.0
version: '1'
name: Barracuda Box Auth Control Services Logs to OCSF class Authentication
data-types:
- barracuda-box-auth-control-services-logs
mapping:
  fields:
    activity_id: (CASE WHEN EVENT_TYPE='Authentication Login' THEN 1 WHEN EVENT_TYPE
      IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_TYPE='Authentication Login' THEN 1 WHEN
      EVENT_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1
      THEN 'Logon' WHEN 2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket' WHEN 4
      THEN 'Service Ticket Request' WHEN 5 THEN 'Service Ticket Renew' WHEN 99 THEN
      'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: NULL::VARCHAR
    auth_protocol_id: NULL::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud.provider: ('Barracuda')::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    dst_endpoint.ip: (IP_ADDRESS)::VARCHAR
    dst_endpoint.name: (SERVER)::VARCHAR
    duration: (DURATION)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: (MESSAGE)::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('barracuda-box-auth-control-services-logs')::VARCHAR
    metadata.product.vendor_name: ('barracuda')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IP_ADDRESS)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PEER_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER)::VARCHAR
    raw_data: NULL::VARCHAR
    service.name: (SERVICE)::VARCHAR
    session: NULL::VARIANT
    severity: (CASE ((CASE WHEN LOG_LEVEL='Info' THEN 1 WHEN LOG_LEVEL IS NULL THEN
      0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN
      2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN LOG_LEVEL='Info' THEN 1 WHEN LOG_LEVEL IS NULL THEN 0
      ELSE 99 END)::NUMBER
    src_endpoint.ip: (PEER_IP)::VARCHAR
    start_time: (date_part('epoch_milliseconds', START_TIME::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (START_TIME)::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300200 + (CASE WHEN EVENT_TYPE=''Authentication Login'' THEN
      1 WHEN EVENT_TYPE IS NULL THEN 0 ELSE 99 END))::NUMBER) WHEN 300200 THEN ''Authentication:
      Unknown'' WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (300200 + (CASE WHEN EVENT_TYPE='Authentication Login' THEN 1 WHEN EVENT_TYPE
      IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.ldap_person.created_time: (date_part('epoch_milliseconds', START_TIME::TIMESTAMP_LTZ))::NUMBER
    user.ldap_person.created_time_dt: (START_TIME)::TIMESTAMP_LTZ
    user.ldap_person.ldap_dn: (LDAP_DN)::VARCHAR
    user.name: (USER)::VARCHAR
  predicate: EVENT_TYPE ILIKE '%Authentication%'
