type: mapping
id: barracuda_box_firewall_activity_logs_4001_network_activity_1.1.0
version: '1'
name: Barracuda Box Firewall Activity Logs to OCSF class Network Activity
data-types:
- barracuda-box-firewall-activity-logs
mapping:
  fields:
    action: (CASE (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION = 'Allow' THEN 1 WHEN
      ACTION = 'Block' THEN 2 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION = 'Allow' THEN 1 WHEN
      ACTION = 'Block' THEN 2 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN EVENT_TYPE = 'FWD' THEN 6 WHEN EVENT_TYPE = 'LOUT' THEN
      2 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN EVENT_TYPE = 'FWD' THEN 6 WHEN EVENT_TYPE = 'LOUT'
      THEN 2 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2
      THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.name: (USER)::VARCHAR
    api: NULL::VARIANT
    app_name: (APPLICATION)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.provider: ('Barracuda')::VARCHAR
    connection_info.protocol_name: (LOWER(PROTOCOL))::VARCHAR
    connection_info.protocol_num: (CASE WHEN PROTOCOL IS NULL THEN 0 WHEN PROTOCOL
      = 'ICMP' THEN 1 WHEN PROTOCOL = 'TCP' THEN 6 WHEN PROTOCOL = 'UDP' THEN 17 ELSE
      -1 END)::NUMBER
    count: (COUNT)::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.hostname: (CASE WHEN REGEXP_LIKE(TARGET, '\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}')
      THEN NULL ELSE TARGET END)::VARCHAR
    dst_endpoint.interface_name: (DESTINATION_NETWORK_INTERFACE)::VARCHAR
    dst_endpoint.ip: (DESTINATION_IP)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    dst_endpoint.proxy_endpoint.ip: (DESTINATION_NAT_IP)::VARCHAR
    dst_endpoint.svc_name: (DESTINATION_SERVICE)::VARCHAR
    duration: (DURATION)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.name: (FIREWALL_RULE)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('barracuda-box-firewall-activity-logs')::VARCHAR
    metadata.product.vendor_name: ('barracuda')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER)::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (CASE WHEN REGEXP_LIKE(TARGET, '\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}')
        THEN NULL ELSE TARGET END)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP)::VARCHAR
    - name: '''dst_endpoint.proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_NAT_IP)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    - name: '''src_endpoint.mac'''
      type: '''MAC Address'''
      type_id: 3
      reputation: null::VARIANT
      value: (SOURCE_MAC)::VARCHAR
    - name: '''src_endpoint.proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_NAT_IP)::VARCHAR
    - name: '''url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE (CASE WHEN LOG_LEVEL IS NULL THEN 0 WHEN LOG_LEVEL = 'Info' THEN
      1 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN
      2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN LOG_LEVEL IS NULL THEN 0 WHEN LOG_LEVEL = 'Info' THEN
      1 ELSE 99 END)::NUMBER
    src_endpoint.interface_name: (SOURCE_NETWORK_INTERFACE)::VARCHAR
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.mac: (SOURCE_MAC)::VARCHAR
    src_endpoint.port: (SOURCE_PORT)::NUMBER
    src_endpoint.proxy_endpoint.ip: (SOURCE_NAT_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes: (BYTES_SENT + BYTES_RECEIVED)::NUMBER
    traffic.bytes_in: (BYTES_RECEIVED)::NUMBER
    traffic.bytes_out: (BYTES_SENT)::NUMBER
    traffic.packets: (PACKETS_SENT + PACKETS_RECEIVED)::NUMBER
    traffic.packets_in: (PACKETS_RECEIVED)::NUMBER
    traffic.packets_out: (PACKETS_SENT)::NUMBER
    type_name: '(CASE ((400100 +(CASE WHEN EVENT_TYPE = ''FWD'' THEN 6 WHEN EVENT_TYPE
      = ''LOUT'' THEN 2 ELSE 99 END))::NUMBER) WHEN 400100 THEN ''Network Activity:
      Unknown'' WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network
      Activity: Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN
      ''Network Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN
      400106 THEN ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity:
      Other'' END)::VARCHAR'
    type_uid: (400100 +(CASE WHEN EVENT_TYPE = 'FWD' THEN 6 WHEN EVENT_TYPE = 'LOUT'
      THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url.category_ids: (ARRAY_CONSTRUCT(CASE WHEN URL_CATEGORY IS NULL THEN 0 WHEN
      URL_CATEGORY ILIKE '%Business%' THEN 21 WHEN URL_CATEGORY ILIKE '%Education/Reference%'
      THEN 27 WHEN URL_CATEGORY ILIKE '%Computing/Technology%' THEN 38 WHEN URL_CATEGORY
      ILIKE '%Search Engines/Portals%' THEN 40 WHEN URL_CATEGORY ILIKE '%News%' THEN
      46 WHEN URL_CATEGORY ILIKE '%Web-based Email%' THEN 52 WHEN URL_CATEGORY ILIKE
      '%Forums/Newsgroups%' THEN 53 WHEN URL_CATEGORY ILIKE '%Uncategorized%' THEN
      90 WHEN URL_CATEGORY ILIKE '%Content Server%' THEN 97 ELSE 99 END))::ARRAY
