type: mapping
id: barracuda_box_firewall_logs_4003_dns_activity_1.1.0
version: '1'
name: Barracuda Box Firewall Logs to OCSF class Dns Activity
data-types:
- barracuda-box-firewall-logs
mapping:
  fields:
    action: NULL::VARCHAR
    action_id: NULL::NUMBER
    activity_id: (CASE WHEN EVENT_MESSAGE IS NULL THEN 0 WHEN EVENT_MESSAGE ILIKE
      '%query%dns%' THEN 1 WHEN EVENT_MESSAGE ILIKE '%result%dns%' THEN 2 ELSE 99
      END)::NUMBER
    activity_name: (CASE (CASE WHEN EVENT_MESSAGE IS NULL THEN 0 WHEN EVENT_MESSAGE
      ILIKE '%query%dns%' THEN 1 WHEN EVENT_MESSAGE ILIKE '%result%dns%' THEN 2 ELSE
      99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Query' WHEN 2 THEN 'Response'
      WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    answers: NULL::ARRAY
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('dns_activity')::VARCHAR
    class_uid: ('4003')::NUMBER
    cloud.provider: ('Barracuda')::VARCHAR
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (DESTINATION_IP)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (EVENT_MESSAGE)::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('barracuda-box-firewall-logs')::VARCHAR
    metadata.product.vendor_name: ('barracuda')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP)::VARCHAR
    - name: '''query.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DNS_NAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    query.hostname: (DNS_NAME)::VARCHAR
    query_time: NULL::NUMBER
    query_time_dt: NULL::TIMESTAMP_LTZ
    raw_data: NULL::VARCHAR
    rcode: NULL::VARCHAR
    rcode_id: NULL::NUMBER
    response_time: NULL::NUMBER
    response_time_dt: NULL::TIMESTAMP_LTZ
    severity: (CASE (CASE WHEN LOG_LEVEL IS NULL THEN 0 WHEN LOG_LEVEL ILIKE '%info%'
      THEN 1 WHEN LOG_LEVEL ILIKE '%warning%' THEN 3 WHEN LOG_LEVEL ILIKE '%security%'
      THEN 4 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN LOG_LEVEL IS NULL THEN 0 WHEN LOG_LEVEL ILIKE '%info%'
      THEN 1 WHEN LOG_LEVEL ILIKE '%warning%' THEN 3 WHEN LOG_LEVEL ILIKE '%security%'
      THEN 4 ELSE 99 END)::NUMBER
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE (CASE WHEN EVENT_MESSAGE IS NULL THEN 400300 WHEN EVENT_MESSAGE
      ILIKE ''%query%dns%'' THEN 400301 WHEN EVENT_MESSAGE ILIKE ''%result%dns%''
      THEN 400302 ELSE 400399 END::NUMBER) WHEN 400300 THEN ''DNS Activity: Unknown''
      WHEN 400301 THEN ''DNS Activity: Query'' WHEN 400302 THEN ''DNS Activity: Response''
      WHEN 400306 THEN ''DNS Activity: Traffic'' WHEN 400399 THEN ''DNS Activity:
      Other'' END)::VARCHAR'
    type_uid: (CASE WHEN EVENT_MESSAGE IS NULL THEN 400300 WHEN EVENT_MESSAGE ILIKE
      '%query%dns%' THEN 400301 WHEN EVENT_MESSAGE ILIKE '%result%dns%' THEN 400302
      ELSE 400399 END)::NUMBER
    unmapped: NULL::VARIANT
