type: mapping
id: bitwarden_members_3005_user_access_1.1.0
version: '1'
name: Bitwarden Members to OCSF class User Access
data-types:
- bitwarden-members
mapping:
  fields:
    activity_id: (CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS IN (1, 2) THEN 1 WHEN
      STATUS = -1 THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS IN (1, 2) THEN
      1 WHEN STATUS = -1 THEN 2 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1
      THEN 'Assign Privileges' WHEN 2 THEN 'Revoke Privileges' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE (3::NUMBER) WHEN 3 THEN 'Identity & Access Management' END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('user_access')::VARCHAR
    class_uid: ('3005')::NUMBER
    cloud.provider: ('Bitwarden')::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('bitwarden-members')::VARCHAR
    metadata.product.vendor_name: ('bitwarden')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (EMAIL)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (NAME)::VARCHAR
    privileges: (PERMISSIONS)::ARRAY
    raw_data: NULL::VARCHAR
    resource: NULL::VARIANT
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', METADATA$INSERTION_TIME::TIMESTAMP_LTZ))::NUMBER
    time_dt: (METADATA$INSERTION_TIME)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300500 + (CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS IN (1,
      2) THEN 1 WHEN STATUS = -1 THEN 2 ELSE 99 END))::NUMBER) WHEN 300500 THEN ''User
      Access Management: Unknown'' WHEN 300501 THEN ''User Access Management: Assign
      Privileges'' WHEN 300502 THEN ''User Access Management: Revoke Privileges''
      WHEN 300599 THEN ''User Access Management: Other'' END)::VARCHAR'
    type_uid: (300500 + (CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS IN (1, 2) THEN
      1 WHEN STATUS = -1 THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (EMAIL)::VARCHAR
    user.name: (NAME)::VARCHAR
    user.type: (CASE (CASE WHEN TYPE IS NULL THEN 0 WHEN TYPE = 2 THEN 1 WHEN TYPE
      IN (0,1) THEN 2 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User'
      WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN TYPE IS NULL THEN 0 WHEN TYPE = 2 THEN 1 WHEN TYPE IN
      (0,1) THEN 2 ELSE 99 END)::NUMBER
    user.uid: (ID)::VARCHAR
    user.uid_alt: (USER_ID)::VARCHAR
