type: mapping
id: cato_networks_sockets_management_events_6001_web_resources_activity_1.1.0
version: '1'
name: Cato Networks Sockets Management Events to OCSF class Web Resources Activity
data-types:
- cato-networks-sockets-management-events
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN EVENT_SUB_TYPE IS NULL THEN 0 WHEN EVENT_SUB_TYPE = 'Socket
      WebUI Access' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN EVENT_SUB_TYPE IS NULL THEN 0 WHEN EVENT_SUB_TYPE
      = 'Socket WebUI Access' THEN 2 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Create' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete'
      WHEN 5 THEN 'Search' WHEN 6 THEN 'Import' WHEN 7 THEN 'Export' WHEN 8 THEN 'Share'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.full_name: (USER_PERSON_NAME)::VARCHAR
    actor.user.org.name: (RAW:account_name)::VARCHAR
    actor.user.org.uid: (RAW:account_id)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (6::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('web_resources_activity')::VARCHAR
    class_uid: ('6001')::NUMBER
    cloud: NULL::VARIANT
    count: (EVENT_COUNT)::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    http_request: NULL::VARIANT
    http_response: NULL::VARIANT
    malware: NULL::ARRAY
    message: (EVENT_MESSAGE)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cato-networks-sockets-management-events')::VARCHAR
    metadata.product.vendor_name: ('CatoNetworks')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    src_endpoint.location.region: (SRC_SITE)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%Succe%' THEN
      1 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN
      'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (ACTION)::VARCHAR
    status_id: (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%Succe%' THEN 1
      ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    type_name: '(CASE ((600100 + (CASE WHEN EVENT_SUB_TYPE IS NULL THEN 0 WHEN EVENT_SUB_TYPE
      = ''Socket WebUI Access'' THEN 2 ELSE 99 END))::NUMBER) WHEN 600100 THEN ''Web
      Resources Activity: Unknown'' WHEN 600101 THEN ''Web Resources Activity: Create''
      WHEN 600102 THEN ''Web Resources Activity: Read'' WHEN 600103 THEN ''Web Resources
      Activity: Update'' WHEN 600104 THEN ''Web Resources Activity: Delete'' WHEN
      600105 THEN ''Web Resources Activity: Search'' WHEN 600106 THEN ''Web Resources
      Activity: Import'' WHEN 600107 THEN ''Web Resources Activity: Export'' WHEN
      600108 THEN ''Web Resources Activity: Share'' WHEN 600199 THEN ''Web Resources
      Activity: Other'' END)::VARCHAR'
    type_uid: (600100 + (CASE WHEN EVENT_SUB_TYPE IS NULL THEN 0 WHEN EVENT_SUB_TYPE
      = 'Socket WebUI Access' THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    web_resources: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('uid', INTERNAL_ID, 'name', EVENT_SUB_TYPE)))::ARRAY
    web_resources_result: NULL::ARRAY
  predicate: EVENT_SUB_TYPE = 'Socket WebUI Access'
