type: mapping
id: cato_networks_connectivity_events_4001_network_activity_1.1.0
version: '1'
name: Cato Networks Connectivity Events to OCSF class Network Activity
data-types:
- cato-networks-connectivity-events
mapping:
  fields:
    action: (CASE ((CASE WHEN RAW:action IS NULL THEN 0 WHEN RAW:action IN ('Allow',
      'Succeeded') THEN 1 WHEN RAW:action IN ('Stopped', 'Failed') THEN 2 ELSE 99
      END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied'
      WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN RAW:action IS NULL THEN 0 WHEN RAW:action IN ('Allow', 'Succeeded')
      THEN 1 WHEN RAW:action IN ('Stopped', 'Failed') THEN 2 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN EVENT_SUB_TYPE In ('Connected','Reconnected') THEN 1 WHEN
      EVENT_SUB_TYPE = 'Disconnected' THEN 2 WHEN EVENT_SUB_TYPE IN ('Changed Pop',
      'Off-Cloud Recovery') THEN 3 WHEN EVENT_SUB_TYPE = 'Last-Mile Quality' THEN
      6 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_SUB_TYPE In ('Connected','Reconnected')
      THEN 1 WHEN EVENT_SUB_TYPE = 'Disconnected' THEN 2 WHEN EVENT_SUB_TYPE IN ('Changed
      Pop', 'Off-Cloud Recovery') THEN 3 WHEN EVENT_SUB_TYPE = 'Last-Mile Quality'
      THEN 6 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2
      THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.account.uid: (RAW:account_id)::VARCHAR
    actor.user.email_addr: (RAW:vpn_user_email)::VARCHAR
    actor.user.full_name: (RAW:user_name)::VARCHAR
    actor.user.uid: (RAW:user_id)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.provider: ('Cato Networks')::VARCHAR
    connection_info.protocol_name: (LOWER(COALESCE(TUNNEL_PROTOCOL, RAW:tunnel_ip_protocol)))::VARCHAR
    connection_info.protocol_num: (CASE WHEN RAW:tunnel_ip_protocol IS NULL THEN 0
      WHEN RAW:tunnel_ip_protocol = 'TCP' THEN 6 WHEN RAW:tunnel_ip_protocol = 'UDP'
      THEN 17 ELSE -1 END)::NUMBER
    count: (EVENT_COUNT)::NUMBER
    device.interface_name: (SOCKET_INTERFACE)::VARCHAR
    device.ip: (RAW:host_ip)::VARCHAR
    device.location.isp: (ISP_NAME)::VARCHAR
    device.name: (RAW:device_name)::VARCHAR
    device.os.type: (CASE ((CASE WHEN RAW:os_type IS NULL THEN 0 WHEN RAW:os_type
      ILIKE '%WINDOWS%' THEN 100 WHEN RAW:os_type ILIKE '%MAC%' THEN 300 WHEN RAW:os_type
      ILIKE '%IOS%' THEN 301  ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100
      THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201
      THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS'
      WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN
      'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN RAW:os_type IS NULL THEN 0 WHEN RAW:os_type ILIKE
      '%WINDOWS%' THEN 100 WHEN RAW:os_type ILIKE '%MAC%' THEN 300 WHEN RAW:os_type
      ILIKE '%IOS%' THEN 301  ELSE 99 END)::NUMBER
    device.os.version: (RAW:os_version)::VARCHAR
    device.uid: (RAW:visible_device_id)::VARCHAR
    device.zone: (POINT_OF_PRESENCE_NAME)::VARCHAR
    disposition: (CASE ((CASE WHEN RAW:action IS NULL THEN 0 WHEN RAW:action IN ('Allow',
      'Succeeded') THEN 1 WHEN RAW:action = 'Stopped' THEN 2 WHEN RAW:action = 'Failed'
      THEN 2 WHEN RAW:action = 'Clear Alert' THEN 16 WHEN RAW:action = 'Alert' THEN
      19 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 10
      THEN 'Exonerated' WHEN 11 THEN 'Corrected' WHEN 12 THEN 'Partially Corrected'
      WHEN 13 THEN 'Uncorrected' WHEN 14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN
      16 THEN 'No Action' WHEN 17 THEN 'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN
      'Alert' WHEN 2 THEN 'Blocked' WHEN 20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN
      22 THEN 'Captcha' WHEN 23 THEN 'Challenge' WHEN 24 THEN 'Access Revoked' WHEN
      25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized' WHEN 27 THEN 'Error' WHEN 3 THEN
      'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5 THEN 'Deleted' WHEN 6 THEN 'Dropped'
      WHEN 7 THEN 'Custom Action' WHEN 8 THEN 'Approved' WHEN 9 THEN 'Restored' WHEN
      99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN RAW:action IS NULL THEN 0 WHEN RAW:action IN ('Allow',
      'Succeeded') THEN 1 WHEN RAW:action = 'Stopped' THEN 2 WHEN RAW:action = 'Failed'
      THEN 2 WHEN RAW:action = 'Clear Alert' THEN 16 WHEN RAW:action = 'Alert' THEN
      19 ELSE 99 END)::NUMBER
    dst_endpoint.ip: (RAW:dest_ip)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.name: (RAW:rule_name)::VARCHAR
    firewall_rule.uid: (RAW:rule_id)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (EVENT_MESSAGE)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cato-networks-connectivity-events')::VARCHAR
    metadata.product.vendor_name: ('CatoNetworks')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (RAW:vpn_user_email)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RAW:host_ip)::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RAW:dest_ip)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(RAW:src_ip,SRC_ISP_IP))::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (COALESCE(RAW:src_ip,SRC_ISP_IP))::VARCHAR
    src_endpoint.location.country: (RAW:src_country_code)::VARCHAR
    src_endpoint.location.region: (SRC_SITE)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400100 + (CASE WHEN EVENT_SUB_TYPE In (''Connected'',''Reconnected'')
      THEN 1 WHEN EVENT_SUB_TYPE = ''Disconnected'' THEN 2 WHEN EVENT_SUB_TYPE IN
      (''Changed Pop'', ''Off-Cloud Recovery'') THEN 3 WHEN EVENT_SUB_TYPE = ''Last-Mile
      Quality'' THEN 6 ELSE 99 END))::NUMBER) WHEN 400100 THEN ''Network Activity:
      Unknown'' WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network
      Activity: Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN
      ''Network Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN
      400106 THEN ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity:
      Other'' END)::VARCHAR'
    type_uid: (400100 + (CASE WHEN EVENT_SUB_TYPE In ('Connected','Reconnected') THEN
      1 WHEN EVENT_SUB_TYPE = 'Disconnected' THEN 2 WHEN EVENT_SUB_TYPE IN ('Changed
      Pop', 'Off-Cloud Recovery') THEN 3 WHEN EVENT_SUB_TYPE = 'Last-Mile Quality'
      THEN 6 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
