type: mapping
id: cato_networks_security_events_4002_http_activity_1.1.0
version: '1'
name: Cato Networks Security Events to OCSF class Http Activity
data-types:
- cato-networks-security-events
mapping:
  fields:
    action: (CASE ((CASE ACTION WHEN NULL THEN 0 WHEN 'Allow' THEN 1 WHEN 'Block'
      THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN
      2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE ACTION WHEN NULL THEN 0 WHEN 'Allow' THEN 1 WHEN 'Block' THEN
      2 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN RAW:http_request_method IS NULL THEN 0 WHEN RAW:http_request_method
      ILIKE 'GET' THEN 3 WHEN RAW:http_request_method ILIKE 'OPTIONS' THEN 5 WHEN
      RAW:http_request_method ILIKE 'POST' THEN 6 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN RAW:http_request_method IS NULL THEN 0 WHEN RAW:http_request_method
      ILIKE 'GET' THEN 3 WHEN RAW:http_request_method ILIKE 'OPTIONS' THEN 5 WHEN
      RAW:http_request_method ILIKE 'POST' THEN 6 ELSE 99 END::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Connect' WHEN 2 THEN 'Delete' WHEN 3 THEN 'Get' WHEN
      4 THEN 'Head' WHEN 5 THEN 'Options' WHEN 6 THEN 'Post' WHEN 7 THEN 'Put' WHEN
      8 THEN 'Trace' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.file.name: (RAW:file_name)::VARCHAR
    actor.process.file.size: (RAW:file_size)::NUMBER
    actor.user.account.name: (RAW:account_name)::VARCHAR
    actor.user.account.uid: (RAW:account_id)::VARCHAR
    actor.user.uid: (RAW:user_reference_id)::VARCHAR
    api: NULL::VARIANT
    app_name: (APPLICATION)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('http_activity')::VARCHAR
    class_uid: ('4002')::NUMBER
    cloud.provider: ('Cato Networks')::VARCHAR
    connection_info.protocol_name: (IP_PROTOCOL)::VARCHAR
    connection_info.protocol_num: (CASE IP_PROTOCOL WHEN NULL THEN 0 WHEN 'TCP' THEN
      6 ELSE -1 END)::NUMBER
    count: (EVENT_COUNT)::NUMBER
    device.ip: (RAW:host_ip)::VARCHAR
    device.location.isp: (ISP_NAME)::VARCHAR
    device.name: (RAW:device_name)::VARCHAR
    device.os.type: (CASE ((CASE WHEN OS_TYPE ILIKE 'OS_UNKNOWN' OR OS_TYPE IS NULL
      THEN 0 WHEN OS_TYPE ILIKE 'OS_WINDOWS' THEN 100 WHEN OS_TYPE ILIKE 'OS_LINUX'
      THEN 200 WHEN OS_TYPE ILIKE 'OS_ANDROID' THEN 201 WHEN OS_TYPE ILIKE 'OS_MAC'
      THEN 300 WHEN OS_TYPE ILIKE 'OS_IOS' THEN 302 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN
      'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN
      302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN
      'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN OS_TYPE ILIKE 'OS_UNKNOWN' OR OS_TYPE IS NULL THEN
      0 WHEN OS_TYPE ILIKE 'OS_WINDOWS' THEN 100 WHEN OS_TYPE ILIKE 'OS_LINUX' THEN
      200 WHEN OS_TYPE ILIKE 'OS_ANDROID' THEN 201 WHEN OS_TYPE ILIKE 'OS_MAC' THEN
      300 WHEN OS_TYPE ILIKE 'OS_IOS' THEN 302 ELSE 99 END)::NUMBER
    device.subnet: (SUBNET_NAME)::VARCHAR
    device.zone: (POINT_OF_PRESENCE_NAME)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.domain: (DOMAIN_NAME)::VARCHAR
    dst_endpoint.hostname: (RAW:dest_site_name)::VARCHAR
    dst_endpoint.ip: (DEST_IP)::VARCHAR
    dst_endpoint.location.country: (DEST_COUNTRY)::VARCHAR
    dst_endpoint.location.region: (DEST_SITE)::VARCHAR
    dst_endpoint.port: (DEST_PORT)::NUMBER
    dst_endpoint.uid: (RAW:dest_site_id)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.category: (EVENT_SUB_TYPE)::VARCHAR
    firewall_rule.desc: (RULE)::VARCHAR
    firewall_rule.name: (RULE_NAME)::VARCHAR
    firewall_rule.uid: (RULE_ID)::VARCHAR
    http_cookies: NULL::ARRAY
    http_request.http_method: (CASE WHEN RAW:http_request_method = 'GET' THEN 'GET'
      WHEN RAW:http_request_method = 'OPTIONS' THEN 'OPTIONS' WHEN RAW:http_request_method
      = 'POST' THEN 'POST' ELSE NULL END)::VARCHAR
    http_request.url.hostname: (PARSE_URL(RAW:url,1):host)::VARCHAR
    http_request.url.path: (PARSE_URL(RAW:url,1):path)::VARCHAR
    http_request.url.port: (PARSE_URL(RAW:url,1):port)::NUMBER
    http_request.url.query_string: (PARSE_URL(RAW:url,1):query)::VARCHAR
    http_request.url.scheme: (PARSE_URL(RAW:url,1):scheme)::VARCHAR
    http_request.url.url_string: (RAW:url)::VARCHAR
    http_response: NULL::VARIANT
    http_status: NULL::NUMBER
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_sub_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cato-networks-security-events')::VARCHAR
    metadata.product.vendor_name: ('CatoNetworks')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (RAW:file_name)::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RAW:host_ip)::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (RAW:dest_site_name)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DEST_IP)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (PARSE_URL(RAW:url,1):host)::VARCHAR
    - name: '''http_request.url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (RAW:url)::VARCHAR
    - name: '''src_endpoint.intermediate_ips'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IFF(SRC_ISP_IP IS NULL , ARRAY_CONSTRUCT(), ARRAY_CONSTRUCT(SRC_ISP_IP)))::ARRAY
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SRC_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.intermediate_ips: (IFF(SRC_ISP_IP IS NULL , ARRAY_CONSTRUCT(), ARRAY_CONSTRUCT(SRC_ISP_IP)))::ARRAY
    src_endpoint.ip: (SRC_IP)::VARCHAR
    src_endpoint.location.country: (SRC_COUNTRY)::VARCHAR
    src_endpoint.location.region: (SRC_SITE)::VARCHAR
    src_endpoint.port: (SRC_PORT)::NUMBER
    start_time: (date_part('epoch_milliseconds', (EVENT_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (EVENT_TIME)::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400200 + (CASE WHEN RAW:http_request_method IS NULL THEN 0
      WHEN RAW:http_request_method ILIKE ''GET'' THEN 3 WHEN RAW:http_request_method
      ILIKE ''OPTIONS'' THEN 5 WHEN RAW:http_request_method ILIKE ''POST'' THEN 6
      ELSE 99 END::NUMBER))) WHEN 400200 THEN ''HTTP Activity: Unknown'' WHEN 400201
      THEN ''HTTP Activity: Connect'' WHEN 400202 THEN ''HTTP Activity: Delete'' WHEN
      400203 THEN ''HTTP Activity: Get'' WHEN 400204 THEN ''HTTP Activity: Head''
      WHEN 400205 THEN ''HTTP Activity: Options'' WHEN 400206 THEN ''HTTP Activity:
      Post'' WHEN 400207 THEN ''HTTP Activity: Put'' WHEN 400208 THEN ''HTTP Activity:
      Trace'' WHEN 400299 THEN ''HTTP Activity: Other'' END)::VARCHAR'
    type_uid: ((400200 + (CASE WHEN RAW:http_request_method IS NULL THEN 0 WHEN RAW:http_request_method
      ILIKE 'GET' THEN 3 WHEN RAW:http_request_method ILIKE 'OPTIONS' THEN 5 WHEN
      RAW:http_request_method ILIKE 'POST' THEN 6 ELSE 99 END::NUMBER)))::NUMBER
    unmapped: NULL::VARIANT
  predicate: APPLICATION ilike'HTTP%'
