type: mapping
id: cato_networks_routing_events_4001_network_activity_1.1.0
version: '1'
name: Cato Networks Routing Events to OCSF class Network Activity
data-types:
- cato-networks-routing-events
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN ACTION='Added' THEN 1 WHEN ACTION='Deleted' THEN 2 WHEN
      ACTION='Disconnected' THEN 4 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION='Added' THEN 1 WHEN ACTION='Deleted' THEN
      2 WHEN ACTION='Disconnected' THEN 4 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2 THEN 'Close' WHEN 3 THEN 'Reset'
      WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.user.org.name: (RAW:account_name)::VARCHAR
    actor.user.org.uid: (RAW:account_id)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.provider: ('Cato Networks')::VARCHAR
    connection_info: NULL::VARIANT
    count: (EVENT_COUNT)::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.intermediate_ips: (ARRAY_CONSTRUCT(BGP_ROUTE_CIDR))::ARRAY
    dst_endpoint.ip: (BGP_CATO_IP)::VARCHAR
    dst_endpoint.location.city: (POINT_OF_PRESENCE_NAME)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (EVENT_MESSAGE)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cato-networks-routing-events')::VARCHAR
    metadata.product.vendor_name: ('CatoNetworks')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.intermediate_ips'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (ARRAY_CONSTRUCT(BGP_ROUTE_CIDR))::ARRAY
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (BGP_CATO_IP)::VARCHAR
    - name: '''src_endpoint.intermediate_ips'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (ARRAY_CONSTRUCT(RAW:src_isp_ip))::ARRAY
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (BGP_PEER_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.intermediate_ips: (ARRAY_CONSTRUCT(RAW:src_isp_ip))::ARRAY
    src_endpoint.ip: (BGP_PEER_IP)::VARCHAR
    src_endpoint.location.country: (RAW:src_country_code)::VARCHAR
    src_endpoint.location.desc: (SRC_SITE)::VARCHAR
    src_endpoint.location.isp: (RAW:ISP_name)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (RAW:bgp_suberror_code)::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400100 + (CASE WHEN ACTION=''Added'' THEN 1 WHEN ACTION=''Deleted''
      THEN 2 WHEN ACTION=''Disconnected'' THEN 4 WHEN ACTION IS NULL THEN 0 ELSE 99
      END))::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown'' WHEN 400101 THEN
      ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity: Close'' WHEN
      400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network Activity:
      Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN ''Network
      Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400100 + (CASE WHEN ACTION='Added' THEN 1 WHEN ACTION='Deleted' THEN
      2 WHEN ACTION='Disconnected' THEN 4 WHEN ACTION IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
