type: mapping
id: cato_networks_security_events_4003_dns_activity_1.1.0
version: '1'
name: Cato Networks Security Events to OCSF class Dns Activity
data-types:
- cato-networks-security-events
mapping:
  fields:
    action: (CASE ((CASE ACTION WHEN NULL THEN 0 WHEN 'Allow' THEN 1 WHEN 'Block'
      THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN
      2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE ACTION WHEN NULL THEN 0 WHEN 'Allow' THEN 1 WHEN 'Block' THEN
      2 ELSE 99 END)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Query' WHEN
      2 THEN 'Response' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    answers: NULL::ARRAY
    api: NULL::VARIANT
    app_name: (APPLICATION)::VARCHAR
    attacks: (ARRAY_CONSTRUCT_COMPACT(RAW:mitre_attack_tactics))::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('dns_activity')::VARCHAR
    class_uid: ('4003')::NUMBER
    cloud.provider: ('Cato Networks')::VARCHAR
    connection_info.protocol_name: (IP_PROTOCOL)::VARCHAR
    connection_info.protocol_num: (CASE IP_PROTOCOL WHEN NULL THEN 0 WHEN 'TCP' THEN
      6 WHEN 'UDP' THEN 17 ELSE -1 END)::NUMBER
    count: (EVENT_COUNT)::NUMBER
    device.location.isp: (ISP_NAME)::VARCHAR
    device.name: (RAW:device_name)::VARCHAR
    device.os.type: (CASE ((CASE WHEN OS_TYPE ILIKE 'OS_UNKNOWN' OR OS_TYPE IS NULL
      THEN 0 WHEN OS_TYPE ILIKE 'OS_WINDOWS' THEN 100 WHEN OS_TYPE ILIKE 'OS_LINUX'
      THEN 200 WHEN OS_TYPE ILIKE 'OS_ANDROID' THEN 201 WHEN OS_TYPE ILIKE 'OS_MAC'
      THEN 300 WHEN OS_TYPE ILIKE 'OS_IOS' THEN 302 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN
      'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN
      302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN
      'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN OS_TYPE ILIKE 'OS_UNKNOWN' OR OS_TYPE IS NULL THEN
      0 WHEN OS_TYPE ILIKE 'OS_WINDOWS' THEN 100 WHEN OS_TYPE ILIKE 'OS_LINUX' THEN
      200 WHEN OS_TYPE ILIKE 'OS_ANDROID' THEN 201 WHEN OS_TYPE ILIKE 'OS_MAC' THEN
      300 WHEN OS_TYPE ILIKE 'OS_IOS' THEN 302 ELSE 99 END)::NUMBER
    device.subnet: (SUBNET_NAME)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.domain: (DOMAIN_NAME)::VARCHAR
    dst_endpoint.ip: (DEST_IP)::VARCHAR
    dst_endpoint.location.country: (DEST_COUNTRY)::VARCHAR
    dst_endpoint.port: (DEST_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.category: (EVENT_SUB_TYPE)::VARCHAR
    firewall_rule.desc: (RULE)::VARCHAR
    firewall_rule.name: (RULE_NAME)::VARCHAR
    firewall_rule.uid: (RULE_ID)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_sub_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cato-networks-security-events')::VARCHAR
    metadata.product.vendor_name: ('CatoNetworks')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DEST_IP)::VARCHAR
    - name: '''query.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (RAW:dns_query)::VARCHAR
    - name: '''src_endpoint.intermediate_ips'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IFF(SRC_ISP_IP IS NULL, ARRAY_CONSTRUCT(), ARRAY_CONSTRUCT(SRC_ISP_IP)))::ARRAY
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SRC_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    query.hostname: (RAW:dns_query)::VARCHAR
    query_time: NULL::NUMBER
    query_time_dt: NULL::TIMESTAMP_LTZ
    raw_data: NULL::VARCHAR
    rcode: NULL::VARCHAR
    rcode_id: NULL::NUMBER
    response_time: NULL::NUMBER
    response_time_dt: NULL::TIMESTAMP_LTZ
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    src_endpoint.intermediate_ips: (IFF(SRC_ISP_IP IS NULL, ARRAY_CONSTRUCT(), ARRAY_CONSTRUCT(SRC_ISP_IP)))::ARRAY
    src_endpoint.ip: (SRC_IP)::VARCHAR
    src_endpoint.location.country: (SRC_COUNTRY)::VARCHAR
    src_endpoint.port: (SRC_PORT)::NUMBER
    start_time: (date_part('epoch_milliseconds', (EVENT_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (EVENT_TIME)::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400300)::NUMBER) WHEN 400300 THEN ''DNS Activity: Unknown''
      WHEN 400301 THEN ''DNS Activity: Query'' WHEN 400302 THEN ''DNS Activity: Response''
      WHEN 400306 THEN ''DNS Activity: Traffic'' WHEN 400399 THEN ''DNS Activity:
      Other'' END)::VARCHAR'
    type_uid: (400300)::NUMBER
    unmapped: NULL::VARIANT
  predicate: APPLICATION in ('DNS over TCP', 'DNS', 'DNS over HTTPS - DoH', 'DNS over
    TLS')
