type: mapping
id: cb_platform_events_201003_win_resource_activity_1.1.0
version: '1'
name: Cb Platform Events to OCSF class Win/resource Activity
data-types:
- cb-platform-events
mapping:
  fields:
    action: (CASE (CASE WHEN SENSOR_ACTION IS NULL THEN 0 WHEN SENSOR_ACTION ILIKE
      '%allow%' THEN 1 WHEN SENSOR_ACTION ILIKE '%block%' THEN 2 ELSE 99 END::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN
      'Other' END)::VARCHAR
    action_id: (CASE WHEN SENSOR_ACTION IS NULL THEN 0 WHEN SENSOR_ACTION ILIKE '%allow%'
      THEN 1 WHEN SENSOR_ACTION ILIKE '%block%' THEN 2 ELSE 99 END)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Access' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (PROCESS_CMDLINE)::VARCHAR
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'MD5', 'algorithm_id', 1, 'value', PROCESS_HASH_MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'SHA-256', 'algorithm_id', 3, 'value', PROCESS_HASH_SHA256)))::ARRAY
    actor.process.file.name: (FILEMOD_NAME)::VARCHAR
    actor.process.file.path: (PROCESS_PATH)::VARCHAR
    actor.process.parent_process.cmd_line: (PARENT_CMDLINE)::VARCHAR
    actor.process.parent_process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'MD5', 'algorithm_id', 1, 'value', PARENT_HASH_MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'SHA-256', 'algorithm_id', 3, 'value', PARENT_HASH_SHA256)))::ARRAY
    actor.process.parent_process.file.path: (PARENT_PATH)::VARCHAR
    actor.process.parent_process.pid: (PARENT_PID)::NUMBER
    actor.process.parent_process.uid: (PARENT_GUID)::VARCHAR
    actor.process.pid: (PROCESS_PID)::NUMBER
    actor.process.uid: (PROCESS_GUID)::VARCHAR
    actor.process.user.name: (PROCESS_USERNAME)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (1::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('win/resource_activity')::VARCHAR
    class_uid: ('201003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.first_seen_time: (date_part('epoch_milliseconds', DEVICE_TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    device.first_seen_time_dt: (DEVICE_TIMESTAMP)::TIMESTAMP_LTZ
    device.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', DEVICE_GROUP)))::ARRAY
    device.ip: (DEVICE_EXTERNAL_IP)::VARCHAR
    device.name: (DEVICE_NAME)::VARCHAR
    device.org.uid: (ORG_KEY)::VARCHAR
    device.os.name: (DEVICE_OS)::VARCHAR
    device.os.type: (CASE (100::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows'
      WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android'
      WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN
      'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (100)::NUMBER
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (EVENT_DESCRIPTION)::VARCHAR
    metadata.event_code: (type)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cb-platform-events')::VARCHAR
    metadata.product.vendor_name: ('cb-defense')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (FILEMOD_NAME)::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PROCESS_USERNAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DEVICE_EXTERNAL_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', backend_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (backend_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (20100300::NUMBER) WHEN 20100300 THEN ''Windows Resource Activity:
      Unknown'' WHEN 20100301 THEN ''Windows Resource Activity: Access'' WHEN 20100399
      THEN ''Windows Resource Activity: Other'' END)::VARCHAR'
    type_uid: (20100300)::NUMBER
    unmapped: NULL::VARIANT
    win_resource.type: (CASE (CASE WHEN TYPE IS NULL THEN 0 WHEN TYPE ILIKE '%file%'
      THEN 7 WHEN TYPE ILIKE '%proc%' THEN 20 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Directory' WHEN 10 THEN 'Section' WHEN 11 THEN 'WindowStation'
      WHEN 12 THEN 'DebugObject' WHEN 13 THEN 'FilterCommunicationPort' WHEN 14 THEN
      'EventPair' WHEN 15 THEN 'Driver' WHEN 16 THEN 'IoCompletion' WHEN 17 THEN 'Controller'
      WHEN 18 THEN 'SymbolicLink' WHEN 19 THEN 'WmiGuid' WHEN 2 THEN 'Event' WHEN
      20 THEN 'Process' WHEN 21 THEN 'Profile' WHEN 22 THEN 'Desktop' WHEN 23 THEN
      'KeyedEvent' WHEN 24 THEN 'Adapter' WHEN 25 THEN 'Key' WHEN 26 THEN 'WaitablePort'
      WHEN 27 THEN 'Callback' WHEN 28 THEN 'Semaphore' WHEN 29 THEN 'Job' WHEN 3 THEN
      'Timer' WHEN 30 THEN 'Port' WHEN 31 THEN 'FilterConnectionPort' WHEN 32 THEN
      'ALPC Port' WHEN 33 THEN 'SAM_ALIAS' WHEN 34 THEN 'SAM_GROUP' WHEN 35 THEN 'SAM_USER'
      WHEN 36 THEN 'SAM_DOMAIN' WHEN 37 THEN 'SAM_SERVER' WHEN 4 THEN 'Device' WHEN
      5 THEN 'Mutant' WHEN 6 THEN 'Type' WHEN 7 THEN 'File' WHEN 8 THEN 'Token' WHEN
      9 THEN 'Thread' WHEN 99 THEN 'Other' END)::VARCHAR
    win_resource.type_id: (CASE WHEN TYPE IS NULL THEN 0 WHEN TYPE ILIKE '%file%'
      THEN 7 WHEN TYPE ILIKE '%proc%' THEN 20 ELSE 99 END)::NUMBER
  predicate: DEVICE_OS = 'WINDOWS' AND TYPE ILIKE ANY ('%filemod%', '%proc%')
