type: mapping
id: cb_platform_events_1005_module_activity_1.1.0
version: '2'
name: Cb Platform Events to OCSF class Module Activity
data-types:
- cb-platform-events
mapping:
  fields:
    action: (CASE ((CASE WHEN SENSOR_ACTION IS NULL THEN 0 WHEN SENSOR_ACTION ILIKE
      '%allow%' THEN 1 WHEN SENSOR_ACTION ILIKE '%block%' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN
      'Other' END)::VARCHAR
    action_id: (CASE WHEN SENSOR_ACTION IS NULL THEN 0 WHEN SENSOR_ACTION ILIKE '%allow%'
      THEN 1 WHEN SENSOR_ACTION ILIKE '%block%' THEN 2 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%load%module%'
      THEN 1 WHEN ACTION ILIKE '%unload%module%' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%load%module%'
      THEN 1 WHEN ACTION ILIKE '%unload%module%' THEN 2 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Load' WHEN 2 THEN 'Unload' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.process.cmd_line: (PROCESS_CMDLINE)::VARCHAR
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'MD5', 'algorithm_id', 1, 'value', PROCESS_HASH_MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'SHA-256', 'algorithm_id', 3, 'value', PROCESS_HASH_SHA256)))::ARRAY
    actor.process.file.path: (PROCESS_PATH)::VARCHAR
    actor.process.parent_process.cmd_line: (PARENT_CMDLINE)::VARCHAR
    actor.process.parent_process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'MD5', 'algorithm_id', 1, 'value', PARENT_HASH_MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'SHA-256', 'algorithm_id', 3, 'value', PARENT_HASH_SHA256)))::ARRAY
    actor.process.parent_process.file.path: (PARENT_PATH)::VARCHAR
    actor.process.parent_process.pid: (PARENT_PID)::NUMBER
    actor.process.parent_process.uid: (PARENT_GUID)::VARCHAR
    actor.process.pid: (PROCESS_PID)::NUMBER
    actor.process.uid: (PROCESS_GUID)::VARCHAR
    actor.process.user.name: (PROCESS_USERNAME)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('module_activity')::VARCHAR
    class_uid: ('1005')::NUMBER
    cloud.provider: ('Carbon Black')::VARCHAR
    count: NULL::NUMBER
    device.first_seen_time: (date_part('epoch_milliseconds', (DEVICE_TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    device.first_seen_time_dt: (DEVICE_TIMESTAMP)::TIMESTAMP_LTZ
    device.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', DEVICE_GROUP)))::ARRAY
    device.ip: (DEVICE_EXTERNAL_IP)::VARCHAR
    device.name: (DEVICE_NAME)::VARCHAR
    device.org.uid: (ORG_KEY)::VARCHAR
    device.os.name: (DEVICE_OS)::VARCHAR
    device.os.type: (CASE ((CASE WHEN DEVICE_OS ='WINDOWS' THEN 100 WHEN DEVICE_OS
      = 'LINUX' THEN 200 WHEN DEVICE_OS = 'MAC' THEN 300 WHEN DEVICE_OS is NULL THEN
      0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101
      THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300
      THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris'
      WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN DEVICE_OS ='WINDOWS' THEN 100 WHEN DEVICE_OS = 'LINUX'
      THEN 200 WHEN DEVICE_OS = 'MAC' THEN 300 WHEN DEVICE_OS is NULL THEN 0 ELSE
      99 END)::NUMBER
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (EVENT_DESCRIPTION)::VARCHAR
    metadata.event_code: (type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cb-platform-events')::VARCHAR
    metadata.product.vendor_name: ('cb-defense')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    module.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm', 'MD5',
      'algorithm_id', 1, 'value', FILEMOD_HASH_MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'SHA-256', 'algorithm_id', 3, 'value', FILEMOD_HASH_SHA256)))::ARRAY
    module.file.name: (COALESCE(FILEMOD_NAME, MODLOAD_NAME))::VARCHAR
    module.load_type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Standard'
      WHEN 2 THEN 'Non Standard' WHEN 3 THEN 'ShellCode' WHEN 4 THEN 'Mapped' WHEN
      5 THEN 'NonStandard Backed' WHEN 99 THEN 'Other' END)::VARCHAR
    module.load_type_id: (0)::NUMBER
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PROCESS_USERNAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DEVICE_EXTERNAL_IP)::VARCHAR
    - name: '''module.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''module.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (COALESCE(FILEMOD_NAME, MODLOAD_NAME))::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', backend_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (backend_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN ACTION IS NULL THEN 100500 WHEN ACTION ILIKE ''%load%module%''
      THEN 100501 WHEN ACTION ILIKE ''%unload%module%'' THEN 100502 ELSE 100599 END)::NUMBER)
      WHEN 100500 THEN ''Module Activity: Unknown'' WHEN 100501 THEN ''Module Activity:
      Load'' WHEN 100502 THEN ''Module Activity: Unload'' WHEN 100599 THEN ''Module
      Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN ACTION IS NULL THEN 100500 WHEN ACTION ILIKE '%load%module%'
      THEN 100501 WHEN ACTION ILIKE '%unload%module%' THEN 100502 ELSE 100599 END)::NUMBER
    unmapped: NULL::VARIANT
  predicate: TYPE ILIKE '%module%'
