type: mapping
id: checkpoint_traffic_4001_network_activity_1.1.0
version: '17'
name: Checkpoint Traffic to OCSF class Network Activity
data-types:
- checkpoint-traffic
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION='Allow' THEN 1 WHEN ACTION='Accept' THEN 1 WHEN
      ACTION='Block' THEN 2 WHEN ACTION='Reject' THEN 2 WHEN ACTION IS NULL THEN 0
      ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN
      'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION='Allow' THEN 1 WHEN ACTION='Accept' THEN 1 WHEN ACTION='Block'
      THEN 2 WHEN ACTION='Reject' THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (2)::NUMBER
    activity_name: (CASE ((2)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN
      2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.uid: (RAW:loguid)::VARCHAR
    actor.session.created_time: (date_part('epoch_milliseconds', (BROWSE_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.session.created_time_dt: (BROWSE_TIME)::TIMESTAMP_LTZ
    actor.session.uid: (RAW:session_uid)::VARCHAR
    actor.user.domain: (RAW:Domain)::VARCHAR
    actor.user.name: (COALESCE(USER, RAW:src_user_name))::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: NULL::VARCHAR
    category_uid: NULL::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((CASE WHEN RAW:ifdir='inbound' THEN 1 WHEN RAW:ifdir='outbound'
      THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Inbound' WHEN
      2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other' END)::VARCHAR
    connection_info.direction_id: (CASE WHEN RAW:ifdir='inbound' THEN 1 WHEN RAW:ifdir='outbound'
      THEN 2 ELSE 99 END)::NUMBER
    connection_info.protocol_num: (PROTO)::NUMBER
    connection_info.session.expiration_time: (date_part('epoch_milliseconds', (RAW:expire_time)::TIMESTAMP_LTZ))::NUMBER
    connection_info.session.expiration_time_dt: (RAW:expire_time)::TIMESTAMP_LTZ
    count: NULL::NUMBER
    device.interface_name: (RAW:ifname)::VARCHAR
    device.ip: (ORIGIN)::VARCHAR
    device.name: (ORIGIN_SIC_NAME)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.domain: (CASE WHEN PARSE_URL(RESOURCE,1):host::VARCHAR REGEXP '^[a-zA-Z0-9-]+(\\\
      .[a-zA-Z0-9-]+){1,}$' THEN PARSE_URL(RESOURCE,1):host::VARCHAR ELSE NULL END)::VARCHAR
    dst_endpoint.hostname: (DST_MACHINE_NAME)::VARCHAR
    dst_endpoint.ip: (DST)::VARCHAR
    dst_endpoint.port: (SERVICE)::NUMBER
    dst_endpoint.zone: (RAW:outzone)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    firewall_rule.category: (RAW:rule_action)::VARCHAR
    firewall_rule.name: (RULE_NAME)::VARCHAR
    firewall_rule.uid: (RAW:rule_uid)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (COALESCE(RAW:message_info, RAW:decision))::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('checkpoint-traffic')::VARCHAR
    metadata.product.vendor_name: ('checkpoint')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(USER, RAW:src_user_name))::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (ORIGIN)::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DST_MACHINE_NAME)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DST)::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SRC_MACHINE_NAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SRC)::VARCHAR
    - name: '''url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((CASE WHEN SEVERITY = 0 THEN 1 WHEN SEVERITY = 1 THEN 2  WHEN
      SEVERITY = 2 THEN 3 WHEN SEVERITY = 3 THEN 4 WHEN SEVERITY = 4 THEN 5 WHEN SEVERITY  =
      'Critical'    THEN 5 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN
      5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY = 0 THEN 1 WHEN SEVERITY = 1 THEN 2  WHEN SEVERITY
      = 2 THEN 3 WHEN SEVERITY = 3 THEN 4 WHEN SEVERITY = 4 THEN 5 WHEN SEVERITY  =
      'Critical'    THEN 5 ELSE 99 END)::NUMBER
    src_endpoint.hostname: (SRC_MACHINE_NAME)::VARCHAR
    src_endpoint.ip: (SRC)::VARCHAR
    src_endpoint.port: (S_PORT)::NUMBER
    src_endpoint.zone: (RAW:inzone)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes: (BYTES)::NUMBER
    traffic.packets: (PACKETS)::NUMBER
    type_name: '(CASE ((400102)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown''
      WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400102)::NUMBER
    unmapped: NULL::VARIANT
    url.path: (RAW:http)::VARCHAR
