type: mapping
id: cisco_ise_logs_4001_network_activity_1.1.0
version: '12'
name: Cisco Ise Logs to OCSF class Network Activity
data-types:
- cisco-ise-logs
mapping:
  fields:
    action: (CASE ((CASE WHEN LOGGING_CATEGORY IS NULL THEN 0 WHEN LOGGING_CATEGORY
      = 'CISE_Passed_Authentications' THEN 1 WHEN LOGGING_CATEGORY = 'CISE_Failed_Attempts'
      THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN
      2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN LOGGING_CATEGORY IS NULL THEN 0 WHEN LOGGING_CATEGORY =
      'CISE_Passed_Authentications' THEN 1 WHEN LOGGING_CATEGORY = 'CISE_Failed_Attempts'
      THEN 2 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN RAW:connectionstatus IS NULL THEN 0 WHEN RAW:connectionstatus
      = 'Succeeded' THEN 1 WHEN RAW:connectionstatus = 'Failed' THEN 4 WHEN RAW:connectionstatus
      = 'Dropped' THEN 5 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN RAW:connectionstatus IS NULL THEN 0 WHEN RAW:connectionstatus
      = 'Succeeded' THEN 1 WHEN RAW:connectionstatus = 'Failed' THEN 4 WHEN RAW:connectionstatus
      = 'Dropped' THEN 5 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open'
      WHEN 2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse'
      WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.name: (COALESCE(USERNAME::VARCHAR, AD_USERNAME::VARCHAR))::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.protocol_name: (PROTOCOL)::VARCHAR
    connection_info.session.uid: (SESSION_ID)::VARCHAR
    connection_info.uid: (RAW:uniqueconnectionidentifier)::VARCHAR
    count: NULL::NUMBER
    device.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('name', AD_GROUPS_NAMES[0])))::ARRAY
    device.hostname: (HOSTNAME)::VARCHAR
    device.ip: (DEVICE_IP_ADDRESS)::VARCHAR
    device.location.continent: (REGEXP_SUBSTR(DEVICE_LOCATION, 'NDG_([^#]+)', 1, 1,
      'e'))::VARCHAR
    device.mac: (RAW:macaddress)::VARCHAR
    device.name: (NETWORK_DEVICE_NAME)::VARCHAR
    device.type: (CASE ((CASE WHEN DEVICE_TYPE IS NULL THEN 0 WHEN DEVICE_TYPE ILIKE
      '%Switch%' THEN 10 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server'
      WHEN 10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN DEVICE_TYPE IS NULL THEN 0 WHEN DEVICE_TYPE ILIKE '%Switch%'
      THEN 10 ELSE 99 END)::NUMBER
    device.uid: (NETWORK_DEVICE_PROFILE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (DESTINATION_IP_ADDRESS)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cisco-ise-logs')::VARCHAR
    metadata.product.vendor_name: ('cisco-ise')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(USERNAME::VARCHAR, AD_USERNAME::VARCHAR))::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DEVICE_IP_ADDRESS)::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.mac'''
      type: '''MAC Address'''
      type_id: 3
      reputation: null::VARIANT
      value: (RAW:macaddress)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP_ADDRESS)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (NAS_IP_ADDRESS)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (NAS_IP_ADDRESS)::VARCHAR
    src_endpoint.port: (NAS_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN FAILURE_REASON IS NULL THEN 0 WHEN FAILURE_REASON ILIKE
      '%Dropped%' OR FAILURE_REASON ILIKE '%not present%' OR FAILURE_REASON ILIKE
      '%Rejected%' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN FAILURE_REASON IS NULL THEN 0 WHEN FAILURE_REASON ILIKE
      '%Dropped%' OR FAILURE_REASON ILIKE '%not present%' OR FAILURE_REASON ILIKE
      '%Rejected%' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400100 + (CASE WHEN RAW:connectionstatus IS NULL THEN 0 WHEN
      RAW:connectionstatus = ''Succeeded'' THEN 1 WHEN RAW:connectionstatus = ''Failed''
      THEN 4 WHEN RAW:connectionstatus = ''Dropped'' THEN 5 ELSE 99 END))::NUMBER)
      WHEN 400100 THEN ''Network Activity: Unknown'' WHEN 400101 THEN ''Network Activity:
      Open'' WHEN 400102 THEN ''Network Activity: Close'' WHEN 400103 THEN ''Network
      Activity: Reset'' WHEN 400104 THEN ''Network Activity: Fail'' WHEN 400105 THEN
      ''Network Activity: Refuse'' WHEN 400106 THEN ''Network Activity: Traffic''
      WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400100 + (CASE WHEN RAW:connectionstatus IS NULL THEN 0 WHEN RAW:connectionstatus
      = 'Succeeded' THEN 1 WHEN RAW:connectionstatus = 'Failed' THEN 4 WHEN RAW:connectionstatus
      = 'Dropped' THEN 5 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
