type: mapping
id: cisco_anyconnect_vpn_authentication_logs_4001_network_activity_1.1.0
version: '10'
name: Cisco Anyconnect Vpn Authentication Logs to OCSF class Network Activity
data-types:
- cisco-anyconnect-vpn-authentication-logs
mapping:
  fields:
    action: (CASE ((CASE WHEN ACCOUNT_STATUS_TYPE='Start' THEN 1 WHEN ACCOUNT_STATUS_TYPE='Stop'
      THEN 2 WHEN ACCOUNT_STATUS_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other'
      END)::VARCHAR
    action_id: (CASE WHEN ACCOUNT_STATUS_TYPE='Start' THEN 1 WHEN ACCOUNT_STATUS_TYPE='Stop'
      THEN 2 WHEN ACCOUNT_STATUS_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN ACCOUNT_STATUS_TYPE='Start' THEN 1 WHEN ACCOUNT_STATUS_TYPE='Stop'
      THEN 2 WHEN ACCOUNT_STATUS_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACCOUNT_STATUS_TYPE='Start' THEN 1 WHEN ACCOUNT_STATUS_TYPE='Stop'
      THEN 2 WHEN ACCOUNT_STATUS_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN
      4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.session.uid: (ACCOUNT_SESSION_ID)::VARCHAR
    actor.user.name: (USERNAME)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: (CASE ((CASE WHEN ACCOUNT_STATUS_TYPE='Start' THEN 1 WHEN ACCOUNT_STATUS_TYPE='Stop'
      THEN 2 WHEN ACCOUNT_STATUS_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 10 THEN 'Exonerated' WHEN 11 THEN
      'Corrected' WHEN 12 THEN 'Partially Corrected' WHEN 13 THEN 'Uncorrected' WHEN
      14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN 16 THEN 'No Action' WHEN 17 THEN
      'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN 'Alert' WHEN 2 THEN 'Blocked' WHEN
      20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN 22 THEN 'Captcha' WHEN 23 THEN 'Challenge'
      WHEN 24 THEN 'Access Revoked' WHEN 25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized'
      WHEN 27 THEN 'Error' WHEN 3 THEN 'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5
      THEN 'Deleted' WHEN 6 THEN 'Dropped' WHEN 7 THEN 'Custom Action' WHEN 8 THEN
      'Approved' WHEN 9 THEN 'Restored' WHEN 99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN ACCOUNT_STATUS_TYPE='Start' THEN 1 WHEN ACCOUNT_STATUS_TYPE='Stop'
      THEN 2 WHEN ACCOUNT_STATUS_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    dst_endpoint.hostname: (HOSTNAME)::VARCHAR
    dst_endpoint.ip: (NAS_IP_ADDRESS)::VARCHAR
    dst_endpoint.uid: (NAS_IDENTIFIER)::VARCHAR
    duration: (ACCOUNT_SESSION_TIME)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cisco-anyconnect-vpn-authentication-logs')::VARCHAR
    metadata.product.vendor_name: ('cisco-vpn')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USERNAME)::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (NAS_IP_ADDRESS)::VARCHAR
    - name: '''proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (FRAMED_IP_ADDRESS)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(CALLING_STATION_ID, TUNNEL_CLIENT_ENDPOINT))::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint.ip: (FRAMED_IP_ADDRESS)::VARCHAR
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (COALESCE(CALLING_STATION_ID, TUNNEL_CLIENT_ENDPOINT))::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN ACCOUNT_TERMINATE_CAUSE is NULL THEN 1 ELSE 2 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (ACCOUNT_TERMINATE_CAUSE)::VARCHAR
    status_id: (CASE WHEN ACCOUNT_TERMINATE_CAUSE is NULL THEN 1 ELSE 2 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes_in: (ACCOUNT_INPUT_OCTETS)::NUMBER
    traffic.bytes_out: (ACCOUNT_OUTPUT_OCTETS)::NUMBER
    type_name: '(CASE ((CASE WHEN ACCOUNT_STATUS_TYPE=''Start'' THEN 400101 WHEN ACCOUNT_STATUS_TYPE=''Stop''
      THEN 400102 WHEN ACCOUNT_STATUS_TYPE IS NULL THEN 400100 ELSE 400199 END)::NUMBER)
      WHEN 400100 THEN ''Network Activity: Unknown'' WHEN 400101 THEN ''Network Activity:
      Open'' WHEN 400102 THEN ''Network Activity: Close'' WHEN 400103 THEN ''Network
      Activity: Reset'' WHEN 400104 THEN ''Network Activity: Fail'' WHEN 400105 THEN
      ''Network Activity: Refuse'' WHEN 400106 THEN ''Network Activity: Traffic''
      WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN ACCOUNT_STATUS_TYPE='Start' THEN 400101 WHEN ACCOUNT_STATUS_TYPE='Stop'
      THEN 400102 WHEN ACCOUNT_STATUS_TYPE IS NULL THEN 400100 ELSE 400199 END)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
