type: mapping
id: cloudflare_zero_trust_network_sessions_4001_network_activity_1.1.0
version: '1'
name: Cloudflare Zero Trust Network Sessions to OCSF class Network Activity
data-types:
- cloudflare-zero-trust-network-sessions
mapping:
  fields:
    action: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN
      'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN CONNECTION_CLOSE_REASON IS NULL THEN 0 WHEN CONNECTION_CLOSE_REASON
      ILIKE '%open%' THEN 1 WHEN CONNECTION_CLOSE_REASON ILIKE '%close%' THEN 2 WHEN
      CONNECTION_CLOSE_REASON ILIKE '%reset%' THEN 3 WHEN CONNECTION_CLOSE_REASON
      ILIKE '%fail%' THEN 4 WHEN CONNECTION_CLOSE_REASON ILIKE '%refuse%' THEN 5 WHEN
      CONNECTION_CLOSE_REASON ILIKE '%traffic%' THEN 6 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN CONNECTION_CLOSE_REASON IS NULL THEN 0 WHEN CONNECTION_CLOSE_REASON
      ILIKE '%open%' THEN 1 WHEN CONNECTION_CLOSE_REASON ILIKE '%close%' THEN 2 WHEN
      CONNECTION_CLOSE_REASON ILIKE '%reset%' THEN 3 WHEN CONNECTION_CLOSE_REASON
      ILIKE '%fail%' THEN 4 WHEN CONNECTION_CLOSE_REASON ILIKE '%refuse%' THEN 5 WHEN
      CONNECTION_CLOSE_REASON ILIKE '%traffic%' THEN 6 ELSE 99 END::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN
      4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.session.created_time: (date_part('epoch_milliseconds', SESSION_START_TIME::TIMESTAMP_LTZ))::NUMBER
    actor.session.created_time_dt: (SESSION_START_TIME)::TIMESTAMP_LTZ
    actor.session.expiration_time: (date_part('epoch_milliseconds', SESSION_END_TIME::TIMESTAMP_LTZ))::NUMBER
    actor.session.expiration_time_dt: (SESSION_END_TIME)::TIMESTAMP_LTZ
    actor.session.uid: (SESSION_ID)::VARCHAR
    actor.user.account.uid: (ACCOUNT_ID)::VARCHAR
    actor.user.email_addr: (EMAIL)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.provider: ('CloudFlare')::VARCHAR
    connection_info.protocol_name: (LOWER(PROTOCOL))::VARCHAR
    connection_info.protocol_num: (CASE WHEN PROTOCOL ILIKE 'icmp' THEN 1 WHEN PROTOCOL
      ILIKE 'tcp' THEN 6 WHEN PROTOCOL ILIKE 'udp' THEN 17 WHEN PROTOCOL ILIKE 'rdp'
      THEN 27 ELSE NULL END)::NUMBER
    connection_info.uid: (VIRTUAL_NETWOR_ID)::VARCHAR
    count: NULL::NUMBER
    device.name: (DEVICE_NAME)::VARCHAR
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (ORIGIN_IP)::VARCHAR
    dst_endpoint.port: (ORIGIN_PORT)::NUMBER
    dst_endpoint.uid: (DESTINATION_TUNNEL_ID)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cloudflare-zero-trust-network-sessions')::VARCHAR
    metadata.product.vendor_name: ('cloudflare')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (EMAIL)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (ORIGIN_IP)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(SOURCE_IP, SOURCE_INTERNAL_IP))::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (COALESCE(SOURCE_IP, SOURCE_INTERNAL_IP))::VARCHAR
    src_endpoint.port: (SOURCE_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (CONNECTION_CLOSE_REASON)::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', session_start_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (session_start_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls.certificate.issuer: (ORIGIN_TLS_CERTIFICATE_ISSUER)::VARCHAR
    tls.cipher: (ORIGIN_TLS_CIPHER)::VARCHAR
    tls.handshake_dur: (ORIGIN_TLS_HANDSHAKE_DURATION)::NUMBER
    tls.version: (ORIGIN_TLS_VERSION)::VARCHAR
    traffic.bytes_in: (BYTES_RECEIVED)::NUMBER
    traffic.bytes_out: (BYTES_SENT)::NUMBER
    type_name: '(CASE (CASE WHEN CONNECTION_CLOSE_REASON IS NULL THEN 400100 WHEN
      CONNECTION_CLOSE_REASON ILIKE ''%open%'' THEN 400101 WHEN CONNECTION_CLOSE_REASON
      ILIKE ''%close%'' THEN 400102 WHEN CONNECTION_CLOSE_REASON ILIKE ''%reset%''
      THEN 400103 WHEN CONNECTION_CLOSE_REASON ILIKE ''%fail%'' THEN 400104 WHEN CONNECTION_CLOSE_REASON
      ILIKE ''%refuse%'' THEN 400105 WHEN CONNECTION_CLOSE_REASON ILIKE ''%traffic%''
      THEN 400106 ELSE 400199 END::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown''
      WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN CONNECTION_CLOSE_REASON IS NULL THEN 400100 WHEN CONNECTION_CLOSE_REASON
      ILIKE '%open%' THEN 400101 WHEN CONNECTION_CLOSE_REASON ILIKE '%close%' THEN
      400102 WHEN CONNECTION_CLOSE_REASON ILIKE '%reset%' THEN 400103 WHEN CONNECTION_CLOSE_REASON
      ILIKE '%fail%' THEN 400104 WHEN CONNECTION_CLOSE_REASON ILIKE '%refuse%' THEN
      400105 WHEN CONNECTION_CLOSE_REASON ILIKE '%traffic%' THEN 400106 ELSE 400199
      END)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
