type: mapping
id: cloudflare_gateway_dns_4003_dns_activity_1.1.0
version: '1'
name: Cloudflare Gateway Dns to OCSF class Dns Activity
data-types:
- cloudflare-gateway-dns
mapping:
  fields:
    action: (CASE (CASE WHEN RESOLVER_DECISION IS NULL THEN 0 WHEN RESOLVER_DECISION
      ILIKE '%allowed%' THEN 1 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN RESOLVER_DECISION IS NULL THEN 0 WHEN RESOLVER_DECISION
      ILIKE '%allowed%' THEN 1 ELSE 99 END)::NUMBER
    activity_id: (1)::NUMBER
    activity_name: (CASE (1::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Query' WHEN
      2 THEN 'Response' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (EMAIL)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    answers: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('rdata', RDATA[0]:data::VARCHAR, 'type',
      RDATA[0]:type::VARCHAR)))::ARRAY
    api.service.uid: (APPLICATION_ID)::VARCHAR
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('dns_activity')::VARCHAR
    class_uid: ('4003')::NUMBER
    cloud.provider: ('Cloudflare')::VARCHAR
    connection_info.protocol_name: (PROTOCOL)::VARCHAR
    count: NULL::NUMBER
    device.name: (DEVICE_NAME)::VARCHAR
    device.type: (CASE (99::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN
      10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (99)::NUMBER
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: (CASE (CASE WHEN RESOLVER_DECISION IS NULL THEN 0 WHEN RESOLVER_DECISION
      ILIKE '%allowed%' THEN 1 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Allowed' WHEN 10 THEN 'Exonerated' WHEN 11 THEN 'Corrected' WHEN 12 THEN 'Partially
      Corrected' WHEN 13 THEN 'Uncorrected' WHEN 14 THEN 'Delayed' WHEN 15 THEN 'Detected'
      WHEN 16 THEN 'No Action' WHEN 17 THEN 'Logged' WHEN 18 THEN 'Tagged' WHEN 19
      THEN 'Alert' WHEN 2 THEN 'Blocked' WHEN 20 THEN 'Count' WHEN 21 THEN 'Reset'
      WHEN 22 THEN 'Captcha' WHEN 23 THEN 'Challenge' WHEN 24 THEN 'Access Revoked'
      WHEN 25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized' WHEN 27 THEN 'Error' WHEN
      3 THEN 'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5 THEN 'Deleted' WHEN 6 THEN
      'Dropped' WHEN 7 THEN 'Custom Action' WHEN 8 THEN 'Approved' WHEN 9 THEN 'Restored'
      WHEN 99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN RESOLVER_DECISION IS NULL THEN 0 WHEN RESOLVER_DECISION
      ILIKE '%allowed%' THEN 1 ELSE 99 END)::NUMBER
    dst_endpoint.ip: (DST_IP)::VARCHAR
    dst_endpoint.port: (DST_PORT)::NUMBER
    duration: (CUSTOM_RESOLVE_DURATION_MS)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (query_type)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cloudflare-gateway-dns')::VARCHAR
    metadata.product.vendor_name: ('cloudflare')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (EMAIL)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DST_IP)::VARCHAR
    - name: '''query.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (QUERY_NAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SRC_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    query.hostname: (QUERY_NAME)::VARCHAR
    query.type: (QUERY_TYPE_NAME)::VARCHAR
    query_time: NULL::NUMBER
    query_time_dt: NULL::TIMESTAMP_LTZ
    raw_data: NULL::VARCHAR
    rcode: (CASE (CASE WHEN RCODE = 0 THEN 0 WHEN RCODE = 2 THEN 2 WHEN RCODE = 3
      THEN 3 ELSE 99 END::NUMBER) WHEN 0 THEN 'NoError' WHEN 1 THEN 'FormError' WHEN
      10 THEN 'NotZone' WHEN 11 THEN 'DSOTYPENI' WHEN 16 THEN 'BADSIG_VERS' WHEN 17
      THEN 'BADKEY' WHEN 18 THEN 'BADTIME' WHEN 19 THEN 'BADMODE' WHEN 2 THEN 'ServError'
      WHEN 20 THEN 'BADNAME' WHEN 21 THEN 'BADALG' WHEN 22 THEN 'BADTRUNC' WHEN 23
      THEN 'BADCOOKIE' WHEN 24 THEN 'Unassigned' WHEN 25 THEN 'Reserved' WHEN 3 THEN
      'NXDomain' WHEN 4 THEN 'NotImp' WHEN 5 THEN 'Refused' WHEN 6 THEN 'YXDomain'
      WHEN 7 THEN 'YXRRSet' WHEN 8 THEN 'NXRRSet' WHEN 9 THEN 'NotAuth' WHEN 99 THEN
      'Other' END)::VARCHAR
    rcode_id: (CASE WHEN RCODE = 0 THEN 0 WHEN RCODE = 2 THEN 2 WHEN RCODE = 3 THEN
      3 ELSE 99 END)::NUMBER
    response_time: NULL::NUMBER
    response_time_dt: NULL::TIMESTAMP_LTZ
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (SRC_IP)::VARCHAR
    src_endpoint.port: (SRC_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN CUSTOM_RESOLVER_RESPONSE IS NULL THEN 0 WHEN CUSTOM_RESOLVER_RESPONSE
      = 'Success' THEN 1 WHEN CUSTOM_RESOLVER_RESPONSE = 'Failure' THEN 2 ELSE 99
      END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure'
      WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN CUSTOM_RESOLVER_RESPONSE IS NULL THEN 0 WHEN CUSTOM_RESOLVER_RESPONSE
      = 'Success' THEN 1 WHEN CUSTOM_RESOLVER_RESPONSE = 'Failure' THEN 2 ELSE 99
      END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE (400301::NUMBER) WHEN 400300 THEN ''DNS Activity: Unknown''
      WHEN 400301 THEN ''DNS Activity: Query'' WHEN 400302 THEN ''DNS Activity: Response''
      WHEN 400306 THEN ''DNS Activity: Traffic'' WHEN 400399 THEN ''DNS Activity:
      Other'' END)::VARCHAR'
    type_uid: (400301)::NUMBER
    unmapped: NULL::VARIANT
