type: mapping
id: cloudflare_gateway_http_4002_http_activity_1.1.0
version: '1'
name: Cloudflare Gateway Http to OCSF class Http Activity
data-types:
- cloudflare-gateway-http
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%allow%' THEN
      1 WHEN ACTION = '%block%' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%allow%' THEN 1
      WHEN ACTION = '%block%' THEN 2 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN HTTP_METHOD IS NULL OR HTTP_METHOD = 'UNKNOWN' THEN 0
      WHEN HTTP_METHOD = 'CONNECT' THEN 1 WHEN HTTP_METHOD = 'DELETE' THEN 2 WHEN
      HTTP_METHOD = 'GET' THEN 3 WHEN HTTP_METHOD = 'HEAD' THEN 4 WHEN HTTP_METHOD
      = 'OPTIONS' THEN 5 WHEN HTTP_METHOD = 'POST' THEN 6 WHEN HTTP_METHOD = 'PUT'
      THEN 7 WHEN HTTP_METHOD = 'TRACE' THEN 8 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN HTTP_METHOD IS NULL OR HTTP_METHOD = 'UNKNOWN'
      THEN 0 WHEN HTTP_METHOD = 'CONNECT' THEN 1 WHEN HTTP_METHOD = 'DELETE' THEN
      2 WHEN HTTP_METHOD = 'GET' THEN 3 WHEN HTTP_METHOD = 'HEAD' THEN 4 WHEN HTTP_METHOD
      = 'OPTIONS' THEN 5 WHEN HTTP_METHOD = 'POST' THEN 6 WHEN HTTP_METHOD = 'PUT'
      THEN 7 WHEN HTTP_METHOD = 'TRACE' THEN 8 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Connect' WHEN 2 THEN 'Delete' WHEN 3 THEN 'Get' WHEN 4 THEN 'Head'
      WHEN 5 THEN 'Options' WHEN 6 THEN 'Post' WHEN 7 THEN 'Put' WHEN 8 THEN 'Trace'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.session.uid: (SESSION_ID)::VARCHAR
    actor.user.account.uid: (ACCOUNT_ID)::VARCHAR
    actor.user.email_addr: (EMAIL)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('http_activity')::VARCHAR
    class_uid: ('4002')::NUMBER
    cloud: NULL::VARIANT
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device.name: (DEVICE_NAME)::VARCHAR
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (DESTINATION_IP)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    http_cookies: NULL::ARRAY
    http_request.http_method: (HTTP_METHOD)::VARCHAR
    http_request.referrer: (REFERER)::VARCHAR
    http_request.uid: (REQUEST_ID)::VARCHAR
    http_request.url.hostname: (HTTP_HOST)::VARCHAR
    http_request.url.url_string: (URL)::VARCHAR
    http_request.user_agent: (USER_AGENT)::VARCHAR
    http_request.version: (HTTP_VERSION)::VARCHAR
    http_response.code: (HTTP_STATUS_CODE)::NUMBER
    http_status: NULL::NUMBER
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (action)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cloudflare-gateway-http')::VARCHAR
    metadata.product.vendor_name: ('cloudflare')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (EMAIL)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HTTP_HOST)::VARCHAR
    - name: '''http_request.url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (URL)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.port: (SOURCE_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((CASE WHEN HTTP_METHOD IS NULL OR HTTP_METHOD = ''UNKNOWN''
      THEN 400200 WHEN HTTP_METHOD = ''CONNECT'' THEN 400201 WHEN HTTP_METHOD = ''DELETE''
      THEN 400202 WHEN HTTP_METHOD = ''GET'' THEN 400203 WHEN HTTP_METHOD = ''HEAD''
      THEN 400204 WHEN HTTP_METHOD = ''OPTIONS'' THEN 400205 WHEN HTTP_METHOD = ''POST''
      THEN 400206 WHEN HTTP_METHOD = ''PUT'' THEN 400207 WHEN HTTP_METHOD = ''TRACE''
      THEN 400208 ELSE 400299 END)::NUMBER) WHEN 400200 THEN ''HTTP Activity: Unknown''
      WHEN 400201 THEN ''HTTP Activity: Connect'' WHEN 400202 THEN ''HTTP Activity:
      Delete'' WHEN 400203 THEN ''HTTP Activity: Get'' WHEN 400204 THEN ''HTTP Activity:
      Head'' WHEN 400205 THEN ''HTTP Activity: Options'' WHEN 400206 THEN ''HTTP Activity:
      Post'' WHEN 400207 THEN ''HTTP Activity: Put'' WHEN 400208 THEN ''HTTP Activity:
      Trace'' WHEN 400299 THEN ''HTTP Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN HTTP_METHOD IS NULL OR HTTP_METHOD = 'UNKNOWN' THEN 400200
      WHEN HTTP_METHOD = 'CONNECT' THEN 400201 WHEN HTTP_METHOD = 'DELETE' THEN 400202
      WHEN HTTP_METHOD = 'GET' THEN 400203 WHEN HTTP_METHOD = 'HEAD' THEN 400204 WHEN
      HTTP_METHOD = 'OPTIONS' THEN 400205 WHEN HTTP_METHOD = 'POST' THEN 400206 WHEN
      HTTP_METHOD = 'PUT' THEN 400207 WHEN HTTP_METHOD = 'TRACE' THEN 400208 ELSE
      400299 END)::NUMBER
    unmapped: NULL::VARIANT
