type: mapping
id: crowdstrike_devices_5001_inventory_info_1.1.0
version: '13'
name: Crowdstrike Devices to OCSF class Inventory Info
data-types:
- crowdstrike-devices
mapping:
  fields:
    activity_id: (2)::NUMBER
    activity_name: (CASE ((2)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Log' WHEN
      2 THEN 'Collect' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((5)::NUMBER) WHEN 5 THEN 'Discovery' END)::VARCHAR
    category_uid: (5)::NUMBER
    class_name: ('inventory_info')::VARCHAR
    class_uid: ('5001')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.domain: (MACHINE_DOMAIN)::VARCHAR
    device.first_seen_time: (date_part('epoch_milliseconds', (FIRST_SEEN)::TIMESTAMP_LTZ))::NUMBER
    device.first_seen_time_dt: (FIRST_SEEN)::TIMESTAMP_LTZ
    device.groups: (GROUPS)::ARRAY
    device.hostname: (HOSTNAME)::VARCHAR
    device.hw_info.bios_manufacturer: (SYSTEM_MANUFACTURER)::VARCHAR
    device.instance_uid: (INSTANCE_ID)::VARCHAR
    device.ip: (LOCAL_IP)::VARCHAR
    device.last_seen_time: (date_part('epoch_milliseconds', (LAST_SEEN)::TIMESTAMP_LTZ))::NUMBER
    device.last_seen_time_dt: (LAST_SEEN)::TIMESTAMP_LTZ
    device.mac: (MAC_ADDRESS)::VARCHAR
    device.modified_time: (date_part('epoch_milliseconds', (MODIFIED_TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    device.modified_time_dt: (MODIFIED_TIMESTAMP)::TIMESTAMP_LTZ
    device.name: (SYSTEM_PRODUCT_NAME)::VARCHAR
    device.org.uid: (CID)::VARCHAR
    device.os.build: (OS_BUILD)::VARCHAR
    device.os.name: (PLATFORM_NAME)::VARCHAR
    device.os.version: (OS_VERSION)::VARCHAR
    device.type: (CASE ((CASE WHEN PRODUCT_TYPE_DESC IS NULL THEN 0 WHEN PRODUCT_TYPE_DESC='Server'
      THEN 1 WHEN PRODUCT_TYPE_DESC='Workstation' THEN 2 WHEN PRODUCT_TYPE_DESC='Mobile'
      THEN 5 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN
      10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN PRODUCT_TYPE_DESC IS NULL THEN 0 WHEN PRODUCT_TYPE_DESC='Server'
      THEN 1 WHEN PRODUCT_TYPE_DESC='Workstation' THEN 2 WHEN PRODUCT_TYPE_DESC='Mobile'
      THEN 5 ELSE 99 END)::NUMBER
    device.uid: (DEVICE_ID)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('crowdstrike-devices')::VARCHAR
    metadata.product.vendor_name: ('crowdstrike')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (LOCAL_IP)::VARCHAR
    - name: '''device.mac'''
      type: '''MAC Address'''
      type_id: 3
      reputation: null::VARIANT
      value: (MAC_ADDRESS)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((500102)::NUMBER) WHEN 500100 THEN ''Device Inventory Info:
      Unknown'' WHEN 500101 THEN ''Device Inventory Info: Log'' WHEN 500102 THEN ''Device
      Inventory Info: Collect'' WHEN 500199 THEN ''Device Inventory Info: Other''
      END)::VARCHAR'
    type_uid: (500102)::NUMBER
    unmapped: NULL::VARIANT
