type: mapping
id: crowdstrike_raw_events_4003_dns_activity_1.1.0
version: '13'
name: Crowdstrike Raw Events to OCSF class Dns Activity
data-types:
- crowdstrike-raw-events
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (1)::NUMBER
    activity_name: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Query' WHEN
      2 THEN 'Response' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (COMMAND_LINE)::VARCHAR
    actor.process.file.name: (RAW:ContextBaseFileName)::VARCHAR
    actor.process.pid: (RAW_PROCESS_ID)::NUMBER
    actor.process.tid: (RAW:ContextThreadId)::NUMBER
    actor.process.uid: (RAW:ContextProcessId)::VARCHAR
    answers: NULL::ARRAY
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('dns_activity')::VARCHAR
    class_uid: ('4003')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.direction_id: (1)::NUMBER
    connection_info.protocol_ver: (CASE ((PARSE_IP(AIP, 'INET', 1):family)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 4 THEN 'Internet Protocol version 4 (IPv4)' WHEN
      6 THEN 'Internet Protocol version 6 (IPv6)' WHEN 99 THEN 'Other' END)::VARCHAR
    connection_info.protocol_ver_id: (PARSE_IP(AIP, 'INET', 1):family)::NUMBER
    count: (RAW:DnsRequestCount)::NUMBER
    device.os.type: (CASE ((CASE WHEN EVENT_PLATFORM = 'Win' THEN 100 WHEN EVENT_PLATFORM
      = 'Lin' THEN 200 WHEN EVENT_PLATFORM = 'Mac' THEN 300 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile'
      WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301
      THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX'
      WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN EVENT_PLATFORM = 'Win' THEN 100 WHEN EVENT_PLATFORM
      = 'Lin' THEN 200 WHEN EVENT_PLATFORM = 'Mac' THEN 300 ELSE 99 END)::NUMBER
    device.uid: (AID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_simple_name)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('crowdstrike-raw-events')::VARCHAR
    metadata.product.vendor_name: ('crowdstrike')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (RAW:ContextBaseFileName)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''query.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DOMAIN_NAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (AIP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    query.hostname: (DOMAIN_NAME)::VARCHAR
    query_time: NULL::NUMBER
    query_time_dt: NULL::TIMESTAMP_LTZ
    raw_data: NULL::VARCHAR
    rcode: NULL::VARCHAR
    rcode_id: NULL::NUMBER
    response_time: NULL::NUMBER
    response_time_dt: NULL::TIMESTAMP_LTZ
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (AIP)::VARCHAR
    src_endpoint.uid: (AID)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2
      THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (0)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400301)::NUMBER) WHEN 400300 THEN ''DNS Activity: Unknown''
      WHEN 400301 THEN ''DNS Activity: Query'' WHEN 400302 THEN ''DNS Activity: Response''
      WHEN 400306 THEN ''DNS Activity: Traffic'' WHEN 400399 THEN ''DNS Activity:
      Other'' END)::VARCHAR'
    type_uid: (400301)::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_SIMPLE_NAME ILIKE '%Dns%'
