type: mapping
id: crowdstrike_falcon_event_streams_2004_detection_finding_1.1.0
version: '1'
name: Crowdstrike Falcon Event Streams to OCSF class Detection Finding
data-types:
- crowdstrike-falcon-event-streams
mapping:
  fields:
    action: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN
      'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN RAW:OperationName IS NULL THEN 0 WHEN RAW:OperationName
      ILIKE '%update%' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN RAW:OperationName IS NULL THEN 0 WHEN RAW:OperationName
      ILIKE '%update%' THEN 2 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Create' WHEN 2 THEN 'Update' WHEN 3 THEN 'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (COALESCE(RAW:Attributes:assigned_to_uid, RAW:Attributes:assign_to_user_id))::VARCHAR
    actor.user.full_name: (COALESCE(RAW:Attributes:assign_to_name, RAW:Attributes:assigned_to))::VARCHAR
    actor.user.uid: (COALESCE(IFF(RAW:UserId NOT ILIKE '%@%', RAW:UserId, NULL), RAW:Attributes:assign_to_uuid))::VARCHAR
    api.service.uid: (RAW:Attributes:APIClientID)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (2::NUMBER) WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: (2)::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud.provider: ('Crowdstrike')::VARCHAR
    comment: NULL::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: NULL::NUMBER
    confidence_score: NULL::NUMBER
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: NULL::ARRAY
    finding_info.data_sources: (ARRAY_CONSTRUCT(RAW:Attributes:product))::ARRAY
    finding_info.title: (RAW:Attributes:type)::VARCHAR
    finding_info.types: (ARRAY_CONSTRUCT(RAW:Attributes:type))::ARRAY
    finding_info.uid: (RAW:Attributes:detection_id)::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('crowdstrike-falcon-event-streams')::VARCHAR
    metadata.product.vendor_name: ('crowdstrike')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (COALESCE(RAW:Attributes:assigned_to_uid, RAW:Attributes:assign_to_user_id))::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: NULL::ARRAY
    risk_level: NULL::VARCHAR
    risk_level_id: NULL::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN COALESCE(RAW:Attributes:update_status, RAW:Attributes:new_state)
      IS NULL THEN 0 WHEN COALESCE(RAW:Attributes:update_status, RAW:Attributes:new_state)
      = 'in_progress' THEN 2 WHEN COALESCE(RAW:Attributes:update_status, RAW:Attributes:new_state)
      = 'closed' THEN 4 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'New'
      WHEN 2 THEN 'In Progress' WHEN 3 THEN 'Suppressed' WHEN 4 THEN 'Resolved' WHEN
      99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN COALESCE(RAW:Attributes:update_status, RAW:Attributes:new_state)
      IS NULL THEN 0 WHEN COALESCE(RAW:Attributes:update_status, RAW:Attributes:new_state)
      = 'in_progress' THEN 2 WHEN COALESCE(RAW:Attributes:update_status, RAW:Attributes:new_state)
      = 'closed' THEN 4 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', METADATA$INSERTION_TIME::TIMESTAMP_LTZ))::NUMBER
    time_dt: (METADATA$INSERTION_TIME)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((200400 + (CASE WHEN RAW:OperationName IS NULL THEN 0 WHEN
      RAW:OperationName ILIKE ''%update%'' THEN 2 ELSE 99 END))::NUMBER) WHEN 200400
      THEN ''Detection Finding: Unknown'' WHEN 200401 THEN ''Detection Finding: Create''
      WHEN 200402 THEN ''Detection Finding: Update'' WHEN 200403 THEN ''Detection
      Finding: Close'' WHEN 200499 THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: (200400 + (CASE WHEN RAW:OperationName IS NULL THEN 0 WHEN RAW:OperationName
      ILIKE '%update%' THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
  predicate: RAW:ServiceName = 'detections'
