type: mapping
id: crowdstrike_filevantage_queries_changes_1001_file_activity_1.1.0
version: '15'
name: Crowdstrike Filevantage Queries Changes to OCSF class File Activity
data-types:
- crowdstrike-filevantage-queries-changes
mapping:
  fields:
    access_mask: NULL::NUMBER
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN ACTION_TYPE = 'CREATE' then 1 WHEN ACTION_TYPE = 'RENAME'
      THEN 5 WHEN ACTION_TYPE = 'DELETE' THEN 4 WHEN ACTION_TYPE is null THEN 0 ELSE
      99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION_TYPE = 'CREATE' then 1 WHEN ACTION_TYPE
      = 'RENAME' THEN 5 WHEN ACTION_TYPE = 'DELETE' THEN 4 WHEN ACTION_TYPE is null
      THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN
      10 THEN 'Encrypt' WHEN 11 THEN 'Decrypt' WHEN 12 THEN 'Mount' WHEN 13 THEN 'Unmount'
      WHEN 14 THEN 'Open' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete'
      WHEN 5 THEN 'Rename' WHEN 6 THEN 'Set Attributes' WHEN 7 THEN 'Set Security'
      WHEN 8 THEN 'Get Attributes' WHEN 9 THEN 'Get Security' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.process.cmd_line: (COMMAND_LINE)::VARCHAR
    actor.process.file.name: (PROCESS_IMAGE_FILE_NAME)::VARCHAR
    actor.process.parent_process.name: (PARENT_PROCESS_IMAGE_FILE_NAME)::VARCHAR
    actor.process.parent_process.parent_process.name: (GRANDPARENT_PROCESS_IMAGE_FILE_NAME)::VARCHAR
    actor.process.pid: (PROCESS_ID)::NUMBER
    actor.process.user.name: (USER_NAME)::VARCHAR
    actor.process.user.uid: (COALESCE(USER_ID, REAL_USER_ID))::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: NULL::VARCHAR
    category_uid: NULL::NUMBER
    class_name: ('file_activity')::VARCHAR
    class_uid: ('1001')::NUMBER
    cloud: NULL::VARIANT
    component: NULL::VARCHAR
    connection_uid: NULL::VARCHAR
    count: NULL::NUMBER
    create_mask: NULL::VARCHAR
    device.container.tag: (TAGS_NAME[0])::VARCHAR
    device.container.uid: (OCI_CONTAINER_ID)::VARCHAR
    device.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', HOST_GROUPS_NAMES::VARCHAR)))::ARRAY
    device.hostname: (HOSTNAME)::VARCHAR
    device.ip: (COALESCE(LOCAL_IP, EXTERNAL_IP))::VARCHAR
    device.os.name: (PLATFORM_NAME)::VARCHAR
    device.os.version: (OS_VERSION)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    file.accessed_time: (date_part('epoch_milliseconds', (INGESTION_TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    file.accessed_time_dt: (INGESTION_TIMESTAMP)::TIMESTAMP_LTZ
    file.created_time: (date_part('epoch_milliseconds', (ACTION_TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    file.created_time_dt: (ACTION_TIMESTAMP)::TIMESTAMP_LTZ
    file.modified_time: (date_part('epoch_milliseconds', (PREVALENCE_COMPUTED_TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    file.modified_time_dt: (PREVALENCE_COMPUTED_TIMESTAMP)::TIMESTAMP_LTZ
    file.path: (ENTITY_PATH)::VARCHAR
    file.type: (CASE ((CASE ENTITY_TYPE WHEN 'FILE' THEN 1::NUMBER WHEN 'DIR' THEN
      2::NUMBER ELSE 0::NUMBER END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Regular
      File' WHEN 2 THEN 'Folder' WHEN 3 THEN 'Character Device' WHEN 4 THEN 'Block
      Device' WHEN 5 THEN 'Local Socket' WHEN 6 THEN 'Named Pipe' WHEN 7 THEN 'Symbolic
      Link' WHEN 99 THEN 'Other' END)::VARCHAR
    file.type_id: (CASE ENTITY_TYPE WHEN 'FILE' THEN 1::NUMBER WHEN 'DIR' THEN 2::NUMBER
      ELSE 0::NUMBER END)::NUMBER
    file_diff: NULL::VARCHAR
    file_result: NULL::VARIANT
    firewall_rule.name: (POLICY_RULE_GROUP_NAME)::VARCHAR
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('crowdstrike-filevantage-queries-changes')::VARCHAR
    metadata.product.vendor_name: ('crowdstrike-api')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (PROCESS_IMAGE_FILE_NAME)::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (PARENT_PROCESS_IMAGE_FILE_NAME)::VARCHAR
    - name: '''actor.process.parent_process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.parent_process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (GRANDPARENT_PROCESS_IMAGE_FILE_NAME)::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.container'''
      type: '''Container'''
      type_id: 27
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(LOCAL_IP, EXTERNAL_IP))::VARCHAR
    - name: '''file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((CASE WHEN SEVERITY = 'HIGH' then 4 WHEN SEVERITY = 'CRITICAL'
      THEN 5 WHEN SEVERITY is null THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN
      'High' WHEN 5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY = 'HIGH' then 4 WHEN SEVERITY = 'CRITICAL' THEN
      5 WHEN SEVERITY is null THEN 0 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', ingestion_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (ingestion_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100100 + (CASE WHEN ACTION_TYPE = ''CREATE'' then 1 WHEN ACTION_TYPE
      = ''RENAME'' THEN 5 WHEN ACTION_TYPE = ''DELETE'' THEN 4 WHEN ACTION_TYPE is
      null THEN 0 ELSE 99 END::NUMBER))::NUMBER) WHEN 100100 THEN ''File System Activity:
      Unknown'' WHEN 100101 THEN ''File System Activity: Create'' WHEN 100102 THEN
      ''File System Activity: Read'' WHEN 100103 THEN ''File System Activity: Update''
      WHEN 100104 THEN ''File System Activity: Delete'' WHEN 100105 THEN ''File System
      Activity: Rename'' WHEN 100106 THEN ''File System Activity: Set Attributes''
      WHEN 100107 THEN ''File System Activity: Set Security'' WHEN 100108 THEN ''File
      System Activity: Get Attributes'' WHEN 100109 THEN ''File System Activity: Get
      Security'' WHEN 100110 THEN ''File System Activity: Encrypt'' WHEN 100111 THEN
      ''File System Activity: Decrypt'' WHEN 100112 THEN ''File System Activity: Mount''
      WHEN 100113 THEN ''File System Activity: Unmount'' WHEN 100114 THEN ''File System
      Activity: Open'' WHEN 100199 THEN ''File System Activity: Other'' END)::VARCHAR'
    type_uid: (100100 + (CASE WHEN ACTION_TYPE = 'CREATE' then 1 WHEN ACTION_TYPE
      = 'RENAME' THEN 5 WHEN ACTION_TYPE = 'DELETE' THEN 4 WHEN ACTION_TYPE is null
      THEN 0 ELSE 99 END::NUMBER))::NUMBER
    unmapped: NULL::VARIANT
