type: mapping
id: crowdstrike_raw_events_1003_kernel_activity_1.1.0
version: '1'
name: Crowdstrike Raw Events to OCSF class Kernel Activity
data-types:
- crowdstrike-raw-events
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN EVENT_SIMPLE_NAME IN ('CreateThreadNoStartImage', 'CreateThreadReflectiveDll','DriverLoad','KextLoad','RawBindIP4','RawBindIP6','PromiscuousBindIP4','VolumeSnapshotCreated')
      THEN 1 WHEN EVENT_SIMPLE_NAME IN ('ProcessSelfDeleted','VolumeSnapshotDeleted','KextUnload')
      THEN 3 WHEN EVENT_SIMPLE_NAME IN ('TokenImpersonated','InjectedThread','InjectedThreadFromUnsignedModule','JavaInjectedThread','DllInjection','ReflectiveDotnetModuleLoad','KernelModeLoadImage','ProcessInjection','LowILModuleLoadAttempt','UnsignedModuleLoad','ASLRBypassAttempt','UserExceptionDEP','EarlyExploitPivotDetect','ProcessExecOnPackedExecutable','ProcessExecOnSMBFile')
      THEN 4 WHEN EVENT_SIMPLE_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN EVENT_SIMPLE_NAME IN ('CreateThreadNoStartImage',
      'CreateThreadReflectiveDll','DriverLoad','KextLoad','RawBindIP4','RawBindIP6','PromiscuousBindIP4','VolumeSnapshotCreated')
      THEN 1 WHEN EVENT_SIMPLE_NAME IN ('ProcessSelfDeleted','VolumeSnapshotDeleted','KextUnload')
      THEN 3 WHEN EVENT_SIMPLE_NAME IN ('TokenImpersonated','InjectedThread','InjectedThreadFromUnsignedModule','JavaInjectedThread','DllInjection','ReflectiveDotnetModuleLoad','KernelModeLoadImage','ProcessInjection','LowILModuleLoadAttempt','UnsignedModuleLoad','ASLRBypassAttempt','UserExceptionDEP','EarlyExploitPivotDetect','ProcessExecOnPackedExecutable','ProcessExecOnSMBFile')
      THEN 4 WHEN EVENT_SIMPLE_NAME IS NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Read' WHEN 3 THEN 'Delete' WHEN
      4 THEN 'Invoke' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (COMMAND_LINE)::VARCHAR
    actor.process.file.name: (TARGET_FILE_NAME)::VARCHAR
    actor.process.file.path: (TARGET_DIRECTORY_NAME)::VARCHAR
    actor.process.pid: (RAW_PROCESS_ID)::NUMBER
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('kernel_activity')::VARCHAR
    class_uid: ('1003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.domain: (DOMAIN_NAME)::VARCHAR
    device.ip: (AIP)::VARCHAR
    device.os.type: (CASE ((CASE WHEN EVENT_PLATFORM = 'Win' THEN 100 WHEN EVENT_PLATFORM
      = 'Lin' THEN 200 WHEN EVENT_PLATFORM = 'Mac' THEN 300 WHEN EVENT_PLATFORM IS
      NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows'
      WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android'
      WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN
      'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN EVENT_PLATFORM = 'Win' THEN 100 WHEN EVENT_PLATFORM
      = 'Lin' THEN 200 WHEN EVENT_PLATFORM = 'Mac' THEN 300 WHEN EVENT_PLATFORM IS
      NULL THEN 0 ELSE 99 END)::NUMBER
    device.uid: (AID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    kernel.name: (IMAGE_FILE_NAME)::VARCHAR
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_simple_name)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('crowdstrike-raw-events')::VARCHAR
    metadata.product.vendor_name: ('crowdstrike')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (TARGET_FILE_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (AIP)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2
      THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (0)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100300 + (CASE WHEN EVENT_SIMPLE_NAME IN (''CreateThreadNoStartImage'',
      ''CreateThreadReflectiveDll'',''DriverLoad'',''KextLoad'',''RawBindIP4'',''RawBindIP6'',''PromiscuousBindIP4'',''VolumeSnapshotCreated'')
      THEN 1 WHEN EVENT_SIMPLE_NAME IN (''ProcessSelfDeleted'',''VolumeSnapshotDeleted'',''KextUnload'')
      THEN 3 WHEN EVENT_SIMPLE_NAME IN (''TokenImpersonated'',''InjectedThread'',''InjectedThreadFromUnsignedModule'',''JavaInjectedThread'',''DllInjection'',''ReflectiveDotnetModuleLoad'',''KernelModeLoadImage'',''ProcessInjection'',''LowILModuleLoadAttempt'',''UnsignedModuleLoad'',''ASLRBypassAttempt'',''UserExceptionDEP'',''EarlyExploitPivotDetect'',''ProcessExecOnPackedExecutable'',''ProcessExecOnSMBFile'')
      THEN 4 WHEN EVENT_SIMPLE_NAME IS NULL THEN 0 ELSE 99 END))::NUMBER) WHEN 100300
      THEN ''Kernel Activity: Unknown'' WHEN 100301 THEN ''Kernel Activity: Create''
      WHEN 100302 THEN ''Kernel Activity: Read'' WHEN 100303 THEN ''Kernel Activity:
      Delete'' WHEN 100304 THEN ''Kernel Activity: Invoke'' WHEN 100399 THEN ''Kernel
      Activity: Other'' END)::VARCHAR'
    type_uid: (100300 + (CASE WHEN EVENT_SIMPLE_NAME IN ('CreateThreadNoStartImage',
      'CreateThreadReflectiveDll','DriverLoad','KextLoad','RawBindIP4','RawBindIP6','PromiscuousBindIP4','VolumeSnapshotCreated')
      THEN 1 WHEN EVENT_SIMPLE_NAME IN ('ProcessSelfDeleted','VolumeSnapshotDeleted','KextUnload')
      THEN 3 WHEN EVENT_SIMPLE_NAME IN ('TokenImpersonated','InjectedThread','InjectedThreadFromUnsignedModule','JavaInjectedThread','DllInjection','ReflectiveDotnetModuleLoad','KernelModeLoadImage','ProcessInjection','LowILModuleLoadAttempt','UnsignedModuleLoad','ASLRBypassAttempt','UserExceptionDEP','EarlyExploitPivotDetect','ProcessExecOnPackedExecutable','ProcessExecOnSMBFile')
      THEN 4 WHEN EVENT_SIMPLE_NAME IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_SIMPLE_NAME IN ('CreateThreadNoStartImage', 'CreateThreadReflectiveDll',
    'InjectedThread', 'InjectedThreadFromUnsignedModule', 'JavaInjectedThread', 'DllInjection',
    'PrivilegedProcessHandle', 'PrivilegedProcessHandleFromUnsignedModule', 'SuspiciousPrivilegedProcessHandle',
    'QueueApcEtw', 'ProcessInjection', 'ProcessHandleOpDetectInfo', 'KernelModeLoadImage',
    'LowILModuleLoadAttempt', 'UnsignedModuleLoad', 'ModuleBlockedEvent', 'ModuleBlockedEventWithPatternId',
    'ModuleDetectInfo', 'ReflectiveDotnetModuleLoad', 'DriverLoad', 'KextLoad', 'KextUnload',
    'FirmwareRegionMeasured', 'FirmwareImageAnalyzed', 'FirmwareAnalysisStatus', 'FirmwareAnalysisErrorEvent',
    'FirmwareAnalysisHardwareData', 'VolumeSnapshotCreated', 'VolumeSnapshotDeleted',
    'ProcessSelfDeleted', 'TokenImpersonated', 'ASLRBypassAttempt', 'UserExceptionDEP',
    'EarlyExploitPivotDetect', 'RawBindIP4', 'RawBindIP6', 'PromiscuousBindIP4', 'ProcessExecOnPackedExecutable',
    'ProcessExecOnSMBFile')
