type: mapping
id: crowdstrike_raw_events_1006_scheduled_job_activity_1.1.0
version: '9'
name: Crowdstrike Raw Events to OCSF class Scheduled Job Activity
data-types:
- crowdstrike-raw-events
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN EVENT_SIMPLE_NAME IS NULL THEN 0 WHEN EVENT_SIMPLE_NAME
      = 'ScheduledTaskRegistered' THEN 1 WHEN EVENT_SIMPLE_NAME = 'ScheduledTaskModified'
      THEN 2 WHEN EVENT_SIMPLE_NAME = 'ScheduledTaskDeleted' THEN 3 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_SIMPLE_NAME IS NULL THEN 0 WHEN EVENT_SIMPLE_NAME
      = 'ScheduledTaskRegistered' THEN 1 WHEN EVENT_SIMPLE_NAME = 'ScheduledTaskModified'
      THEN 2 WHEN EVENT_SIMPLE_NAME = 'ScheduledTaskDeleted' THEN 3 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Update' WHEN 3 THEN
      'Delete' WHEN 4 THEN 'Enable' WHEN 5 THEN 'Disable' WHEN 6 THEN 'Start' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor.process.tid: (RAW:RpcClientThreadId)::NUMBER
    actor.process.uid: (COALESCE(RAW:ContextProcessId, RAW:RpcClientProcessId))::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('scheduled_job_activity')::VARCHAR
    class_uid: ('1006')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.interface_uid: (RAW:InterfaceGuid)::VARCHAR
    device.ip: (COALESCE(AIP, RAW:RemoteAddressIP4, RAW:RemoteAddressIP6))::VARCHAR
    device.org.uid: (CID)::VARCHAR
    device.os.name: (EVENT_PLATFORM)::VARCHAR
    device.type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN
      10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (0)::NUMBER
    device.uid: (AID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    job.cmd_line: (RAW:TaskExecCommand)::VARCHAR
    job.created_time: (date_part('epoch_milliseconds', (REGEXP_SUBSTR(RAW:TaskXml,
      '<Date>(.+)</Date', 1, 1, 'es'))::TIMESTAMP_LTZ))::NUMBER
    job.created_time_dt: (REGEXP_SUBSTR(RAW:TaskXml, '<Date>(.+)</Date', 1, 1, 'es'))::TIMESTAMP_LTZ
    job.desc: (RAW:TaskExecArguments)::VARCHAR
    job.file.name: (TARGET_FILE_NAME)::VARCHAR
    job.file.type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Regular
      File' WHEN 2 THEN 'Folder' WHEN 3 THEN 'Character Device' WHEN 4 THEN 'Block
      Device' WHEN 5 THEN 'Local Socket' WHEN 6 THEN 'Named Pipe' WHEN 7 THEN 'Symbolic
      Link' WHEN 99 THEN 'Other' END)::VARCHAR
    job.file.type_id: (0)::NUMBER
    job.name: (RAW:TaskName)::VARCHAR
    job.user.name: (COALESCE(RAW:UserName, RAW:TaskAuthor))::VARCHAR
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_simple_name)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('crowdstrike-raw-events')::VARCHAR
    metadata.product.vendor_name: ('crowdstrike')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(AIP, RAW:RemoteAddressIP4, RAW:RemoteAddressIP6))::VARCHAR
    - name: '''job.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''job.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (TARGET_FILE_NAME)::VARCHAR
    - name: '''job.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''job.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(RAW:UserName, RAW:TaskAuthor))::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2
      THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (0)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100600 + (CASE WHEN EVENT_SIMPLE_NAME IS NULL THEN 0 WHEN
      EVENT_SIMPLE_NAME = ''ScheduledTaskRegistered'' THEN 1 WHEN EVENT_SIMPLE_NAME
      = ''ScheduledTaskModified'' THEN 2 WHEN EVENT_SIMPLE_NAME = ''ScheduledTaskDeleted''
      THEN 3 ELSE 99 END))::NUMBER) WHEN 100600 THEN ''Scheduled Job Activity: Unknown''
      WHEN 100601 THEN ''Scheduled Job Activity: Create'' WHEN 100602 THEN ''Scheduled
      Job Activity: Update'' WHEN 100603 THEN ''Scheduled Job Activity: Delete'' WHEN
      100604 THEN ''Scheduled Job Activity: Enable'' WHEN 100605 THEN ''Scheduled
      Job Activity: Disable'' WHEN 100606 THEN ''Scheduled Job Activity: Start'' WHEN
      100699 THEN ''Scheduled Job Activity: Other'' END)::VARCHAR'
    type_uid: (100600 + (CASE WHEN EVENT_SIMPLE_NAME IS NULL THEN 0 WHEN EVENT_SIMPLE_NAME
      = 'ScheduledTaskRegistered' THEN 1 WHEN EVENT_SIMPLE_NAME = 'ScheduledTaskModified'
      THEN 2 WHEN EVENT_SIMPLE_NAME = 'ScheduledTaskDeleted' THEN 3 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_SIMPLE_NAME ILIKE '%ScheduledTask%'
