type: mapping
id: cyberark_privileged_access_security_3006_group_management_1.1.0
version: '8'
name: Cyberark Privileged Access Security to OCSF class Group Management
data-types:
- cyberark-privileged-access-security
mapping:
  fields:
    activity_id: (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME ILIKE '%Add%Member%'
      THEN 3 WHEN EVENT_NAME ILIKE '%Delete%Member%' OR EVENT_NAME ILIKE '%Remove%Member%'
      THEN 4 WHEN EVENT_NAME ILIKE '%Delete External Group%' THEN 5 WHEN EVENT_NAME
      = 'Delete Group' THEN 5 WHEN EVENT_NAME ILIKE '%Add External Group%' THEN 6
      ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME ILIKE
      '%Add%Member%' THEN 3 WHEN EVENT_NAME ILIKE '%Delete%Member%' OR EVENT_NAME
      ILIKE '%Remove%Member%' THEN 4 WHEN EVENT_NAME ILIKE '%Delete External Group%'
      THEN 5 WHEN EVENT_NAME = 'Delete Group' THEN 5 WHEN EVENT_NAME ILIKE '%Add External
      Group%' THEN 6 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Assign
      Privileges' WHEN 2 THEN 'Revoke Privileges' WHEN 3 THEN 'Add User' WHEN 4 THEN
      'Remove User' WHEN 5 THEN 'Delete' WHEN 6 THEN 'Create' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('group_management')::VARCHAR
    class_uid: ('3006')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (HOST)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    group.desc: (EVENT_NAME)::VARCHAR
    message: (COALESCE(EXTENSION_FIELDS:act, EXTENSION_FIELDS:msg))::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cyberark-privileged-access-security')::VARCHAR
    metadata.product.vendor_name: ('cyberark')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOST)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (IFF(EXTENSION_FIELDS:suser ILIKE '%@%', EXTENSION_FIELDS:suser, NULL))::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(IFF(EXTENSION_FIELDS:suser NOT ILIKE '%@%', EXTENSION_FIELDS:suser,
        NULL), IFF(EXTENSION_FIELDS:"affected user name" NOT ILIKE '%@%', EXTENSION_FIELDS:"affected
        user name", NULL)))::VARCHAR
    privileges: NULL::ARRAY
    raw_data: NULL::VARCHAR
    resource: NULL::VARIANT
    severity: (CASE ((CASE WHEN SEVERITY IS NULL THEN 0 WHEN SEVERITY BETWEEN 0 AND
      29 THEN 2 WHEN SEVERITY BETWEEN 30 AND 69 THEN 3 WHEN SEVERITY BETWEEN 70 AND
      100 THEN 4 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY IS NULL THEN 0 WHEN SEVERITY BETWEEN 0 AND 29
      THEN 2 WHEN SEVERITY BETWEEN 30 AND 69 THEN 3 WHEN SEVERITY BETWEEN 70 AND 100
      THEN 4 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300600 + (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME
      ILIKE ''%Add%Member%'' THEN 3 WHEN EVENT_NAME ILIKE ''%Delete%Member%'' OR EVENT_NAME
      ILIKE ''%Remove%Member%'' THEN 4 WHEN EVENT_NAME ILIKE ''%Delete External Group%''
      THEN 5 WHEN EVENT_NAME = ''Delete Group'' THEN 5 WHEN EVENT_NAME ILIKE ''%Add
      External Group%'' THEN 6 ELSE 99 END))::NUMBER) WHEN 300600 THEN ''Group Management:
      Unknown'' WHEN 300601 THEN ''Group Management: Assign Privileges'' WHEN 300602
      THEN ''Group Management: Revoke Privileges'' WHEN 300603 THEN ''Group Management:
      Add User'' WHEN 300604 THEN ''Group Management: Remove User'' WHEN 300605 THEN
      ''Group Management: Delete'' WHEN 300606 THEN ''Group Management: Create'' WHEN
      300699 THEN ''Group Management: Other'' END)::VARCHAR'
    type_uid: (300600 + (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME ILIKE
      '%Add%Member%' THEN 3 WHEN EVENT_NAME ILIKE '%Delete%Member%' OR EVENT_NAME
      ILIKE '%Remove%Member%' THEN 4 WHEN EVENT_NAME ILIKE '%Delete External Group%'
      THEN 5 WHEN EVENT_NAME = 'Delete Group' THEN 5 WHEN EVENT_NAME ILIKE '%Add External
      Group%' THEN 6 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (IFF(EXTENSION_FIELDS:suser ILIKE '%@%', EXTENSION_FIELDS:suser,
      NULL))::VARCHAR
    user.name: (COALESCE(IFF(EXTENSION_FIELDS:suser NOT ILIKE '%@%', EXTENSION_FIELDS:suser,
      NULL), IFF(EXTENSION_FIELDS:"affected user name" NOT ILIKE '%@%', EXTENSION_FIELDS:"affected
      user name", NULL)))::VARCHAR
  predicate: EVENT_NAME ILIKE '%group%'
