type: mapping
id: cyberark_privileged_access_security_3001_account_change_1.1.0
version: '9'
name: Cyberark Privileged Access Security to OCSF class Account Change
data-types:
- cyberark-privileged-access-security
mapping:
  fields:
    activity_id: (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME ILIKE '%Add%'
      THEN 1 WHEN EVENT_NAME ILIKE '%Reset User Password%' THEN 4 WHEN EVENT_NAME
      ILIKE ANY ('%Delete%', '%Remove%') THEN 6 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME ILIKE
      '%Add%' THEN 1 WHEN EVENT_NAME ILIKE '%Reset User Password%' THEN 4 WHEN EVENT_NAME
      ILIKE ANY ('%Delete%', '%Remove%') THEN 6 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Create' WHEN 10 THEN 'MFA Factor Enable' WHEN 11 THEN
      'MFA Factor Disable' WHEN 2 THEN 'Enable' WHEN 3 THEN 'Password Change' WHEN
      4 THEN 'Password Reset' WHEN 5 THEN 'Disable' WHEN 6 THEN 'Delete' WHEN 7 THEN
      'Attach Policy' WHEN 8 THEN 'Detach Policy' WHEN 9 THEN 'Lock' WHEN 99 THEN
      'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('account_change')::VARCHAR
    class_uid: ('3001')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (HOST)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: (COALESCE(EXTENSION_FIELDS:act, EXTENSION_FIELDS:msg))::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('cyberark-privileged-access-security')::VARCHAR
    metadata.product.vendor_name: ('cyberark')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOST)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (EXTENSION_FIELDS:shost)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (IFF(EXTENSION_FIELDS:suser ILIKE '%@%', EXTENSION_FIELDS:suser, NULL))::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(IFF(EXTENSION_FIELDS:suser NOT ILIKE '%@%', EXTENSION_FIELDS:suser,
        NULL), IFF(EXTENSION_FIELDS:"affected user name" NOT ILIKE '%@%', EXTENSION_FIELDS:"affected
        user name", NULL)))::VARCHAR
    policy: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((IFF(SEVERITY is NULL, 0, 99))::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN
      'High' WHEN 5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (IFF(SEVERITY is NULL, 0, 99))::NUMBER
    src_endpoint.ip: (EXTENSION_FIELDS:shost)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300100 + (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME
      ILIKE ''%Add%'' THEN 1 WHEN EVENT_NAME ILIKE ''%Reset User Password%'' THEN
      4 WHEN EVENT_NAME ILIKE ANY (''%Delete%'', ''%Remove%'') THEN 6 ELSE 99 END))::NUMBER)
      WHEN 300100 THEN ''Account Change: Unknown'' WHEN 300101 THEN ''Account Change:
      Create'' WHEN 300102 THEN ''Account Change: Enable'' WHEN 300103 THEN ''Account
      Change: Password Change'' WHEN 300104 THEN ''Account Change: Password Reset''
      WHEN 300105 THEN ''Account Change: Disable'' WHEN 300106 THEN ''Account Change:
      Delete'' WHEN 300107 THEN ''Account Change: Attach Policy'' WHEN 300108 THEN
      ''Account Change: Detach Policy'' WHEN 300109 THEN ''Account Change: Lock''
      WHEN 300110 THEN ''Account Change: MFA Factor Enable'' WHEN 300111 THEN ''Account
      Change: MFA Factor Disable'' WHEN 300199 THEN ''Account Change: Other'' END)::VARCHAR'
    type_uid: (300100 + (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME ILIKE
      '%Add%' THEN 1 WHEN EVENT_NAME ILIKE '%Reset User Password%' THEN 4 WHEN EVENT_NAME
      ILIKE ANY ('%Delete%', '%Remove%') THEN 6 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (IFF(EXTENSION_FIELDS:suser ILIKE '%@%', EXTENSION_FIELDS:suser,
      NULL))::VARCHAR
    user.name: (COALESCE(IFF(EXTENSION_FIELDS:suser NOT ILIKE '%@%', EXTENSION_FIELDS:suser,
      NULL), IFF(EXTENSION_FIELDS:"affected user name" NOT ILIKE '%@%', EXTENSION_FIELDS:"affected
      user name", NULL)))::VARCHAR
    user_result: NULL::VARIANT
  predicate: EVENT_NAME ILIKE ANY('%user%', '%owner%')
