type: mapping
id: darktrace_model_breaches_details_4001_network_activity_1.1.0
version: '10'
name: Darktrace Model Breaches Details to OCSF class Network Activity
data-types:
- darktrace-model-breaches-details
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (6)::NUMBER
    activity_name: (CASE ((6)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN
      2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((CASE WHEN DIRECTION = 'out' THEN 2 WHEN DIRECTION
      = 'in' THEN 1 WHEN DIRECTION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral'
      WHEN 99 THEN 'Other' END)::VARCHAR
    connection_info.direction_id: (CASE WHEN DIRECTION = 'out' THEN 2 WHEN DIRECTION
      = 'in' THEN 1 WHEN DIRECTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    connection_info.protocol_name: (CONNECTION_PROTOCOL)::VARCHAR
    connection_info.protocol_num: (CASE WHEN CONNECTION_PROTOCOL = 'TCP' THEN 6 WHEN
      CONNECTION_PROTOCOL = 'IGMP' THEN 2 WHEN CONNECTION_PROTOCOL = 'IPv6-ICMP' THEN
      58 WHEN CONNECTION_PROTOCOL = 'ICMP' THEN 1 WHEN CONNECTION_PROTOCOL = 'UDP'
      THEN 17 ELSE NULL END)::NUMBER
    connection_info.uid: (CONNECTION_UID)::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.domain: (DESTINATION_DEVICE_DOMAIN)::VARCHAR
    dst_endpoint.hostname: (DESTINATION_DEVICE_HOSTNAME)::VARCHAR
    dst_endpoint.ip: (DESTINATION_DEVICE_IP)::VARCHAR
    dst_endpoint.mac: (DESTINATION_DEVICE_MACADDRESS)::VARCHAR
    dst_endpoint.port: (CONNECTION_DESTINATION_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (COALESCE(INFO, RAW:msg))::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('darktrace-model-breaches-details')::VARCHAR
    metadata.product.vendor_name: ('DarkTrace')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DESTINATION_DEVICE_HOSTNAME)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_DEVICE_IP)::VARCHAR
    - name: '''dst_endpoint.mac'''
      type: '''MAC Address'''
      type_id: 3
      reputation: null::VARIANT
      value: (DESTINATION_DEVICE_MACADDRESS)::VARCHAR
    - name: '''proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PROXY)::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SOURCE_DEVICE_HOSTNAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_DEVICE_IP)::VARCHAR
    - name: '''src_endpoint.mac'''
      type: '''MAC Address'''
      type_id: 3
      reputation: null::VARIANT
      value: (SOURCE_DEVICE_MACADDRESS)::VARCHAR
    - name: '''url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint.ip: (PROXY)::VARCHAR
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.domain: (SOURCE_DEVICE_DOMAIN)::VARCHAR
    src_endpoint.hostname: (SOURCE_DEVICE_HOSTNAME)::VARCHAR
    src_endpoint.ip: (SOURCE_DEVICE_IP)::VARCHAR
    src_endpoint.mac: (SOURCE_DEVICE_MACADDRESS)::VARCHAR
    src_endpoint.port: (CONNECTION_SOURCE_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN CONNECTION_STATUS = 'failed' THEN 2 WHEN CONNECTION_STATUS
      = 'success' THEN 1 WHEN CONNECTION_STATUS IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN CONNECTION_STATUS = 'failed' THEN 2 WHEN CONNECTION_STATUS
      = 'success' THEN 1 WHEN CONNECTION_STATUS IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400106)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown''
      WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400106)::NUMBER
    unmapped: NULL::VARIANT
    url.scheme: (CONNECTION_APPLICATION_PROTOCOL)::VARCHAR
  predicate: EVENT_TYPE in ('connection', 'notice', 'maths')
