type: mapping
id: darktrace_model_breaches_v2_2004_detection_finding_1.1.0
version: '1'
name: Darktrace Model Breaches V2 to OCSF class Detection Finding
data-types:
- darktrace-model-breaches-v2
mapping:
  fields:
    action: (CASE ('99') WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied'
      WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: ('99')::NUMBER
    activity_id: ('1')::NUMBER
    activity_name: (CASE ('1') WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN
      'Update' WHEN 3 THEN 'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    attacks: (mitre_techniques)::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ('2') WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: ('2')::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud: NULL::VARIANT
    comment: NULL::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: NULL::NUMBER
    confidence_score: (percent_score)::NUMBER
    count: NULL::NUMBER
    device.first_seen_time: (date_part('epoch_milliseconds', device_firstseen::TIMESTAMP_LTZ))::NUMBER
    device.first_seen_time_dt: (device_firstseen)::TIMESTAMP_LTZ
    device.ip: (device_ip)::VARCHAR
    device.last_seen_time: (date_part('epoch_milliseconds', device_lastseen::TIMESTAMP_LTZ))::NUMBER
    device.last_seen_time_dt: (device_lastseen)::TIMESTAMP_LTZ
    device.name: (device_devicelabel)::VARCHAR
    device.type: (CASE ('0') WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN 10 THEN
      'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop' WHEN
      4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN 'IOT'
      WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: ('0')::NUMBER
    device.uid: (device_did)::VARCHAR
    device.vlan_uid: (device_vlan)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: NULL::ARRAY
    finding_info.analytic.category: (model_category)::VARCHAR
    finding_info.analytic.name: (model_name)::VARCHAR
    finding_info.analytic.uid: (model_uuid)::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('darktrace-model-breaches-v2')::VARCHAR
    metadata.product.url_string: (breach_url)::VARCHAR
    metadata.product.vendor_name: ('DarkTrace')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (device_ip)::VARCHAR
    - name: '''metadata.product.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (breach_url)::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: NULL::ARRAY
    risk_level: NULL::VARCHAR
    risk_level_id: NULL::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE ('0') WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN 2
      THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical' WHEN
      6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: ('0')::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', creation_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (creation_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (''200401'') WHEN 200400 THEN ''Detection Finding: Unknown''
      WHEN 200401 THEN ''Detection Finding: Create'' WHEN 200402 THEN ''Detection
      Finding: Update'' WHEN 200403 THEN ''Detection Finding: Close'' WHEN 200499
      THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: ('200401')::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
