type: mapping
id: databricks_events_3002_authentication_1.1.0
version: '4'
name: Databricks Events to OCSF class Authentication
data-types:
- databricks-events
mapping:
  fields:
    activity_id: (CASE WHEN ACTION_NAME IS NULL THEN 0 WHEN ACTION_NAME ILIKE '%login%'
      THEN 1 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION_NAME IS NULL THEN 0 WHEN ACTION_NAME ILIKE
      '%login%' THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon'
      WHEN 2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket' WHEN 4 THEN 'Service
      Ticket Request' WHEN 5 THEN 'Service Ticket Renew' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api.request.data: (REQUEST_PARAMS)::VARIANT
    api.request.uid: (REQUEST_ID)::VARCHAR
    api.response.code: (RESPONSE_STATUS_CODE)::NUMBER
    api.response.error_message: (RESPONSE_ERROR_MESSAGE)::VARCHAR
    auth_protocol: (CASE ((CASE WHEN ACTION_NAME ILIKE '%oidc%' THEN 4 WHEN ACTION_NAME
      ILIKE '%saml%' THEN 5 WHEN ACTION_NAME ILIKE '%oauth%' THEN 6 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'NTLM' WHEN 10 THEN 'RADIUS' WHEN 2 THEN 'Kerberos'
      WHEN 3 THEN 'Digest' WHEN 4 THEN 'OpenID' WHEN 5 THEN 'SAML' WHEN 6 THEN 'OAUTH
      2.0' WHEN 7 THEN 'PAP' WHEN 8 THEN 'CHAP' WHEN 9 THEN 'EAP' WHEN 99 THEN 'Other'
      END)::VARCHAR
    auth_protocol_id: (CASE WHEN ACTION_NAME ILIKE '%oidc%' THEN 4 WHEN ACTION_NAME
      ILIKE '%saml%' THEN 5 WHEN ACTION_NAME ILIKE '%oauth%' THEN 6 ELSE 99 END)::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.user_agent: (USER_AGENT)::VARCHAR
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('databricks-events')::VARCHAR
    metadata.product.vendor_name: ('databricks')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SPLIT_PART(SOURCE_IP_ADDRESS, ':', 1))::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (IFF(USER_IDENTITY_EMAIL ILIKE '%@%', USER_IDENTITY_EMAIL, NULL))::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session.uid: (SESSION_ID)::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (SPLIT_PART(SOURCE_IP_ADDRESS, ':', 1))::VARCHAR
    src_endpoint.port: (SPLIT_PART(SOURCE_IP_ADDRESS, ':', 2))::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RESPONSE_STATUS_CODE IS NULL THEN 0 WHEN RESPONSE_STATUS_CODE
      = 200 THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success'
      WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: (RESPONSE_STATUS_CODE)::VARCHAR
    status_detail: (RESPONSE_ERROR_MESSAGE)::VARCHAR
    status_id: (CASE WHEN RESPONSE_STATUS_CODE IS NULL THEN 0 WHEN RESPONSE_STATUS_CODE
      = 200 THEN 1 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN ACTION_NAME IS NULL THEN 300200 WHEN ACTION_NAME
      ILIKE ''%login%'' THEN 300201 ELSE 300299 END)::NUMBER) WHEN 300200 THEN ''Authentication:
      Unknown'' WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN ACTION_NAME IS NULL THEN 300200 WHEN ACTION_NAME ILIKE '%login%'
      THEN 300201 ELSE 300299 END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (IFF(USER_IDENTITY_EMAIL ILIKE '%@%', USER_IDENTITY_EMAIL, NULL))::VARCHAR
    user.uid: (IFF(USER_IDENTITY_EMAIL NOT ILIKE '%@%', USER_IDENTITY_EMAIL, NULL))::VARCHAR
  predicate: ACTION_NAME ILIKE ANY ('%login%', '%authentication%')
