type: mapping
id: duo_authentication_logs_3002_authentication_1.1.0
version: '11'
name: Duo Authentication Logs to OCSF class Authentication
data-types:
- duo-authentication-logs
mapping:
  fields:
    activity_id: (CASE WHEN RESULT IS NULL THEN 0 WHEN RESULT = 'success' THEN 1 WHEN
      RESULT = 'denied' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN RESULT IS NULL THEN 0 WHEN RESULT = 'success'
      THEN 1 WHEN RESULT = 'denied' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Logon' WHEN 2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket'
      WHEN 4 THEN 'Service Ticket Request' WHEN 5 THEN 'Service Ticket Renew' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: NULL::VARCHAR
    auth_protocol_id: NULL::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (ACCESS_DEVICE_HOSTNAME)::VARCHAR
    device.ip: (ACCESS_DEVICE_IP)::VARCHAR
    device.location.city: (AUTH_DEVICE_LOCATION:city)::VARCHAR
    device.location.country: (AUTH_DEVICE_LOCATION:country)::VARCHAR
    device.os.name: (ACCESS_DEVICE_OS)::VARCHAR
    device.os.version: (CONCAT(ACCESS_DEVICE_OS, ' ', RAW:access_device:os_version))::VARCHAR
    device.type: (CASE ((CASE WHEN ACCESS_DEVICE_BROWSER IS NULL THEN 0 ELSE 8 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN 10 THEN 'Switch' WHEN 11 THEN
      'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop' WHEN 4 THEN 'Tablet' WHEN 5
      THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN 'IOT' WHEN 8 THEN 'Browser'
      WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN ACCESS_DEVICE_BROWSER IS NULL THEN 0 ELSE 8 END)::NUMBER
    device.uid: (ACCESS_DEVICE_EPKEY)::VARCHAR
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: (IFF(FACTOR IS NULL OR FACTOR = 'not_available', false, true))::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('duo-authentication-logs')::VARCHAR
    metadata.product.vendor_name: ('duo')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (ACCESS_DEVICE_HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (ACCESS_DEVICE_IP)::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOST)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (EMAIL)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    service.name: (APPLICATION_NAME)::VARCHAR
    service.uid: (APPLICATION_KEY)::VARCHAR
    session: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.hostname: (HOST)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RESULT IS NULL THEN 0 WHEN RESULT = 'success' THEN 1
      WHEN RESULT = 'denied' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (REASON)::VARCHAR
    status_id: (CASE WHEN RESULT IS NULL THEN 0 WHEN RESULT = 'success' THEN 1 WHEN
      RESULT = 'denied' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300200 + (CASE WHEN RESULT IS NULL THEN 0 WHEN RESULT = ''success''
      THEN 1 WHEN RESULT = ''denied'' THEN 2 ELSE 99 END))::NUMBER) WHEN 300200 THEN
      ''Authentication: Unknown'' WHEN 300201 THEN ''Authentication: Logon'' WHEN
      300202 THEN ''Authentication: Logoff'' WHEN 300203 THEN ''Authentication: Authentication
      Ticket'' WHEN 300204 THEN ''Authentication: Service Ticket Request'' WHEN 300205
      THEN ''Authentication: Service Ticket Renew'' WHEN 300299 THEN ''Authentication:
      Other'' END)::VARCHAR'
    type_uid: (300200 + (CASE WHEN RESULT IS NULL THEN 0 WHEN RESULT = 'success' THEN
      1 WHEN RESULT = 'denied' THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (EMAIL)::VARCHAR
    user.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('name', USER_GROUPS[0])))::ARRAY
    user.name: (USER_NAME)::VARCHAR
    user.uid: (USER_KEY)::VARCHAR
  predicate: EVENT_TYPE = 'authentication'
