type: mapping
id: duo_administrator_logs_3006_group_management_1.1.0
version: '7'
name: Duo Administrator Logs to OCSF class Group Management
data-types:
- duo-administrator-logs
mapping:
  fields:
    activity_id: (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%policy%add%'
      THEN 1 WHEN ACTION ILIKE '%policy%remove%' THEN 2 WHEN ACTION ILIKE '%delete%'
      THEN 5 WHEN ACTION ILIKE '%create%' THEN 6 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%policy%add%'
      THEN 1 WHEN ACTION ILIKE '%policy%remove%' THEN 2 WHEN ACTION ILIKE '%delete%'
      THEN 5 WHEN ACTION ILIKE '%create%' THEN 6 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Assign Privileges' WHEN 2 THEN 'Revoke Privileges' WHEN
      3 THEN 'Add User' WHEN 4 THEN 'Remove User' WHEN 5 THEN 'Delete' WHEN 6 THEN
      'Create' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('group_management')::VARCHAR
    class_uid: ('3006')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.ip: (DESCRIPTION_IP_ADDRESS)::VARCHAR
    device.name: (DESCRIPTION_DEVICE)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    group.desc: (DESCRIPTION:desc)::VARCHAR
    group.name: (IFF(TYPEOF(DESCRIPTION:groups) = 'ARRAY', DESCRIPTION:groups[0],
      DESCRIPTION:groups))::VARCHAR
    message: NULL::VARCHAR
    metadata.event_code: (action)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('duo-administrator-logs')::VARCHAR
    metadata.product.vendor_name: ('duo')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESCRIPTION_IP_ADDRESS)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (DESCRIPTION:admin_email)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USERNAME)::VARCHAR
    privileges: NULL::ARRAY
    raw_data: NULL::VARCHAR
    resource: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN ACTION IS NULL THEN 300600 WHEN ACTION ILIKE ''%policy%add%''
      THEN 300601 WHEN ACTION ILIKE ''%policy%remove%'' THEN 300602 WHEN ACTION ILIKE
      ''%delete%'' THEN 300605 WHEN ACTION ILIKE ''%create%'' THEN 300606 ELSE 300699
      END)::NUMBER) WHEN 300600 THEN ''Group Management: Unknown'' WHEN 300601 THEN
      ''Group Management: Assign Privileges'' WHEN 300602 THEN ''Group Management:
      Revoke Privileges'' WHEN 300603 THEN ''Group Management: Add User'' WHEN 300604
      THEN ''Group Management: Remove User'' WHEN 300605 THEN ''Group Management:
      Delete'' WHEN 300606 THEN ''Group Management: Create'' WHEN 300699 THEN ''Group
      Management: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN ACTION IS NULL THEN 300600 WHEN ACTION ILIKE '%policy%add%'
      THEN 300601 WHEN ACTION ILIKE '%policy%remove%' THEN 300602 WHEN ACTION ILIKE
      '%delete%' THEN 300605 WHEN ACTION ILIKE '%create%' THEN 300606 ELSE 300699
      END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (DESCRIPTION:admin_email)::VARCHAR
    user.name: (USERNAME)::VARCHAR
  predicate: ACTION ILIKE '%group%'
