type: mapping
id: gcp_audit_4001_network_activity_1.1.0
version: '11'
name: Gcp Audit to OCSF class Network Activity
data-types:
- gcp-audit
mapping:
  fields:
    action: (CASE ((CASE WHEN RAW:jsonPayload:rule_details:action IS NULL THEN 0 WHEN
      RAW:jsonPayload:rule_details:action = 'ALLOW' THEN 1 WHEN RAW:jsonPayload:rule_details:action
      = 'DENY' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed'
      WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN RAW:jsonPayload:rule_details:action IS NULL THEN 0 WHEN
      RAW:jsonPayload:rule_details:action = 'ALLOW' THEN 1 WHEN RAW:jsonPayload:rule_details:action
      = 'DENY' THEN 2 ELSE 99 END)::NUMBER
    activity_id: (6)::NUMBER
    activity_name: (CASE ((6)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN
      2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.project_uid: (PROJECT_ID)::VARCHAR
    cloud.provider: ('GCP')::VARCHAR
    cloud.zone: (RESOURCE_LABELS:location)::VARCHAR
    connection_info.direction: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.direction_id: (1)::NUMBER
    connection_info.protocol_name: (CASE RAW:jsonPayload:connection:protocol WHEN
      1 THEN 'icmp' WHEN 6 THEN 'tcp' WHEN 17 THEN 'udp' WHEN 58 THEN 'ipv6-icmp'
      ELSE NULL END)::VARCHAR
    connection_info.protocol_num: (RAW:jsonPayload:connection:protocol)::NUMBER
    connection_info.protocol_ver: (CASE ((PARSE_IP(COALESCE(CALLER_IP, RAW:jsonPayload:connection:src_ip),
      'INET', 1):family)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 4 THEN 'Internet Protocol
      version 4 (IPv4)' WHEN 6 THEN 'Internet Protocol version 6 (IPv6)' WHEN 99 THEN
      'Other' END)::VARCHAR
    connection_info.protocol_ver_id: (PARSE_IP(COALESCE(CALLER_IP, RAW:jsonPayload:connection:src_ip),
      'INET', 1):family)::NUMBER
    count: NULL::NUMBER
    device.instance_uid: (RAW:jsonPayload:instance:vm_name)::VARCHAR
    device.location.city: (RAW:jsonPayload:remote_location:city)::VARCHAR
    device.location.continent: (RAW:jsonPayload:remote_location:continent)::VARCHAR
    device.location.country: (RAW:jsonPayload:remote_location:country)::VARCHAR
    device.location.region: (RAW:jsonPayload:remote_location:region)::VARCHAR
    device.subnet_uid: (RESOURCE_LABELS:subnetwork_id)::VARCHAR
    device.vpc_uid: (RAW:jsonPayload:vpc:vpc_name)::VARCHAR
    device.zone: (RAW:jsonPayload:instance:zone)::VARCHAR
    disposition: (CASE ((CASE WHEN RAW:jsonPayload:disposition IS NULL THEN 0 WHEN
      RAW:jsonPayload:disposition = 'ALLOWED' THEN 1 WHEN RAW:jsonPayload:disposition
      = 'DENIED' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed'
      WHEN 10 THEN 'Exonerated' WHEN 11 THEN 'Corrected' WHEN 12 THEN 'Partially Corrected'
      WHEN 13 THEN 'Uncorrected' WHEN 14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN
      16 THEN 'No Action' WHEN 17 THEN 'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN
      'Alert' WHEN 2 THEN 'Blocked' WHEN 20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN
      22 THEN 'Captcha' WHEN 23 THEN 'Challenge' WHEN 24 THEN 'Access Revoked' WHEN
      25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized' WHEN 27 THEN 'Error' WHEN 3 THEN
      'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5 THEN 'Deleted' WHEN 6 THEN 'Dropped'
      WHEN 7 THEN 'Custom Action' WHEN 8 THEN 'Approved' WHEN 9 THEN 'Restored' WHEN
      99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN RAW:jsonPayload:disposition IS NULL THEN 0 WHEN RAW:jsonPayload:disposition
      = 'ALLOWED' THEN 1 WHEN RAW:jsonPayload:disposition = 'DENIED' THEN 2 ELSE 99
      END)::NUMBER
    dst_endpoint.instance_uid: (RAW:jsonPayload:dest_instance:vm_name)::VARCHAR
    dst_endpoint.ip: (RAW:jsonPayload:connection:dest_ip)::VARCHAR
    dst_endpoint.location.city: (RAW:jsonPayload:dest_location:city)::VARCHAR
    dst_endpoint.location.continent: (RAW:jsonPayload:dest_location:continent)::VARCHAR
    dst_endpoint.location.country: (RAW:jsonPayload:dest_location:country)::VARCHAR
    dst_endpoint.location.region: (RAW:jsonPayload:dest_location:region)::VARCHAR
    dst_endpoint.port: (RAW:jsonPayload:connection:dest_port)::NUMBER
    dst_endpoint.svc_name: (RAW:jsonPayload:dest_gke_details:service[0]:service_name)::VARCHAR
    dst_endpoint.vpc_uid: (RAW:jsonPayload:dest_vpc:vpc_name)::VARCHAR
    dst_endpoint.zone: (RAW:jsonPayload:dest_instance:zone)::VARCHAR
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (RAW:jsonPayload:end_time)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (RAW:jsonPayload:end_time)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('gcp-audit')::VARCHAR
    metadata.product.vendor_name: ('gcp')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RAW:jsonPayload:connection:dest_ip)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(CALLER_IP, RAW:jsonPayload:connection:src_ip))::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.instance_uid: (RAW:jsonPayload:src_instance:vm_name)::VARCHAR
    src_endpoint.ip: (COALESCE(CALLER_IP, RAW:jsonPayload:connection:src_ip))::VARCHAR
    src_endpoint.location.city: (RAW:jsonPayload:src_location:city)::VARCHAR
    src_endpoint.location.continent: (RAW:jsonPayload:src_location:continent)::VARCHAR
    src_endpoint.location.country: (RAW:jsonPayload:src_location:country)::VARCHAR
    src_endpoint.location.region: (RAW:jsonPayload:src_location:region)::VARCHAR
    src_endpoint.port: (RAW:jsonPayload:connection:src_port)::NUMBER
    src_endpoint.svc_name: (RAW:jsonPayload:src_gke_details:service[0]:service_name)::VARCHAR
    src_endpoint.vpc_uid: (RAW:jsonPayload:src_vpc:vpc_name)::VARCHAR
    src_endpoint.zone: (RAW:jsonPayload:src_instance:zone)::VARCHAR
    start_time: (date_part('epoch_milliseconds', (RAW:jsonPayload:start_time)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (RAW:jsonPayload:start_time)::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes_out: (RAW:jsonPayload:bytes_sent)::NUMBER
    traffic.packets_out: (RAW:jsonPayload:packets_sent)::NUMBER
    type_name: '(CASE ((400106)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown''
      WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400106)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
  predicate: LOG_TYPE IN ('firewall' , 'vpc_flows')
