type: mapping
id: github_audit_logs_6003_api_activity_1.1.0
version: '9'
name: Github Audit Logs to OCSF class Api Activity
data-types:
- github-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN RAW:request_method IS NULL THEN 0 WHEN RAW:request_method
      = 'POST' THEN 1 WHEN RAW:request_method IN ('GET', 'HEAD')  THEN 2 WHEN RAW:request_method
      IN ('PUT', 'PATCH') THEN 3 WHEN RAW:request_method = 'DELETE' THEN 4 ELSE 99
      END)::NUMBER
    activity_name: (CASE ((CASE WHEN RAW:request_method IS NULL THEN 0 WHEN RAW:request_method
      = 'POST' THEN 1 WHEN RAW:request_method IN ('GET', 'HEAD')  THEN 2 WHEN RAW:request_method
      IN ('PUT', 'PATCH') THEN 3 WHEN RAW:request_method = 'DELETE' THEN 4 ELSE 99
      END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Read'
      WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.session.credential_uid: (RAW:token_id)::VARCHAR
    actor.user.credential_uid: (RAW:oauth_application_id )::VARCHAR
    actor.user.email_addr: (COALESCE(RAW:external_identity_nameid, RAW:external_identity_username))::VARCHAR
    actor.user.name: (COALESCE(ACTOR, USER, RAW:USER_PROGRAMMATIC_ACCESS_NAME))::VARCHAR
    actor.user.org.name: (ORGANIZATION)::VARCHAR
    actor.user.org.uid: (RAW:org_id)::VARCHAR
    actor.user.type: (CASE ((CASE WHEN RAW:actor_is_bot IS NULL THEN 0 WHEN RAW:actor_is_bot
      = 'true' THEN 3 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User'
      WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (CASE WHEN RAW:actor_is_bot IS NULL THEN 0 WHEN RAW:actor_is_bot
      = 'true' THEN 3 ELSE 99 END)::NUMBER
    actor.user.uid: (COALESCE(RAW:actor_id, RAW:user_id))::VARCHAR
    api.operation: (COALESCE(RAW:request_method, RAW:operation_type))::VARCHAR
    api.request.data: (RAW:request_body)::VARIANT
    api.service.name: (COALESCE(RAW:integration, RAW:application_name))::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.url.path: (RAW:url_path)::VARCHAR
    http_request.url.query_string: (RAW:query_string)::VARCHAR
    http_request.user_agent: (RAW:user_agent)::VARCHAR
    message: NULL::VARCHAR
    metadata.event_code: (action)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('github-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('github')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (COALESCE(RAW:external_identity_nameid, RAW:external_identity_username))::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(ACTOR, USER, RAW:USER_PROGRAMMATIC_ACCESS_NAME))::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RAW:actor_ip)::VARCHAR
    raw_data: NULL::VARCHAR
    resources: NULL::ARRAY
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (RAW:actor_ip)::VARCHAR
    src_endpoint.location.country: (RAW:actor_location:country_code)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RAW:status_code IS NULL THEN 0 WHEN RAW:status_code
      ILIKE '2%%' THEN 1 WHEN RAW:status_code ILIKE '4%%' THEN 2 WHEN RAW:status_code
      ILIKE '5%%' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success'
      WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: (RAW:status_code)::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN RAW:status_code IS NULL THEN 0 WHEN RAW:status_code ILIKE
      '2%%' THEN 1 WHEN RAW:status_code ILIKE '4%%' THEN 2 WHEN RAW:status_code ILIKE
      '5%%' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((600300 + (CASE WHEN RAW:request_method IS NULL THEN 0 WHEN
      RAW:request_method = ''POST'' THEN 1 WHEN RAW:request_method IN (''GET'', ''HEAD'')  THEN
      2 WHEN RAW:request_method IN (''PUT'', ''PATCH'') THEN 3 WHEN RAW:request_method
      = ''DELETE'' THEN 4 ELSE 99 END))::NUMBER) WHEN 600300 THEN ''API Activity:
      Unknown'' WHEN 600301 THEN ''API Activity: Create'' WHEN 600302 THEN ''API Activity:
      Read'' WHEN 600303 THEN ''API Activity: Update'' WHEN 600304 THEN ''API Activity:
      Delete'' WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (600300 + (CASE WHEN RAW:request_method IS NULL THEN 0 WHEN RAW:request_method
      = 'POST' THEN 1 WHEN RAW:request_method IN ('GET', 'HEAD')  THEN 2 WHEN RAW:request_method
      IN ('PUT', 'PATCH') THEN 3 WHEN RAW:request_method = 'DELETE' THEN 4 ELSE 99
      END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: ACTION = 'api.request'
