type: mapping
id: gitlab_audit_logs_3002_authentication_1.1.0
version: '1'
name: Gitlab Audit Logs to OCSF class Authentication
data-types:
- gitlab-audit-logs
mapping:
  fields:
    activity_id: (1)::NUMBER
    activity_name: (CASE (1::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN
      2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket' WHEN 4 THEN 'Service Ticket
      Request' WHEN 5 THEN 'Service Ticket Renew' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: (CASE (CASE WHEN EVENT_NAME='authenticated_with_group_saml' THEN
      5 WHEN EVENT_NAME='authenticated_with_oauth' THEN 6 WHEN EVENT_NAME='authenticated_with_oauth'
      THEN 6 WHEN EVENT_NAME IS NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'NTLM' WHEN 10 THEN 'RADIUS' WHEN 2 THEN 'Kerberos' WHEN 3 THEN
      'Digest' WHEN 4 THEN 'OpenID' WHEN 5 THEN 'SAML' WHEN 6 THEN 'OAUTH 2.0' WHEN
      7 THEN 'PAP' WHEN 8 THEN 'CHAP' WHEN 9 THEN 'EAP' WHEN 99 THEN 'Other' END)::VARCHAR
    auth_protocol_id: (CASE WHEN EVENT_NAME='authenticated_with_group_saml' THEN 5
      WHEN EVENT_NAME='authenticated_with_oauth' THEN 6 WHEN EVENT_NAME='authenticated_with_oauth'
      THEN 6 WHEN EVENT_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER
    category_name: (CASE (3::NUMBER) WHEN 3 THEN 'Identity & Access Management' END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud.provider: ('Gitlab')::VARCHAR
    count: NULL::NUMBER
    device.ip: (IP_ADDRESS)::VARCHAR
    device.type: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN
      10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (0)::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: (CUSTOM_MESSAGE)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('gitlab-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('gitlab')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IP_ADDRESS)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (AUTHOR_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session: NULL::VARIANT
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint: NULL::VARIANT
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN EVENT_NAME IN ('authenticated_with_ldap', 'authenticated_with_oauth',
      'authenticated_with_password', 'authenticated_with_two_factor', 'authenticated_with_webauthn',
      'authenticated_with_group_saml', 'user_authenticated_using_job_token', 'api_request_access_with_scope')
      THEN 1 WHEN EVENT_NAME IN ('login_failed_with_otp_authentication', 'login_failed_with_standard_authentication',
      'login_failed_with_webauthn_authentication', 'omniauth_login_failed') THEN 2
      WHEN EVENT_NAME IS NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (EVENT_NAME)::VARCHAR
    status_id: (CASE WHEN EVENT_NAME IN ('authenticated_with_ldap', 'authenticated_with_oauth',
      'authenticated_with_password', 'authenticated_with_two_factor', 'authenticated_with_webauthn',
      'authenticated_with_group_saml', 'user_authenticated_using_job_token', 'api_request_access_with_scope')
      THEN 1 WHEN EVENT_NAME IN ('login_failed_with_otp_authentication', 'login_failed_with_standard_authentication',
      'login_failed_with_webauthn_authentication', 'omniauth_login_failed') THEN 2
      WHEN EVENT_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', created_at::TIMESTAMP_LTZ))::NUMBER
    time_dt: (created_at)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (300201::NUMBER) WHEN 300200 THEN ''Authentication: Unknown''
      WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (300201)::NUMBER
    unmapped: NULL::VARIANT
    user.name: (AUTHOR_NAME)::VARCHAR
    user.type: (CASE (CASE WHEN AUTHOR_CLASS='User' THEN 1 WHEN AUTHOR_CLASS IS NULL
      THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2
      THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN AUTHOR_CLASS='User' THEN 1 WHEN AUTHOR_CLASS IS NULL
      THEN 0 ELSE 99 END)::NUMBER
    user.uid: (AUTHOR_ID)::VARCHAR
  predicate: EVENT_NAME IN ('api_request_access_with_scope', 'omniauth_login_failed',
    'smartcard_authentication_created', 'user_authenticated_using_job_token', 'login_failed_with_otp_authentication',
    'login_failed_with_standard_authentication', 'login_failed_with_webauthn_authentication',
    'authenticated_with_ldap', 'authenticated_with_oauth', 'authenticated_with_password',
    'authenticated_with_two_factor', 'authenticated_with_webauthn', 'authenticated_with_group_saml')
