type: mapping
id: gitlab_audit_logs_6003_api_activity_1.1.0
version: '9'
name: Gitlab Audit Logs to OCSF class Api Activity
data-types:
- gitlab-audit-logs
mapping:
  fields:
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create'
      WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.user.name: (AUTHOR_NAME)::VARCHAR
    actor.user.type: (CASE ((CASE WHEN AUTHOR_CLASS = 'User' THEN 1 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (CASE WHEN AUTHOR_CLASS = 'User' THEN 1 ELSE 99 END)::NUMBER
    actor.user.uid: (AUTHOR_ID)::VARCHAR
    api.operation: (EVENT_NAME)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (EXPIRE_AT)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (EXPIRE_AT)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.url.path: (ENTITY_PATH)::VARCHAR
    message: (CUSTOM_MESSAGE)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('gitlab-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('gitlab')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (AUTHOR_NAME)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IP_ADDRESS)::VARCHAR
    raw_data: NULL::VARCHAR
    resources: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('uid', TARGET_ID, 'type',
      TARGET_TYPE, 'name', TARGET_DETAILS)))::ARRAY
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (IP_ADDRESS)::VARCHAR
    start_time: (date_part('epoch_milliseconds', (CREATED_AT)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (CREATED_AT)::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', created_at::TIMESTAMP_LTZ))::NUMBER
    time_dt: (created_at)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((600300)::NUMBER) WHEN 600300 THEN ''API Activity: Unknown''
      WHEN 600301 THEN ''API Activity: Create'' WHEN 600302 THEN ''API Activity: Read''
      WHEN 600303 THEN ''API Activity: Update'' WHEN 600304 THEN ''API Activity: Delete''
      WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (600300)::NUMBER
    unmapped: NULL::VARIANT
