type: mapping
id: gsuite_activity_3002_authentication_1.1.0
version: '10'
name: Gsuite Activity to OCSF class Authentication
data-types:
- gsuite-activity
mapping:
  fields:
    activity_id: (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME = 'login_success'
      THEN 1 WHEN EVENT_NAME = 'login_failure' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME = 'login_success'
      THEN 1 WHEN EVENT_NAME = 'login_failure' THEN 2 ELSE 99 END)::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN 2 THEN 'Logoff' WHEN 3 THEN 'Authentication
      Ticket' WHEN 4 THEN 'Service Ticket Request' WHEN 5 THEN 'Service Ticket Renew'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: (CASE ((CASE WHEN EVENT_PARAMETERS:login_type IS NULL THEN 0 WHEN
      EVENT_PARAMETERS:login_type = 'saml' THEN 5 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'NTLM' WHEN 10 THEN 'RADIUS' WHEN 2 THEN 'Kerberos' WHEN
      3 THEN 'Digest' WHEN 4 THEN 'OpenID' WHEN 5 THEN 'SAML' WHEN 6 THEN 'OAUTH 2.0'
      WHEN 7 THEN 'PAP' WHEN 8 THEN 'CHAP' WHEN 9 THEN 'EAP' WHEN 99 THEN 'Other'
      END)::VARCHAR
    auth_protocol_id: (CASE WHEN EVENT_PARAMETERS:login_type IS NULL THEN 0 WHEN EVENT_PARAMETERS:login_type
      = 'saml' THEN 5 ELSE 99 END)::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud.account.uid: (ID_CUSTOMER_ID)::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: NULL::VARCHAR
    metadata.event_code: (id_application_name)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('gsuite-activity')::VARCHAR
    metadata.product.vendor_name: ('gsuite')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IP_ADDRESS)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (ACTOR_EMAIL)::VARCHAR
    raw_data: NULL::VARCHAR
    service.name: (ID_APPLICATION_NAME)::VARCHAR
    session: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (IP_ADDRESS)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME = 'login_success'
      THEN 1 WHEN EVENT_NAME = 'login_failure' THEN 2 ELSE 99 END)::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other'
      END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME = 'login_success'
      THEN 1 WHEN EVENT_NAME = 'login_failure' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', id_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (id_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300200 + (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME
      = ''login_success'' THEN 1 WHEN EVENT_NAME = ''login_failure'' THEN 2 ELSE 99
      END))::NUMBER) WHEN 300200 THEN ''Authentication: Unknown'' WHEN 300201 THEN
      ''Authentication: Logon'' WHEN 300202 THEN ''Authentication: Logoff'' WHEN 300203
      THEN ''Authentication: Authentication Ticket'' WHEN 300204 THEN ''Authentication:
      Service Ticket Request'' WHEN 300205 THEN ''Authentication: Service Ticket Renew''
      WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (300200 + (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME = 'login_success'
      THEN 1 WHEN EVENT_NAME = 'login_failure' THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.domain: (OWNER_DOMAIN)::VARCHAR
    user.email_addr: (ACTOR_EMAIL)::VARCHAR
    user.type: (CASE ((CASE WHEN ACTOR_CALLER_TYPE IS NULL THEN 0 WHEN ACTOR_CALLER_TYPE
      = 'USER' THEN 1 WHEN ACTOR_CALLER_TYPE = 'EXTERNAL_USER' THEN 1 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System'
      WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN ACTOR_CALLER_TYPE IS NULL THEN 0 WHEN ACTOR_CALLER_TYPE
      = 'USER' THEN 1 WHEN ACTOR_CALLER_TYPE = 'EXTERNAL_USER' THEN 1 ELSE 99 END)::NUMBER
    user.uid: (ACTOR_PROFILE_ID)::VARCHAR
  predicate: ID_APPLICATION_NAME = 'login' AND EVENT_NAME IN ('login_success', 'login_failure')
