type: mapping
id: hpe_aruba_clearpass_alerts_3002_authentication_1.1.0
version: '2'
name: Hpe Aruba Clearpass Alerts to OCSF class Authentication
data-types:
- hpe-aruba-clearpass-alerts
mapping:
  fields:
    activity_id: (1)::NUMBER
    activity_name: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN
      2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket' WHEN 4 THEN 'Service Ticket
      Request' WHEN 5 THEN 'Service Ticket Renew' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: (CASE ((CASE WHEN RAW:Authentication_Protocol IS NULL THEN 0 WHEN
      RAW:Authentication_Protocol='RADIUS' THEN 10 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'NTLM' WHEN 10 THEN 'RADIUS' WHEN 2 THEN 'Kerberos' WHEN
      3 THEN 'Digest' WHEN 4 THEN 'OpenID' WHEN 5 THEN 'SAML' WHEN 6 THEN 'OAUTH 2.0'
      WHEN 7 THEN 'PAP' WHEN 8 THEN 'CHAP' WHEN 9 THEN 'EAP' WHEN 99 THEN 'Other'
      END)::VARCHAR
    auth_protocol_id: (CASE WHEN RAW:Authentication_Protocol IS NULL THEN 0 WHEN RAW:Authentication_Protocol='RADIUS'
      THEN 10 ELSE 99 END)::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (HOSTNAME)::VARCHAR
    device.ip: (COALESCE(DEVICE_IP, IP_ADDRESS))::VARCHAR
    dst_endpoint.ip: (REMOTE_IP)::VARCHAR
    dst_endpoint.mac: (DESTINATION_MAC)::VARCHAR
    dst_endpoint.svc_name: (COALESCE(DESTINATION_SERVICE_NAME, TACACS_SERVICE))::VARCHAR
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (RECEIVE_TIME)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (RECEIVE_TIME)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: (MESSAGE)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('hpe-aruba-clearpass-alerts')::VARCHAR
    metadata.product.vendor_name: ('aruba-clearpass')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(DEVICE_IP, IP_ADDRESS))::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (REMOTE_IP)::VARCHAR
    - name: '''dst_endpoint.mac'''
      type: '''MAC Address'''
      type_id: 3
      reputation: null::VARIANT
      value: (DESTINATION_MAC)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (DESTINATION_USER)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session: NULL::VARIANT
    severity: (CASE ((CASE WHEN SEVERITY=1 THEN 4 WHEN SEVERITY=5 THEN 1 WHEN SEVERITY
      IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY=1 THEN 4 WHEN SEVERITY=5 THEN 1 WHEN SEVERITY
      IS NULL THEN 0 ELSE 99 END)::NUMBER
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.name: (AUTH_SOURCE)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN LOGIN_STATUS IS NULL THEN 0 WHEN LOGIN_STATUS = 'UNKNOWN'
      THEN 0 WHEN LOGIN_STATUS = '0' THEN 1 WHEN LOGIN_STATUS = '1' THEN 2 ELSE 99
      END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure'
      WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: (ERROR_CODE)::VARCHAR
    status_detail: (COALESCE(REASON, OUTCOME))::VARCHAR
    status_id: (CASE WHEN LOGIN_STATUS IS NULL THEN 0 WHEN LOGIN_STATUS = 'UNKNOWN'
      THEN 0 WHEN LOGIN_STATUS = '0' THEN 1 WHEN LOGIN_STATUS = '1' THEN 2 ELSE 99
      END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300201)::NUMBER) WHEN 300200 THEN ''Authentication: Unknown''
      WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (300201)::NUMBER
    unmapped: NULL::VARIANT
    user.name: (DESTINATION_USER)::VARCHAR
  predicate: EVENT_NAME ILIKE ANY('%authentication%', '%logged in%')
