type: mapping
id: iis_w3c_4002_http_activity_1.1.0
version: '15'
name: Iis W3c to OCSF class Http Activity
data-types:
- iis-w3c
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (DECODE(METHOD, 'CONNECT', 1, 'DELETE', 2, 'GET', 3,'HEAD', 4, 'OPTIONS',
      5, 'POST', 6, 'PUT', 7, 'TRACE', 8,0))::NUMBER
    activity_name: (CASE ((DECODE(METHOD, 'CONNECT', 1, 'DELETE', 2, 'GET', 3,'HEAD',
      4, 'OPTIONS', 5, 'POST', 6, 'PUT', 7, 'TRACE', 8,0))::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Connect' WHEN 2 THEN 'Delete' WHEN 3 THEN 'Get' WHEN 4 THEN 'Head'
      WHEN 5 THEN 'Options' WHEN 6 THEN 'Post' WHEN 7 THEN 'Put' WHEN 8 THEN 'Trace'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.name: (USERNAME)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('http_activity')::VARCHAR
    class_uid: ('4002')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.direction_id: (1)::NUMBER
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (SERVER_IP)::VARCHAR
    dst_endpoint.name: (SERVER_NAME)::VARCHAR
    dst_endpoint.port: (SERVER_PORT)::NUMBER
    duration: (TIME_TAKEN)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    http_cookies: NULL::ARRAY
    http_request.http_method: (METHOD)::VARCHAR
    http_request.length: (BYTES_SENT)::NUMBER
    http_request.referrer: (REFERRER)::VARCHAR
    http_request.url.query_string: (URI_QUERY)::VARCHAR
    http_request.url.url_string: (URI_STEM)::VARCHAR
    http_request.user_agent: (USER_AGENT)::VARCHAR
    http_response.code: (STATUS_CODE)::NUMBER
    http_response.length: (BYTES_RECEIVED)::NUMBER
    http_status: NULL::NUMBER
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('iis-w3c')::VARCHAR
    metadata.product.vendor_name: ('iis')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USERNAME)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SERVER_IP)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (URI_STEM)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN STATUS_CODE ILIKE '2%%' THEN 1 WHEN STATUS_CODE ILIKE  '4%%'
      THEN 2 WHEN STATUS_CODE ILIKE '5%%' THEN 2 WHEN STATUS_CODE IS NULL THEN 0 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure'
      WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: (STATUS_CODE)::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN STATUS_CODE ILIKE '2%%' THEN 1 WHEN STATUS_CODE ILIKE  '4%%'
      THEN 2 WHEN STATUS_CODE ILIKE '5%%' THEN 2 WHEN STATUS_CODE IS NULL THEN 0 ELSE
      99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((DECODE(METHOD, ''CONNECT'', 400201, ''DELETE'', 400202, ''GET'',
      400203,''HEAD'', 400204, ''OPTIONS'', 400205, ''POST'', 400206, ''PUT'', 400207,
      ''TRACE'', 400208,400200))::NUMBER) WHEN 400200 THEN ''HTTP Activity: Unknown''
      WHEN 400201 THEN ''HTTP Activity: Connect'' WHEN 400202 THEN ''HTTP Activity:
      Delete'' WHEN 400203 THEN ''HTTP Activity: Get'' WHEN 400204 THEN ''HTTP Activity:
      Head'' WHEN 400205 THEN ''HTTP Activity: Options'' WHEN 400206 THEN ''HTTP Activity:
      Post'' WHEN 400207 THEN ''HTTP Activity: Put'' WHEN 400208 THEN ''HTTP Activity:
      Trace'' WHEN 400299 THEN ''HTTP Activity: Other'' END)::VARCHAR'
    type_uid: (DECODE(METHOD, 'CONNECT', 400201, 'DELETE', 400202, 'GET', 400203,'HEAD',
      400204, 'OPTIONS', 400205, 'POST', 400206, 'PUT', 400207, 'TRACE', 400208,400200))::NUMBER
    unmapped: NULL::VARIANT
