type: mapping
id: imperva_waf_logs_4002_http_activity_1.1.0
version: '15'
name: Imperva Waf Logs to OCSF class Http Activity
data-types:
- imperva-waf-logs
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN METHOD is NULL THEN 0 WHEN METHOD = 'Connect' THEN 1 WHEN
      METHOD = 'Delete' THEN 2 WHEN METHOD = 'Get' THEN 3 WHEN METHOD = 'Head' THEN
      4 WHEN METHOD = 'Options' THEN 5 WHEN METHOD = 'Post' THEN 6 WHEN METHOD = 'Put'
      THEN 7 WHEN METHOD = 'Trace' THEN 8 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN METHOD is NULL THEN 0 WHEN METHOD = 'Connect'
      THEN 1 WHEN METHOD = 'Delete' THEN 2 WHEN METHOD = 'Get' THEN 3 WHEN METHOD
      = 'Head' THEN 4 WHEN METHOD = 'Options' THEN 5 WHEN METHOD = 'Post' THEN 6 WHEN
      METHOD = 'Put' THEN 7 WHEN METHOD = 'Trace' THEN 8 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Connect' WHEN 2 THEN 'Delete' WHEN 3 THEN 'Get'
      WHEN 4 THEN 'Head' WHEN 5 THEN 'Options' WHEN 6 THEN 'Post' WHEN 7 THEN 'Put'
      WHEN 8 THEN 'Trace' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: (CLAPP)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('http_activity')::VARCHAR
    class_uid: ('4002')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.direction_id: (1)::NUMBER
    count: NULL::NUMBER
    device.zone: (POP_NAME)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.domain: (SITE_NAME)::VARCHAR
    dst_endpoint.ip: (SIP)::VARCHAR
    dst_endpoint.location.coordinates: (ARRAY_CONSTRUCT(LONGITUDE, LATITUDE))::ARRAY
    dst_endpoint.location.country: (COUNTRY_CODE)::VARCHAR
    dst_endpoint.port: (SPT)::NUMBER
    dst_endpoint.zone: (POP_NAME)::VARCHAR
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (RESPONSE_END_TIME)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (RESPONSE_END_TIME)::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    http_cookies: NULL::VARIANT
    http_request.http_method: (METHOD)::VARCHAR
    http_request.length: (CONTENT_LENGTH)::NUMBER
    http_request.referrer: (REFERRER)::VARCHAR
    http_request.uid: (REQUEST_ID)::VARCHAR
    http_request.url.hostname: (SPLIT_PART(URL, '/', 1))::VARCHAR
    http_request.url.path: (REGEXP_SUBSTR(URL, '/[^? ]+'))::VARCHAR
    http_request.url.url_string: (URL)::VARCHAR
    http_request.user_agent: (USER_AGENT)::VARCHAR
    http_request.x_forwarded_for: (X_FORWARDED_FOR)::ARRAY
    http_response.code: (HTTP_STATUS_CODE)::NUMBER
    http_response.message: (REQUEST_RESULT)::VARCHAR
    http_status: (HTTP_STATUS_CODE)::NUMBER
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('imperva-waf-logs')::VARCHAR
    metadata.product.vendor_name: ('imperva')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SIP)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SPLIT_PART(URL, '/', 1))::VARCHAR
    - name: '''http_request.url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (URL)::VARCHAR
    - name: '''http_request.x_forwarded_for'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (X_FORWARDED_FOR)::ARRAY
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((CASE WHEN 'SEVERITY' IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium'
      WHEN 4 THEN 'High' WHEN 5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other'
      END)::VARCHAR
    severity_id: (CASE WHEN 'SEVERITY' IS NULL THEN 0 ELSE 99 END)::NUMBER
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    src_endpoint.port: (SOURCE_PORT)::NUMBER
    start_time: (date_part('epoch_milliseconds', (REQUEST_START_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (REQUEST_START_TIME)::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN HTTP_STATUS_CODE ILIKE '2%%' THEN 1 WHEN HTTP_STATUS_CODE
      ILIKE '4%%' THEN 2 WHEN HTTP_STATUS_CODE ILIKE '5%%' THEN 2 WHEN HTTP_STATUS_CODE
      IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success'
      WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN HTTP_STATUS_CODE ILIKE '2%%' THEN 1 WHEN HTTP_STATUS_CODE
      ILIKE '4%%' THEN 2 WHEN HTTP_STATUS_CODE ILIKE '5%%' THEN 2 WHEN HTTP_STATUS_CODE
      IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', request_start_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (request_start_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls.version: (PROTOCOL_VERSION)::VARCHAR
    traffic: NULL::VARIANT
    type_name: '(CASE ((CASE WHEN METHOD = ''CONNECT'' THEN 400201 WHEN METHOD = ''DELETE''
      THEN 400202 WHEN METHOD = ''GET'' THEN 400203 WHEN METHOD = ''HEAD'' THEN 400204
      WHEN METHOD = ''OPTIONS'' THEN 400205 WHEN METHOD = ''POST'' THEN 400206 WHEN
      METHOD = ''PUT'' THEN 400207 WHEN METHOD = ''TRACE'' THEN 400208 WHEN METHOD
      IS NULL THEN 400200 ELSE 400299 END)::NUMBER) WHEN 400200 THEN ''HTTP Activity:
      Unknown'' WHEN 400201 THEN ''HTTP Activity: Connect'' WHEN 400202 THEN ''HTTP
      Activity: Delete'' WHEN 400203 THEN ''HTTP Activity: Get'' WHEN 400204 THEN
      ''HTTP Activity: Head'' WHEN 400205 THEN ''HTTP Activity: Options'' WHEN 400206
      THEN ''HTTP Activity: Post'' WHEN 400207 THEN ''HTTP Activity: Put'' WHEN 400208
      THEN ''HTTP Activity: Trace'' WHEN 400299 THEN ''HTTP Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN METHOD = 'CONNECT' THEN 400201 WHEN METHOD = 'DELETE' THEN
      400202 WHEN METHOD = 'GET' THEN 400203 WHEN METHOD = 'HEAD' THEN 400204 WHEN
      METHOD = 'OPTIONS' THEN 400205 WHEN METHOD = 'POST' THEN 400206 WHEN METHOD
      = 'PUT' THEN 400207 WHEN METHOD = 'TRACE' THEN 400208 WHEN METHOD IS NULL THEN
      400200 ELSE 400299 END)::NUMBER
    unmapped: NULL::VARIANT
