type: mapping
id: imperva_nrt_4002_http_activity_1.1.0
version: '10'
name: Imperva Nrt to OCSF class Http Activity
data-types:
- imperva-nrt
mapping:
  fields:
    action: NULL::VARCHAR
    action_id: NULL::NUMBER
    activity_id: (DECODE(HTTP_REQUEST_METHOD, 'CONNECT',1,'DELETE',2,'GET',3,'HEAD',4,'OPTIONS',5,'POST',6,'PUT',7,'TRACE',8,99))::NUMBER
    activity_name: (CASE ((DECODE(HTTP_REQUEST_METHOD, 'CONNECT',1,'DELETE',2,'GET',3,'HEAD',4,'OPTIONS',5,'POST',6,'PUT',7,'TRACE',8,99))::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Connect' WHEN 2 THEN 'Delete' WHEN 3 THEN
      'Get' WHEN 4 THEN 'Head' WHEN 5 THEN 'Options' WHEN 6 THEN 'Post' WHEN 7 THEN
      'Put' WHEN 8 THEN 'Trace' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (RAW:user:email)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('http_activity')::VARCHAR
    class_uid: ('4002')::NUMBER
    cloud: NULL::VARIANT
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.domain: (SERVER_DOMAIN)::VARCHAR
    dst_endpoint.location.region: (SERVER_GEO_NAME)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    http_cookies: NULL::ARRAY
    http_request.http_headers: (COALESCE(IMPERVA_ABP_HEADERS_ACCEPT, IMPERVA_ABP_HEADERS_ACCEPT_ENCODING))::ARRAY
    http_request.http_method: (HTTP_REQUEST_METHOD)::VARCHAR
    http_request.length: (HTTP_REQUEST_BODY_BYTES)::NUMBER
    http_request.uid: (IMPERVA_ABP_CUSTOMER_REQUEST_ID)::VARCHAR
    http_request.url.path: (URL_PATH)::VARCHAR
    http_request.url.query_string: (URL_QUERY)::VARCHAR
    http_request.user_agent: (USER_AGENT_ORIGINAL)::VARCHAR
    http_request.version: (USER_AGENT_VERSION)::VARCHAR
    http_response.message: (RAW:message)::VARCHAR
    http_status: NULL::NUMBER
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('imperva-nrt')::VARCHAR
    metadata.product.vendor_name: ('imperva')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (RAW:user:email)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    src_endpoint.domain: (CLIENT_DOMAIN)::VARCHAR
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    src_endpoint.location.postal_code: (CLIENT_GEO_COUNTRY_ISO_CODE)::VARCHAR
    src_endpoint.location.region: (CLIENT_GEO_NAME)::VARCHAR
    start_time: (date_part('epoch_milliseconds', (TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (TIMESTAMP)::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((DECODE(HTTP_REQUEST_METHOD, ''CONNECT'',400201,''DELETE'',400202,''GET'',400203,''HEAD'',400204,''OPTIONS'',400205,''POST'',400206,''PUT'',400207,''TRACE'',400208,400299))::NUMBER)
      WHEN 400200 THEN ''HTTP Activity: Unknown'' WHEN 400201 THEN ''HTTP Activity:
      Connect'' WHEN 400202 THEN ''HTTP Activity: Delete'' WHEN 400203 THEN ''HTTP
      Activity: Get'' WHEN 400204 THEN ''HTTP Activity: Head'' WHEN 400205 THEN ''HTTP
      Activity: Options'' WHEN 400206 THEN ''HTTP Activity: Post'' WHEN 400207 THEN
      ''HTTP Activity: Put'' WHEN 400208 THEN ''HTTP Activity: Trace'' WHEN 400299
      THEN ''HTTP Activity: Other'' END)::VARCHAR'
    type_uid: (DECODE(HTTP_REQUEST_METHOD, 'CONNECT',400201,'DELETE',400202,'GET',400203,'HEAD',400204,'OPTIONS',400205,'POST',400206,'PUT',400207,'TRACE',400208,400299))::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_PROVIDER = 'abp'
