type: mapping
id: jamf_protect_alerts_2004_detection_finding_1.1.0
version: '1'
name: Jamf Protect Alerts to OCSF class Detection Finding
data-types:
- jamf-protect-alerts
mapping:
  fields:
    action: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN
      'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN
      2 THEN 'Update' WHEN 3 THEN 'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (2::NUMBER) WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: (2)::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud.provider: ('Jamf Protect')::VARCHAR
    comment: NULL::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: NULL::NUMBER
    confidence_score: NULL::NUMBER
    count: NULL::NUMBER
    device.created_time: (date_part('epoch_milliseconds', DEVICE_CREATED_TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    device.created_time_dt: (DEVICE_CREATED_TIMESTAMP)::TIMESTAMP_LTZ
    device.desc: (CONNECTION_STATUS)::VARCHAR
    device.hw_info.cpu_type: (DEVICE_ARCH)::VARCHAR
    device.hw_info.ram_size: (MEMORY_SIZE)::NUMBER
    device.hw_info.serial_number: (DEVICE_SERIAL)::VARCHAR
    device.ip: (LAST_CONNECTION_IP)::VARCHAR
    device.is_trusted: (WEB_PROTECTION_ACTIVE)::BOOLEAN
    device.last_seen_time: (date_part('epoch_milliseconds', COALESCE(LAST_CHECKIN_TIMESTAMP,
      LAST_CONNECTION_TIMESTAMP, LAST_DISCONNECTION_TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    device.last_seen_time_dt: (COALESCE(LAST_CHECKIN_TIMESTAMP, LAST_CONNECTION_TIMESTAMP,
      LAST_DISCONNECTION_TIMESTAMP))::TIMESTAMP_LTZ
    device.modified_time: (date_part('epoch_milliseconds', DEVICE_UPDATED_TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    device.modified_time_dt: (DEVICE_UPDATED_TIMESTAMP)::TIMESTAMP_LTZ
    device.name: (HOST_NAME)::VARCHAR
    device.os.build: (OS_MAJOR_VERSION || '.' || OS_MINOR_VERSION || '.' || OS_PATCH_VERSION)::VARCHAR
    device.os.name: (MODEL_NAME)::VARCHAR
    device.os.version: (OS_STRING)::VARCHAR
    device.uid: (DEVICE_UUID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: NULL::ARRAY
    finding_info.attacks: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('technique',OBJECT_CONSTRUCT_KEEP_NULL('name',
      ALERT_TAGS[0]))))::ARRAY
    finding_info.created_time: (date_part('epoch_milliseconds', ALERT_CREATED_TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    finding_info.created_time_dt: (ALERT_CREATED_TIMESTAMP)::TIMESTAMP_LTZ
    finding_info.desc: (ALERT_ACTIONS[0])::VARCHAR
    finding_info.first_seen_time: (date_part('epoch_milliseconds', ALERT_RECEIVED_TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    finding_info.first_seen_time_dt: (ALERT_RECEIVED_TIMESTAMP)::TIMESTAMP_LTZ
    finding_info.modified_time: (date_part('epoch_milliseconds', ALERT_UPDATED_TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    finding_info.modified_time_dt: (ALERT_UPDATED_TIMESTAMP)::TIMESTAMP_LTZ
    finding_info.title: (EVENT_TYPE)::VARCHAR
    finding_info.uid: (COALESCE(ALERT_UUID, ALERT_ID))::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('jamf-protect-alerts')::VARCHAR
    metadata.product.vendor_name: ('jamf-protect')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (LAST_CONNECTION_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: NULL::ARRAY
    risk_level: NULL::VARCHAR
    risk_level_id: NULL::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE (CASE WHEN ALERT_SEVERITY IS NULL THEN 0 WHEN ALERT_SEVERITY =
      'Informational' THEN 1 WHEN ALERT_SEVERITY = 'Low' THEN 2 WHEN ALERT_SEVERITY
      = 'High' THEN 4 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN ALERT_SEVERITY IS NULL THEN 0 WHEN ALERT_SEVERITY = 'Informational'
      THEN 1 WHEN ALERT_SEVERITY = 'Low' THEN 2 WHEN ALERT_SEVERITY = 'High' THEN
      4 ELSE 99 END)::NUMBER
    start_time: (date_part('epoch_milliseconds', EVENT_TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (EVENT_TIMESTAMP)::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN ALERT_STATUS IS NULL THEN 0 WHEN ALERT_STATUS = 'New'
      THEN 1 WHEN ALERT_STATUS ILIKE '%Resolve%' THEN 4 ELSE 99 END::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'New' WHEN 2 THEN 'In Progress' WHEN 3 THEN 'Suppressed'
      WHEN 4 THEN 'Resolved' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (ALERT_STATUS)::VARCHAR
    status_id: (CASE WHEN ALERT_STATUS IS NULL THEN 0 WHEN ALERT_STATUS = 'New' THEN
      1 WHEN ALERT_STATUS ILIKE '%Resolve%' THEN 4 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', alert_updated_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (alert_updated_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (200400::NUMBER) WHEN 200400 THEN ''Detection Finding: Unknown''
      WHEN 200401 THEN ''Detection Finding: Create'' WHEN 200402 THEN ''Detection
      Finding: Update'' WHEN 200403 THEN ''Detection Finding: Close'' WHEN 200499
      THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: (200400)::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
