type: mapping
id: jamf_protect_audit_6003_api_activity_1.1.0
version: '1'
name: Jamf Protect Audit to OCSF class Api Activity
data-types:
- jamf-protect-audit
mapping:
  fields:
    activity_id: (CASE WHEN AUDIT_OPERATION = 'create' THEN 1 WHEN AUDIT_OPERATION
      IN ('read','get','list') THEN 2 WHEN AUDIT_OPERATION IN ('update','updateOrganizationForward')
      THEN 3 WHEN AUDIT_OPERATION IN ('delete','remove') THEN 4 WHEN AUDIT_OPERATION
      IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN AUDIT_OPERATION = 'create' THEN 1 WHEN AUDIT_OPERATION
      IN ('read','get','list') THEN 2 WHEN AUDIT_OPERATION IN ('update','updateOrganizationForward')
      THEN 3 WHEN AUDIT_OPERATION IN ('delete','remove') THEN 4 WHEN AUDIT_OPERATION
      IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create'
      WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.user.email_addr: (SPLIT_PART(audit_user::VARCHAR, '#', 1))::VARCHAR
    actor.user.type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User'
      WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (0)::NUMBER
    actor.user.uid: (AUDIT_USER)::VARCHAR
    api.operation: (AUDIT_OPERATION)::VARCHAR
    api.response.error_message: (AUDIT_ERROR)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: NULL::VARCHAR
    metadata.event_code: (audit_operation)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('jamf-protect-audit')::VARCHAR
    metadata.product.vendor_name: ('jamf-protect')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (SPLIT_PART(audit_user::VARCHAR, '#', 1))::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (AUDIT_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    resources: (ARRAY_CONSTRUCT_COMPACT(object_construct('data', audit_args, 'uid',
      audit_resource_id)))::ARRAY
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.domain: (SENTINEL_DOMAIN)::VARCHAR
    src_endpoint.ip: (AUDIT_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', audit_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (audit_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((600300 + (CASE WHEN AUDIT_OPERATION = ''create'' THEN 1 WHEN
      AUDIT_OPERATION IN (''read'',''get'',''list'') THEN 2 WHEN AUDIT_OPERATION IN
      (''update'',''updateOrganizationForward'') THEN 3 WHEN AUDIT_OPERATION IN (''delete'',''remove'')
      THEN 4 WHEN AUDIT_OPERATION IS NULL THEN 0 ELSE 99 END))::NUMBER) WHEN 600300
      THEN ''API Activity: Unknown'' WHEN 600301 THEN ''API Activity: Create'' WHEN
      600302 THEN ''API Activity: Read'' WHEN 600303 THEN ''API Activity: Update''
      WHEN 600304 THEN ''API Activity: Delete'' WHEN 600399 THEN ''API Activity: Other''
      END)::VARCHAR'
    type_uid: (600300 + (CASE WHEN AUDIT_OPERATION = 'create' THEN 1 WHEN AUDIT_OPERATION
      IN ('read','get','list') THEN 2 WHEN AUDIT_OPERATION IN ('update','updateOrganizationForward')
      THEN 3 WHEN AUDIT_OPERATION IN ('delete','remove') THEN 4 WHEN AUDIT_OPERATION
      IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: AUDIT_OPERATION is not null
