type: mapping
id: jamf_protect_computers_5001_inventory_info_1.1.0
version: '1'
name: Jamf Protect Computers to OCSF class Inventory Info
data-types:
- jamf-protect-computers
mapping:
  fields:
    activity_id: (2)::NUMBER
    activity_name: (CASE (2::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Log' WHEN
      2 THEN 'Collect' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE (5::NUMBER) WHEN 5 THEN 'Discovery' END)::VARCHAR
    category_uid: (5)::NUMBER
    class_name: ('inventory_info')::VARCHAR
    class_uid: ('5001')::NUMBER
    cloud.provider: ('Jamf Protect')::VARCHAR
    count: NULL::NUMBER
    device.created_time: (date_part('epoch_milliseconds', CREATED_TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    device.created_time_dt: (CREATED_TIMESTAMP)::TIMESTAMP_LTZ
    device.desc: (PLAN_DESCRIPTION)::VARCHAR
    device.hw_info.cpu_type: (DEVICE_ARCH)::VARCHAR
    device.hw_info.ram_size: (MEMORY_SIZE)::NUMBER
    device.hw_info.serial_number: (DEVICE_SERIAL)::VARCHAR
    device.ip: (LAST_CONNECTION_IP)::VARCHAR
    device.is_compliant: (IFF(FULL_DISK_ACCESS = 'Authorized', true, false))::BOOLEAN
    device.is_trusted: (WEB_PROTECTION_ACTIVE)::BOOLEAN
    device.last_seen_time: (date_part('epoch_milliseconds', COALESCE(LAST_CHECKIN_TIMESTAMP,
      LAST_CONNECTION_TIMESTAMP, LAST_DISCONNECTION_TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    device.last_seen_time_dt: (COALESCE(LAST_CHECKIN_TIMESTAMP, LAST_CONNECTION_TIMESTAMP,
      LAST_DISCONNECTION_TIMESTAMP))::TIMESTAMP_LTZ
    device.modified_time: (date_part('epoch_milliseconds', UPDATED_TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    device.modified_time_dt: (UPDATED_TIMESTAMP)::TIMESTAMP_LTZ
    device.name: (HOST_NAME)::VARCHAR
    device.os.build: (KERNEL_VERSION)::VARCHAR
    device.os.name: (MODEL_NAME)::VARCHAR
    device.os.version: (OS_STRING)::VARCHAR
    device.type: (CASE (99::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN
      10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (99)::NUMBER
    device.uid: (DEVICE_UUID)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (connection_status)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('jamf-protect-computers')::VARCHAR
    metadata.product.vendor_name: ('jamf-protect')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (LAST_CONNECTION_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE (CASE WHEN PLAN_LOG_LEVEL IS NULL THEN 0 WHEN PLAN_LOG_LEVEL =
      'INFO' THEN 1 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN PLAN_LOG_LEVEL IS NULL THEN 0 WHEN PLAN_LOG_LEVEL = 'INFO'
      THEN 1 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN CONNECTION_STATUS IS NULL THEN 0 WHEN CONNECTION_STATUS
      = 'Connected' THEN 1 WHEN CONNECTION_STATUS = 'Disconnected' THEN 2 ELSE 99
      END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure'
      WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (COALESCE(CONNECTION_STATUS, LAST_DISCONNECTION_REASON))::VARCHAR
    status_id: (CASE WHEN CONNECTION_STATUS IS NULL THEN 0 WHEN CONNECTION_STATUS
      = 'Connected' THEN 1 WHEN CONNECTION_STATUS = 'Disconnected' THEN 2 ELSE 99
      END)::NUMBER
    time: (date_part('epoch_milliseconds', updated_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (updated_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (500102::NUMBER) WHEN 500100 THEN ''Device Inventory Info: Unknown''
      WHEN 500101 THEN ''Device Inventory Info: Log'' WHEN 500102 THEN ''Device Inventory
      Info: Collect'' WHEN 500199 THEN ''Device Inventory Info: Other'' END)::VARCHAR'
    type_uid: (500102)::NUMBER
    unmapped: NULL::VARIANT
