type: mapping
id: jira_audit_logs_3006_group_management_1.1.0
version: '8'
name: Jira Audit Logs to OCSF class Group Management
data-types:
- jira-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN SUMMARY IS NULL THEN 0 WHEN SUMMARY ILIKE '%user%added%'
      THEN 3 WHEN SUMMARY ILIKE '%user%remove%' THEN 4 WHEN SUMMARY ILIKE '%group%delete%'
      THEN 5 WHEN SUMMARY ILIKE '%group%create%' THEN 6 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN SUMMARY IS NULL THEN 0 WHEN SUMMARY ILIKE '%user%added%'
      THEN 3 WHEN SUMMARY ILIKE '%user%remove%' THEN 4 WHEN SUMMARY ILIKE '%group%delete%'
      THEN 5 WHEN SUMMARY ILIKE '%group%create%' THEN 6 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Assign Privileges' WHEN 2 THEN 'Revoke Privileges'
      WHEN 3 THEN 'Add User' WHEN 4 THEN 'Remove User' WHEN 5 THEN 'Delete' WHEN 6
      THEN 'Create' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('group_management')::VARCHAR
    class_uid: ('3006')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.ip: (REMOTE_IP_ADDRESS)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    group.name: (OBJECT_ITEM_NAME)::VARCHAR
    group.type: (OBJECT_ITEM_TYPE_NAME)::VARCHAR
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('jira-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('Atlassian')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (REMOTE_IP_ADDRESS)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (IFF(ASSOCIATED_ITEMS[0]:name ILIKE '%@%', ASSOCIATED_ITEMS[0]:name,
        NULL))::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (IFF(ASSOCIATED_ITEMS[0]:name RLIKE '[a-zA-Z.]+', ASSOCIATED_ITEMS[0]:name,
        NULL))::VARCHAR
    privileges: NULL::ARRAY
    raw_data: NULL::VARCHAR
    resource: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', created::TIMESTAMP_LTZ))::NUMBER
    time_dt: (created)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN SUMMARY IS NULL THEN 300600 WHEN SUMMARY ILIKE ''%user%added%''
      THEN 300603 WHEN SUMMARY ILIKE ''%user%remove%'' THEN 300604 WHEN SUMMARY ILIKE
      ''%group%delete%'' THEN 300605 WHEN SUMMARY ILIKE ''%group%create%'' THEN 300606
      ELSE 300699 END)::NUMBER) WHEN 300600 THEN ''Group Management: Unknown'' WHEN
      300601 THEN ''Group Management: Assign Privileges'' WHEN 300602 THEN ''Group
      Management: Revoke Privileges'' WHEN 300603 THEN ''Group Management: Add User''
      WHEN 300604 THEN ''Group Management: Remove User'' WHEN 300605 THEN ''Group
      Management: Delete'' WHEN 300606 THEN ''Group Management: Create'' WHEN 300699
      THEN ''Group Management: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN SUMMARY IS NULL THEN 300600 WHEN SUMMARY ILIKE '%user%added%'
      THEN 300603 WHEN SUMMARY ILIKE '%user%remove%' THEN 300604 WHEN SUMMARY ILIKE
      '%group%delete%' THEN 300605 WHEN SUMMARY ILIKE '%group%create%' THEN 300606
      ELSE 300699 END)::NUMBER
    unmapped: NULL::VARIANT
    user.account.uid: (AUTHOR_ACCOUNT_ID)::VARCHAR
    user.email_addr: (IFF(ASSOCIATED_ITEMS[0]:name ILIKE '%@%', ASSOCIATED_ITEMS[0]:name,
      NULL))::VARCHAR
    user.name: (IFF(ASSOCIATED_ITEMS[0]:name RLIKE '[a-zA-Z.]+', ASSOCIATED_ITEMS[0]:name,
      NULL))::VARCHAR
    user.type: (CASE ((CASE WHEN ASSOCIATED_ITEMS[0]:typeName IS NULL THEN 0 WHEN
      ASSOCIATED_ITEMS[0]:typeName ILIKE '%user%' THEN 1 WHEN ASSOCIATED_ITEMS[0]:typeName
      ILIKE '%admin%' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN ASSOCIATED_ITEMS[0]:typeName IS NULL THEN 0 WHEN ASSOCIATED_ITEMS[0]:typeName
      ILIKE '%user%' THEN 1 WHEN ASSOCIATED_ITEMS[0]:typeName ILIKE '%admin%' THEN
      2 ELSE 99 END)::NUMBER
    user.uid: (COALESCE(IFF(ASSOCIATED_ITEMS[0]:id NOT RLIKE '[a-zA-Z.]+' AND ASSOCIATED_ITEMS[0]:id
      NOT ILIKE '%@%', ASSOCIATED_ITEMS[0]:id, NULL), AUTHOR_KEY))::VARCHAR
  predicate: CATEGORY = 'group management'
