type: mapping
id: jumpcloud_directory_insights_3001_account_change_1.1.0
version: '9'
name: Jumpcloud Directory Insights to OCSF class Account Change
data-types:
- jumpcloud-directory-insights
mapping:
  fields:
    activity_id: (CASE WHEN EVENT_TYPE IS NULL THEN 0 WHEN EVENT_TYPE ILIKE '%create%'
      THEN 1 WHEN EVENT_TYPE ILIKE '%enable%' OR EVENT_TYPE ILIKE '%user%activated%'
      THEN 2 WHEN EVENT_TYPE ILIKE '%password%change%' OR EVENT_TYPE ILIKE '%password%update%'
      OR EVENT_TYPE ILIKE '%update%password%' THEN 3 WHEN EVENT_TYPE ILIKE '%password%reset%'
      THEN 4 WHEN EVENT_TYPE ILIKE '%disable%' OR EVENT_TYPE ILIKE '%user%suspended%'
      THEN 5 WHEN EVENT_TYPE ILIKE '%delete%' THEN 6 WHEN EVENT_TYPE ILIKE '%lockout%'
      THEN 9 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_TYPE IS NULL THEN 0 WHEN EVENT_TYPE ILIKE
      '%create%' THEN 1 WHEN EVENT_TYPE ILIKE '%enable%' OR EVENT_TYPE ILIKE '%user%activated%'
      THEN 2 WHEN EVENT_TYPE ILIKE '%password%change%' OR EVENT_TYPE ILIKE '%password%update%'
      OR EVENT_TYPE ILIKE '%update%password%' THEN 3 WHEN EVENT_TYPE ILIKE '%password%reset%'
      THEN 4 WHEN EVENT_TYPE ILIKE '%disable%' OR EVENT_TYPE ILIKE '%user%suspended%'
      THEN 5 WHEN EVENT_TYPE ILIKE '%delete%' THEN 6 WHEN EVENT_TYPE ILIKE '%lockout%'
      THEN 9 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN
      10 THEN 'MFA Factor Enable' WHEN 11 THEN 'MFA Factor Disable' WHEN 2 THEN 'Enable'
      WHEN 3 THEN 'Password Change' WHEN 4 THEN 'Password Reset' WHEN 5 THEN 'Disable'
      WHEN 6 THEN 'Delete' WHEN 7 THEN 'Attach Policy' WHEN 8 THEN 'Detach Policy'
      WHEN 9 THEN 'Lock' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.invoked_by: (SERVICE)::VARCHAR
    actor.session.is_mfa: (IFF(RAW:mfa = 'true', TRUE, FALSE))::BOOLEAN
    api.response.code: (RAW:message_chain:response_code)::NUMBER
    api.response.error_message: (RAW:error_message)::VARCHAR
    api.response.message: (RAW:message_chain:response_message)::VARCHAR
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('account_change')::VARCHAR
    class_uid: ('3001')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (RAW:system:hostname)::VARCHAR
    device.name: (RAW:useragent:device)::VARCHAR
    device.os.name: (RAW:useragent:os_full)::VARCHAR
    device.os.type: (CASE ((CASE WHEN RAW:useragent:os IS NULL THEN 0 WHEN RAW:useragent:os
      ILIKE '%Windows%' THEN 100 WHEN RAW:useragent:os ILIKE '%Linux%' OR RAW:useragent:os
      ILIKE '%Ubuntu%' THEN 200 WHEN RAW:useragent:os ILIKE '%Android%' THEN 201 WHEN
      RAW:useragent:os ILIKE '%Mac%' THEN 300 WHEN RAW:useragent:os ILIKE '%iOS%'
      THEN 301 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows'
      WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android'
      WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN
      'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN RAW:useragent:os IS NULL THEN 0 WHEN RAW:useragent:os
      ILIKE '%Windows%' THEN 100 WHEN RAW:useragent:os ILIKE '%Linux%' OR RAW:useragent:os
      ILIKE '%Ubuntu%' THEN 200 WHEN RAW:useragent:os ILIKE '%Android%' THEN 201 WHEN
      RAW:useragent:os ILIKE '%Mac%' THEN 300 WHEN RAW:useragent:os ILIKE '%iOS%'
      THEN 301 ELSE 99 END)::NUMBER
    device.os.version: (RAW:useragent:os_version)::VARCHAR
    device.uid: (RAW:system:id)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.user_agent: (RAW:useragent:name)::VARCHAR
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('jumpcloud-directory-insights')::VARCHAR
    metadata.product.vendor_name: ('jumpcloud')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (RAW:system:hostname)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (COALESCE(INITIATOR_EMAIL, INITIATED_BY:email))::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(USERNAME, INITIATED_BY:username))::VARCHAR
    policy: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    src_endpoint.location.continent: (CASE RAW:geoip:continent_code WHEN 'AF' THEN
      'Africa' WHEN 'AN' THEN 'Antarctica' WHEN 'AS' THEN 'Asia' WHEN 'EU' THEN 'Europe'
      WHEN 'NA' THEN 'North America' WHEN 'OC' THEN 'Oceania' WHEN 'SA' THEN 'South
      America' ELSE NULL END)::VARCHAR
    src_endpoint.location.coordinates: (ARRAY_CONSTRUCT(RAW:geoip:longitude, RAW:geoip:latitude))::ARRAY
    src_endpoint.location.country: (RAW:geoip:country_code)::VARCHAR
    src_endpoint.location.region: (CONCAT(RAW:geoip:country_code, '-', RAW:geoip:region_code))::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN SUCCESS IS NULL THEN 0 WHEN SUCCESS = TRUE THEN 1 WHEN
      SUCCESS = FALSE THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN SUCCESS IS NULL THEN 0 WHEN SUCCESS = TRUE THEN 1 WHEN SUCCESS
      = FALSE THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN EVENT_TYPE IS NULL THEN 300100 WHEN EVENT_TYPE ILIKE
      ''%create%'' THEN 300101 WHEN EVENT_TYPE ILIKE ''%enable%'' OR EVENT_TYPE ILIKE
      ''%user%activated%'' THEN 300102 WHEN EVENT_TYPE ILIKE ''%password%change%''
      OR EVENT_TYPE ILIKE ''%password%update%'' OR EVENT_TYPE ILIKE ''%update%password%''
      THEN 300103 WHEN EVENT_TYPE ILIKE ''%password%reset%'' THEN 300104 WHEN EVENT_TYPE
      ILIKE ''%disable%'' OR EVENT_TYPE ILIKE ''%user%suspended%'' THEN 300105 WHEN
      EVENT_TYPE ILIKE ''%delete%'' THEN 300106 WHEN EVENT_TYPE ILIKE ''%lockout%''
      THEN 300109 ELSE 300199 END)::NUMBER) WHEN 300100 THEN ''Account Change: Unknown''
      WHEN 300101 THEN ''Account Change: Create'' WHEN 300102 THEN ''Account Change:
      Enable'' WHEN 300103 THEN ''Account Change: Password Change'' WHEN 300104 THEN
      ''Account Change: Password Reset'' WHEN 300105 THEN ''Account Change: Disable''
      WHEN 300106 THEN ''Account Change: Delete'' WHEN 300107 THEN ''Account Change:
      Attach Policy'' WHEN 300108 THEN ''Account Change: Detach Policy'' WHEN 300109
      THEN ''Account Change: Lock'' WHEN 300110 THEN ''Account Change: MFA Factor
      Enable'' WHEN 300111 THEN ''Account Change: MFA Factor Disable'' WHEN 300199
      THEN ''Account Change: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN EVENT_TYPE IS NULL THEN 300100 WHEN EVENT_TYPE ILIKE '%create%'
      THEN 300101 WHEN EVENT_TYPE ILIKE '%enable%' OR EVENT_TYPE ILIKE '%user%activated%'
      THEN 300102 WHEN EVENT_TYPE ILIKE '%password%change%' OR EVENT_TYPE ILIKE '%password%update%'
      OR EVENT_TYPE ILIKE '%update%password%' THEN 300103 WHEN EVENT_TYPE ILIKE '%password%reset%'
      THEN 300104 WHEN EVENT_TYPE ILIKE '%disable%' OR EVENT_TYPE ILIKE '%user%suspended%'
      THEN 300105 WHEN EVENT_TYPE ILIKE '%delete%' THEN 300106 WHEN EVENT_TYPE ILIKE
      '%lockout%' THEN 300109 ELSE 300199 END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (COALESCE(INITIATOR_EMAIL, INITIATED_BY:email))::VARCHAR
    user.name: (COALESCE(USERNAME, INITIATED_BY:username))::VARCHAR
    user.org.uid: (ORGANIZATION)::VARCHAR
    user.type: (CASE ((CASE WHEN INITIATOR_TYPE IS NULL THEN 0 WHEN INITIATOR_TYPE
      = 'user' THEN 1 WHEN INITIATOR_TYPE = 'admin' THEN 2 WHEN INITIATOR_TYPE = 'system'
      THEN 3 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2
      THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN INITIATOR_TYPE IS NULL THEN 0 WHEN INITIATOR_TYPE = 'user'
      THEN 1 WHEN INITIATOR_TYPE = 'admin' THEN 2 WHEN INITIATOR_TYPE = 'system' THEN
      3 ELSE 99 END)::NUMBER
    user.uid: (INITIATED_BY:id)::VARCHAR
    user_result: NULL::VARIANT
  predicate: EVENT_TYPE ILIKE '%user%' OR EVENT_TYPE ILIKE '%admin%'
