type: mapping
id: juniper_user_logs_4001_network_activity_1.1.0
version: '11'
name: Juniper User Logs to OCSF class Network Activity
data-types:
- juniper-user-logs
mapping:
  fields:
    action: (CASE ((CASE WHEN MESSAGE_NAME IN ('RT_FLOW_SESSION_DENY', 'RT_FLOW_SESSION_CLOSE')
      THEN 2 WHEN MESSAGE_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN MESSAGE_NAME IN ('RT_FLOW_SESSION_DENY', 'RT_FLOW_SESSION_CLOSE')
      THEN 2 WHEN MESSAGE_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN MESSAGE_NAME ILIKE '%CLOSE%' THEN 2 WHEN MESSAGE_NAME
      ILIKE '%DENY%' THEN 5 WHEN MESSAGE_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN MESSAGE_NAME ILIKE '%CLOSE%' THEN 2 WHEN MESSAGE_NAME
      ILIKE '%DENY%' THEN 5 WHEN MESSAGE_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2 THEN 'Close' WHEN 3 THEN 'Reset'
      WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: (SERVICE_NAME)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.protocol_num: (PROTOCOL_ID)::NUMBER
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: (CASE ((CASE WHEN MESSAGE_NAME ILIKE '%CLOSE%' THEN 2 WHEN MESSAGE_NAME
      ILIKE '%DENY%' THEN 25 WHEN MESSAGE_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 10 THEN 'Exonerated' WHEN 11
      THEN 'Corrected' WHEN 12 THEN 'Partially Corrected' WHEN 13 THEN 'Uncorrected'
      WHEN 14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN 16 THEN 'No Action' WHEN
      17 THEN 'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN 'Alert' WHEN 2 THEN 'Blocked'
      WHEN 20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN 22 THEN 'Captcha' WHEN 23 THEN
      'Challenge' WHEN 24 THEN 'Access Revoked' WHEN 25 THEN 'Rejected' WHEN 26 THEN
      'Unauthorized' WHEN 27 THEN 'Error' WHEN 3 THEN 'Quarantined' WHEN 4 THEN 'Isolated'
      WHEN 5 THEN 'Deleted' WHEN 6 THEN 'Dropped' WHEN 7 THEN 'Custom Action' WHEN
      8 THEN 'Approved' WHEN 9 THEN 'Restored' WHEN 99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN MESSAGE_NAME ILIKE '%CLOSE%' THEN 2 WHEN MESSAGE_NAME
      ILIKE '%DENY%' THEN 25 WHEN MESSAGE_NAME IS NULL THEN 0 ELSE 99 END)::NUMBER
    dst_endpoint.ip: (DESTINATION_IP)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    dst_endpoint.proxy_endpoint.ip: (NAT_DESTINATION_IP)::VARCHAR
    dst_endpoint.proxy_endpoint.port: (NAT_DESTINATION_PORT)::NUMBER
    dst_endpoint.zone: (DESTINATION_ZONE)::VARCHAR
    duration: (ELAPSED_TIME)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.name: (POLICY_NAME)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (CONCAT(MESSAGE_CATEGORY, MESSAGE))::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('juniper-user-logs')::VARCHAR
    metadata.product.vendor_name: ('juniper-firewall')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP)::VARCHAR
    - name: '''dst_endpoint.proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (NAT_DESTINATION_IP)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    - name: '''src_endpoint.proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (NAT_SOURCE_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.port: (SOURCE_PORT)::NUMBER
    src_endpoint.proxy_endpoint.ip: (NAT_SOURCE_IP)::VARCHAR
    src_endpoint.proxy_endpoint.port: (NAT_SOURCE_PORT)::NUMBER
    src_endpoint.zone: (SOURCE_ZONE)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (REASON)::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes_in: (BYTES_RECEIVED_CLIENT)::NUMBER
    traffic.bytes_out: (BYTES_RECEIVED_SERVER)::NUMBER
    traffic.packets_in: (PACKETS_RECEIVED_CLIENT)::NUMBER
    traffic.packets_out: (PACKETS_RECEIVED_SERVER)::NUMBER
    type_name: '(CASE ((CASE WHEN MESSAGE_NAME ILIKE ''%CLOSE%'' THEN 400102 WHEN
      MESSAGE_NAME ILIKE ''%DENY%'' THEN 400105 WHEN MESSAGE_NAME IS NULL THEN 400100
      ELSE 400199 END)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown'' WHEN
      400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN MESSAGE_NAME ILIKE '%CLOSE%' THEN 400102 WHEN MESSAGE_NAME
      ILIKE '%DENY%' THEN 400105 WHEN MESSAGE_NAME IS NULL THEN 400100 ELSE 400199
      END)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
  predicate: SOURCE_IP is not NULL
