type: mapping
id: kubernetes_audit_logs_6003_api_activity_1.1.0
version: '11'
name: Kubernetes Audit Logs to OCSF class Api Activity
data-types:
- kubernetes-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN VERB IS NULL THEN 0 WHEN VERB LIKE '%create%' THEN 1 WHEN
      VERB LIKE '%get%' OR VERB LIKE '%list%' OR VERB LIKE '%watch%' THEN 2 WHEN VERB
      LIKE '%update%' OR VERB LIKE '%patch%' THEN 3 WHEN VERB LIKE '%delete%' THEN
      4 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN VERB IS NULL THEN 0 WHEN VERB LIKE '%create%'
      THEN 1 WHEN VERB LIKE '%get%' OR VERB LIKE '%list%' OR VERB LIKE '%watch%' THEN
      2 WHEN VERB LIKE '%update%' OR VERB LIKE '%patch%' THEN 3 WHEN VERB LIKE '%delete%'
      THEN 4 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN
      2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.authorizations: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('decision', ANNOTATIONS:"authorization.k8s.io/decision"::VARCHAR,
      'policy', OBJECT_CONSTRUCT('desc', ANNOTATIONS:"authorization.k8s.io/reason"::VARCHAR))))::ARRAY
    actor.user.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('name', USER_GROUPS[0])))::ARRAY
    actor.user.name: (USERNAME)::VARCHAR
    actor.user.uid: (USER_UID)::VARCHAR
    api.group.name: (OBJECT_REF_API_GROUP)::VARCHAR
    api.operation: (VERB)::VARCHAR
    api.request.containers: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('pod_uuid', USER_EXTRA:"authentication.kubernetes.io/pod-uid"[0]::VARCHAR)))::ARRAY
    api.response.code: (RESPONSE_STATUS_CODE)::NUMBER
    api.response.data: (RESPONSE_STATUS_DETAILS)::VARIANT
    api.response.error_message: (RESPONSE_STATUS_REASON)::VARCHAR
    api.response.message: (RESPONSE_STATUS_MESSAGE)::VARCHAR
    api.version: (coalesce(OBJECT_REF_API_VERSION, REQUEST_OBJECT_API_VERSION))::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (REQUEST_RECEIVED_TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (REQUEST_RECEIVED_TIMESTAMP)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.url.path: (SPLIT_PART(REQUEST_URI, '?', 1))::VARCHAR
    http_request.url.query_string: (SPLIT_PART(REQUEST_URI, '?', 2))::VARCHAR
    http_request.user_agent: (USER_AGENT)::VARCHAR
    message: NULL::VARCHAR
    metadata.event_code: (verb)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('kubernetes-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('kubernetes')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USERNAME)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IPS[0])::VARCHAR
    raw_data: NULL::VARCHAR
    resources: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('name', OBJECT_REF_NAME, 'namespace',
      OBJECT_REF_NAMESPACE, 'type', OBJECT_REF_RESOURCE, 'uid', RAW:objectRef:uid::VARCHAR,
      'version', RAW:objectRef:resourceVersion::VARCHAR)))::ARRAY
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (SOURCE_IPS[0])::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RESPONSE_STATUS IS NULL THEN 0 WHEN RESPONSE_STATUS
      = 'Success' THEN 1 WHEN RESPONSE_STATUS = 'Failure' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: (RESPONSE_STATUS_CODE)::VARCHAR
    status_detail: (COALESCE(RESPONSE_STATUS_MESSAGE, RESPONSE_STATUS_REASON))::VARCHAR
    status_id: (CASE WHEN RESPONSE_STATUS IS NULL THEN 0 WHEN RESPONSE_STATUS = 'Success'
      THEN 1 WHEN RESPONSE_STATUS = 'Failure' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', request_received_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (request_received_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((600300 + (CASE WHEN VERB IS NULL THEN 0 WHEN VERB LIKE ''%create%''
      THEN 1 WHEN VERB LIKE ''%get%'' OR VERB LIKE ''%list%'' OR VERB LIKE ''%watch%''
      THEN 2 WHEN VERB LIKE ''%update%'' OR VERB LIKE ''%patch%'' THEN 3 WHEN VERB
      LIKE ''%delete%'' THEN 4 ELSE 99 END))::NUMBER) WHEN 600300 THEN ''API Activity:
      Unknown'' WHEN 600301 THEN ''API Activity: Create'' WHEN 600302 THEN ''API Activity:
      Read'' WHEN 600303 THEN ''API Activity: Update'' WHEN 600304 THEN ''API Activity:
      Delete'' WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (600300 + (CASE WHEN VERB IS NULL THEN 0 WHEN VERB LIKE '%create%' THEN
      1 WHEN VERB LIKE '%get%' OR VERB LIKE '%list%' OR VERB LIKE '%watch%' THEN 2
      WHEN VERB LIKE '%update%' OR VERB LIKE '%patch%' THEN 3 WHEN VERB LIKE '%delete%'
      THEN 4 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
