type: mapping
id: lastpass_user_activity_reports_3005_user_access_1.1.0
version: '8'
name: Lastpass User Activity Reports to OCSF class User Access
data-types:
- lastpass-user-activity-reports
mapping:
  fields:
    activity_id: (CASE WHEN ACTION ILIKE ANY ('%add%', '%update%', '%edit%', '%make%')
      THEN 1 WHEN ACTION ILIKE '%delete%' THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99
      END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION ILIKE ANY ('%add%', '%update%', '%edit%',
      '%make%') THEN 1 WHEN ACTION ILIKE '%delete%' THEN 2 WHEN ACTION IS NULL THEN
      0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Assign Privileges'
      WHEN 2 THEN 'Revoke Privileges' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('user_access')::VARCHAR
    class_uid: ('3005')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.ip: (IP_ADDRESS)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('lastpass-user-activity-reports')::VARCHAR
    metadata.product.vendor_name: ('lastpass')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IP_ADDRESS)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (IFF(USERNAME ILIKE '%@%', USERNAME, NULL))::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (IFF(USERNAME NOT ILIKE '%@%', USERNAME, NULL))::VARCHAR
    privileges: (ARRAY_CONSTRUCT(DATA))::ARRAY
    raw_data: NULL::VARCHAR
    resource: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN ACTION ILIKE ANY (''%add%'', ''%update%'', ''%edit%'',
      ''%make%'') THEN 300501 WHEN ACTION ILIKE ''%delete%'' THEN 300502 WHEN ACTION
      IS NULL THEN 300500 ELSE 300599 END)::NUMBER) WHEN 300500 THEN ''User Access
      Management: Unknown'' WHEN 300501 THEN ''User Access Management: Assign Privileges''
      WHEN 300502 THEN ''User Access Management: Revoke Privileges'' WHEN 300599 THEN
      ''User Access Management: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN ACTION ILIKE ANY ('%add%', '%update%', '%edit%', '%make%')
      THEN 300501 WHEN ACTION ILIKE '%delete%' THEN 300502 WHEN ACTION IS NULL THEN
      300500 ELSE 300599 END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (IFF(USERNAME ILIKE '%@%', USERNAME, NULL))::VARCHAR
    user.name: (IFF(USERNAME NOT ILIKE '%@%', USERNAME, NULL))::VARCHAR
  predicate: ACTION ILIKE ANY ('%role%', '%permission%', '%make admin%', '%policy%')
