type: mapping
id: lumos_activity_logs_3003_authorize_session_1.1.0
version: '1'
name: Lumos Activity Logs to OCSF class Authorize Session
data-types:
- lumos-activity-logs
mapping:
  fields:
    activity_id: (1)::NUMBER
    activity_name: (CASE (1::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Assign Privileges'
      WHEN 2 THEN 'Assign Groups' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.invoked_by: (ACTOR_TYPE)::VARCHAR
    api: NULL::VARIANT
    category_name: (CASE (3::NUMBER) WHEN 3 THEN 'Identity & Access Management' END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('authorize_session')::VARCHAR
    class_uid: ('3003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    group: NULL::VARIANT
    message: (EVENT_TYPE_USER_FRIENDLY)::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('lumos-activity-logs')::VARCHAR
    metadata.product.vendor_name: ('lumos')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (TARGETS_EMAIL)::VARCHAR
    privileges: (TARGETS_PERMISSIONS)::ARRAY
    raw_data: NULL::VARCHAR
    session: NULL::VARIANT
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN OUTCOME ILIKE '%SUCCE%' THEN 1 WHEN OUTCOME IS NULL
      THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN
      2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (OUTCOME)::VARCHAR
    status_id: (CASE WHEN OUTCOME ILIKE '%SUCCE%' THEN 1 WHEN OUTCOME IS NULL THEN
      0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_began_at::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_began_at)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (300301::NUMBER) WHEN 300300 THEN ''Authorize Session: Unknown''
      WHEN 300301 THEN ''Authorize Session: Assign Privileges'' WHEN 300302 THEN ''Authorize
      Session: Assign Groups'' WHEN 300399 THEN ''Authorize Session: Other'' END)::VARCHAR'
    type_uid: (300301)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (TARGETS_EMAIL)::VARCHAR
    user.full_name: (ARRAY_TO_STRING(TARGETS_FAMILY_NAME, ' ') || ' ' || ARRAY_TO_STRING(TARGETS_GIVEN_NAME,
      ' '))::VARCHAR
  predicate: EVENT_TYPE = 'SEND_REQUEST_APPROVAL_FOR_ACCESS_REQUEST_SLACK'
