type: mapping
id: mdatp_device_info_5001_inventory_info_1.1.0
version: '14'
name: Mdatp Device Info to OCSF class Inventory Info
data-types:
- mdatp-device-info
mapping:
  fields:
    activity_id: (2)::NUMBER
    activity_name: (CASE ((2)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Log' WHEN
      2 THEN 'Collect' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.session.uid: (PARSE_JSON(LOGGED_ON_USERS[0])[0]:Sid)::VARCHAR
    actor.user.name: (PARSE_JSON(LOGGED_ON_USERS[0])[0]:UserName)::VARCHAR
    api: NULL::VARIANT
    category_name: (CASE ((5)::NUMBER) WHEN 5 THEN 'Discovery' END)::VARCHAR
    category_uid: (5)::NUMBER
    class_name: ('inventory_info')::VARCHAR
    class_uid: ('5001')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.container.tag: (REGISTRY_DEVICE_TAG)::VARCHAR
    device.domain: (PARSE_JSON(LOGGED_ON_USERS[0])[0]:DomainName)::VARCHAR
    device.groups: (ARRAY_CONSTRUCT(MACHINE_GROUP))::ARRAY
    device.hostname: (DEVICE_NAME)::VARCHAR
    device.ip: (PUBLIC_IP)::VARCHAR
    device.name: (DEVICE_NAME)::VARCHAR
    device.os.build: (OS_BUILD)::VARCHAR
    device.os.cpu_bits: (CASE WHEN OS_ARCHITECTURE ILIKE '%64%' THEN 64 WHEN OS_ARCHITECTURE
      ILIKE '%32%' THEN 32 ELSE NULL END)::NUMBER
    device.os.type: (CASE ((CASE WHEN OS_PLATFORM ILIKE '%Windows%' THEN 100 WHEN
      OS_PLATFORM = 'Linux' THEN 200 WHEN OS_PLATFORM = 'macOS' THEN 300 WHEN OS_PLATFORM
      = 'Android' THEN 201 WHEN OS_PLATFORM = 'iOS' THEN 301 WHEN OS_PLATFORM IS NULL
      THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN
      101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN
      300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris'
      WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN OS_PLATFORM ILIKE '%Windows%' THEN 100 WHEN OS_PLATFORM
      = 'Linux' THEN 200 WHEN OS_PLATFORM = 'macOS' THEN 300 WHEN OS_PLATFORM = 'Android'
      THEN 201 WHEN OS_PLATFORM = 'iOS' THEN 301 WHEN OS_PLATFORM IS NULL THEN 0 ELSE
      99 END)::NUMBER
    device.os.version: (OS_VERSION)::VARCHAR
    device.uid: (DEVICE_ID)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('mdatp-device-info')::VARCHAR
    metadata.product.vendor_name: ('mdatp')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PARSE_JSON(LOGGED_ON_USERS[0])[0]:UserName)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.container'''
      type: '''Container'''
      type_id: 27
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DEVICE_NAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PUBLIC_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((99)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (99)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((500199)::NUMBER) WHEN 500100 THEN ''Device Inventory Info:
      Unknown'' WHEN 500101 THEN ''Device Inventory Info: Log'' WHEN 500102 THEN ''Device
      Inventory Info: Collect'' WHEN 500199 THEN ''Device Inventory Info: Other''
      END)::VARCHAR'
    type_uid: (500199)::NUMBER
    unmapped: NULL::VARIANT
