type: mapping
id: mdatp_device_process_events_1007_process_activity_1.1.0
version: '17'
name: Mdatp Device Process Events to OCSF class Process Activity
data-types:
- mdatp-device-process-events
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE='ProcessCreated'
      THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN
      2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE='ProcessCreated'
      THEN 1 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE='ProcessCreated'
      THEN 1 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE='ProcessCreated'
      THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Launch' WHEN
      2 THEN 'Terminate' WHEN 3 THEN 'Open' WHEN 4 THEN 'Inject' WHEN 5 THEN 'Set
      User ID' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    actual_permissions: NULL::NUMBER
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('process_activity')::VARCHAR
    class_uid: ('1007')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (DEVICE_NAME)::VARCHAR
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    exit_code: NULL::NUMBER
    firewall_rule: NULL::VARIANT
    injection_type: NULL::VARCHAR
    injection_type_id: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('mdatp-device-process-events')::VARCHAR
    metadata.product.vendor_name: ('mdatp')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    module: NULL::VARIANT
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DEVICE_NAME)::VARCHAR
    - name: '''process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (FILE_NAME)::VARCHAR
    - name: '''process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (INITIATING_PROCESS_FILE_NAME)::VARCHAR
    - name: '''process.parent_process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.parent_process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (INITIATING_PROCESS_PARENT_FILE_NAME)::VARCHAR
    - name: '''process.parent_process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (INITIATING_PROCESS_ACCOUNT_NAME)::VARCHAR
    - name: '''process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (ACCOUNT_NAME)::VARCHAR
    process.cmd_line: (PROCESS_COMMAND_LINE)::VARCHAR
    process.created_time: (date_part('epoch_milliseconds', (PROCESS_CREATION_TIME)::TIMESTAMP_LTZ))::NUMBER
    process.created_time_dt: (PROCESS_CREATION_TIME)::TIMESTAMP_LTZ
    process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      CASE (CASE WHEN SHA256 IS NULL AND SHA1 IS NULL AND MD5 IS NULL THEN 0 WHEN
      SHA256 IS NOT NULL THEN 3 WHEN SHA1 IS NOT NULL THEN 2 WHEN MD5 IS NOT NULL
      THEN 1 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'MD5' WHEN 2 THEN 'SHA-1'
      WHEN 3 THEN 'SHA-256' WHEN 4 THEN 'SHA-512' WHEN 5 THEN 'CTPH' WHEN 6 THEN 'TLSH'
      WHEN 7 THEN 'quickXorHash' WHEN 99 THEN 'Other' END, 'algorithm_id', CASE WHEN
      SHA256 IS NULL AND SHA1 IS NULL AND MD5 IS NULL THEN 0 WHEN SHA256 IS NOT NULL
      THEN 3 WHEN SHA1 IS NOT NULL THEN 2 WHEN MD5 IS NOT NULL THEN 1 END::NUMBER,
      'value', COALESCE(SHA256, SHA1, MD5)::VARCHAR)))::ARRAY
    process.file.name: (FILE_NAME)::VARCHAR
    process.file.path: (FOLDER_PATH)::VARCHAR
    process.integrity: (CASE ((CASE WHEN PROCESS_INTEGRITY_LEVEL IS NULL THEN 0 WHEN
      PROCESS_INTEGRITY_LEVEL = 'Untrusted' THEN 1 WHEN PROCESS_INTEGRITY_LEVEL =
      'Low' THEN 2 WHEN PROCESS_INTEGRITY_LEVEL = 'Medium' THEN 3 WHEN PROCESS_INTEGRITY_LEVEL
      = 'High' THEN 4 WHEN PROCESS_INTEGRITY_LEVEL = 'System' THEN 5 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Untrusted' WHEN 2 THEN 'Low' WHEN 3 THEN
      'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'System' WHEN 6 THEN 'Protected' WHEN
      99 THEN 'Other' END)::VARCHAR
    process.integrity_id: (CASE WHEN PROCESS_INTEGRITY_LEVEL IS NULL THEN 0 WHEN PROCESS_INTEGRITY_LEVEL
      = 'Untrusted' THEN 1 WHEN PROCESS_INTEGRITY_LEVEL = 'Low' THEN 2 WHEN PROCESS_INTEGRITY_LEVEL
      = 'Medium' THEN 3 WHEN PROCESS_INTEGRITY_LEVEL = 'High' THEN 4 WHEN PROCESS_INTEGRITY_LEVEL
      = 'System' THEN 5 ELSE 99 END)::NUMBER
    process.parent_process.cmd_line: (INITIATING_PROCESS_COMMAND_LINE)::VARCHAR
    process.parent_process.created_time: (date_part('epoch_milliseconds', (INITIATING_PROCESS_CREATION_TIME)::TIMESTAMP_LTZ))::NUMBER
    process.parent_process.created_time_dt: (INITIATING_PROCESS_CREATION_TIME)::TIMESTAMP_LTZ
    process.parent_process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      CASE (CASE WHEN INITIATING_PROCESS_SHA256 IS NULL AND INITIATING_PROCESS_SHA1
      IS NULL AND INITIATING_PROCESS_MD5 IS NULL THEN 0 WHEN INITIATING_PROCESS_SHA256
      IS NOT NULL THEN 3 WHEN INITIATING_PROCESS_SHA1 IS NOT NULL THEN 2 WHEN INITIATING_PROCESS_MD5
      IS NOT NULL THEN 1 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'MD5' WHEN
      2 THEN 'SHA-1' WHEN 3 THEN 'SHA-256' WHEN 4 THEN 'SHA-512' WHEN 5 THEN 'CTPH'
      WHEN 6 THEN 'TLSH' WHEN 7 THEN 'quickXorHash' WHEN 99 THEN 'Other' END, 'algorithm_id',
      CASE WHEN INITIATING_PROCESS_SHA256 IS NULL AND INITIATING_PROCESS_SHA1 IS NULL
      AND INITIATING_PROCESS_MD5 IS NULL THEN 0 WHEN INITIATING_PROCESS_SHA256 IS
      NOT NULL THEN 3 WHEN INITIATING_PROCESS_SHA1 IS NOT NULL THEN 2 WHEN INITIATING_PROCESS_MD5
      IS NOT NULL THEN 1 END::NUMBER, 'value', COALESCE(INITIATING_PROCESS_SHA256,
      INITIATING_PROCESS_SHA1, INITIATING_PROCESS_MD5)::VARCHAR)))::ARRAY
    process.parent_process.file.name: (INITIATING_PROCESS_FILE_NAME)::VARCHAR
    process.parent_process.file.path: (INITIATING_PROCESS_FOLDER_PATH)::VARCHAR
    process.parent_process.integrity: (CASE ((CASE WHEN INITIATING_PROCESS_INTEGRITY_LEVEL
      IS NULL THEN 0 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL = 'Untrusted' THEN 1
      WHEN INITIATING_PROCESS_INTEGRITY_LEVEL = 'Low' THEN 2 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL
      = 'Medium' THEN 3 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL = 'High' THEN 4 WHEN
      INITIATING_PROCESS_INTEGRITY_LEVEL = 'System' THEN 5 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Untrusted' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium'
      WHEN 4 THEN 'High' WHEN 5 THEN 'System' WHEN 6 THEN 'Protected' WHEN 99 THEN
      'Other' END)::VARCHAR
    process.parent_process.integrity_id: (CASE WHEN INITIATING_PROCESS_INTEGRITY_LEVEL
      IS NULL THEN 0 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL = 'Untrusted' THEN 1
      WHEN INITIATING_PROCESS_INTEGRITY_LEVEL = 'Low' THEN 2 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL
      = 'Medium' THEN 3 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL = 'High' THEN 4 WHEN
      INITIATING_PROCESS_INTEGRITY_LEVEL = 'System' THEN 5 ELSE 99 END)::NUMBER
    process.parent_process.parent_process.created_time: (date_part('epoch_milliseconds',
      (INITIATING_PROCESS_PARENT_CREATION_TIME)::TIMESTAMP_LTZ))::NUMBER
    process.parent_process.parent_process.created_time_dt: (INITIATING_PROCESS_PARENT_CREATION_TIME)::TIMESTAMP_LTZ
    process.parent_process.parent_process.file.name: (INITIATING_PROCESS_PARENT_FILE_NAME)::VARCHAR
    process.parent_process.parent_process.pid: (INITIATING_PROCESS_PARENT_ID)::NUMBER
    process.parent_process.pid: (INITIATING_PROCESS_ID)::NUMBER
    process.parent_process.user.domain: (INITIATING_PROCESS_ACCOUNT_DOMAIN)::VARCHAR
    process.parent_process.user.name: (INITIATING_PROCESS_ACCOUNT_NAME)::VARCHAR
    process.parent_process.user.uid: (INITIATING_PROCESS_ACCOUNT_SID)::VARCHAR
    process.pid: (PROCESS_ID)::NUMBER
    process.uid: (DEVICE_ID::VARCHAR || ':' || TO_CHAR(PROCESS_CREATION_TIME::TIMESTAMP_LTZ,'YYYY-MM-DD')
      || ':' || PROCESS_ID)::VARCHAR
    process.user.domain: (ACCOUNT_DOMAIN)::VARCHAR
    process.user.name: (ACCOUNT_NAME)::VARCHAR
    process.user.uid: (ACCOUNT_SID)::VARCHAR
    raw_data: NULL::VARCHAR
    requested_permissions: NULL::NUMBER
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100700 + (CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE=''ProcessCreated''
      THEN 1 ELSE 99 END))::NUMBER) WHEN 100700 THEN ''Process Activity: Unknown''
      WHEN 100701 THEN ''Process Activity: Launch'' WHEN 100702 THEN ''Process Activity:
      Terminate'' WHEN 100703 THEN ''Process Activity: Open'' WHEN 100704 THEN ''Process
      Activity: Inject'' WHEN 100705 THEN ''Process Activity: Set User ID'' WHEN 100799
      THEN ''Process Activity: Other'' END)::VARCHAR'
    type_uid: (100700 + (CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE='ProcessCreated'
      THEN 1 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
