type: mapping
id: mdatp_device_network_events_4001_network_activity_1.1.0
version: '21'
name: Mdatp Device Network Events to OCSF class Network Activity
data-types:
- mdatp-device-network-events
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION_TYPE ILIKE ANY ('%ConnectionSuccess%', '%ConnectionCreated%',
      '%ConnectionAccepted%', '%ConnectionFound%') THEN 1 WHEN ACTION_TYPE ILIKE '%ConnectionFailed%'
      THEN 2 WHEN ACTION_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION_TYPE ILIKE ANY ('%ConnectionSuccess%', '%ConnectionCreated%',
      '%ConnectionAccepted%', '%ConnectionFound%') THEN 1 WHEN ACTION_TYPE ILIKE '%ConnectionFailed%'
      THEN 2 WHEN ACTION_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN ACTION_TYPE ILIKE ANY ('%ConnectionSuccess%', '%ConnectionCreated%',
      '%ConnectionAccepted%', '%ConnectionFound%') THEN 1 WHEN ACTION_TYPE ILIKE '%ConnectionFailed%'
      THEN 4 WHEN ACTION_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION_TYPE ILIKE ANY ('%ConnectionSuccess%',
      '%ConnectionCreated%', '%ConnectionAccepted%', '%ConnectionFound%') THEN 1 WHEN
      ACTION_TYPE ILIKE '%ConnectionFailed%' THEN 4 WHEN ACTION_TYPE IS NULL THEN
      0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2 THEN
      'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN 6 THEN
      'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (INITIATING_PROCESS_COMMAND_LINE)::VARCHAR
    actor.process.container.uid: (APP_GUARD_CONTAINER_ID)::VARCHAR
    actor.process.created_time: (date_part('epoch_milliseconds', (INITIATING_PROCESS_CREATION_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.created_time_dt: (INITIATING_PROCESS_CREATION_TIME)::TIMESTAMP_LTZ
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      CASE (CASE WHEN INITIATING_PROCESS_SHA1 IS NULL AND INITIATING_PROCESS_MD5 IS
      NULL THEN 0 WHEN INITIATING_PROCESS_SHA1 IS NOT NULL THEN 2 WHEN INITIATING_PROCESS_MD5
      IS NOT NULL THEN 1 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'MD5' WHEN
      2 THEN 'SHA-1' WHEN 3 THEN 'SHA-256' WHEN 4 THEN 'SHA-512' WHEN 5 THEN 'CTPH'
      WHEN 6 THEN 'TLSH' WHEN 7 THEN 'quickXorHash' WHEN 99 THEN 'Other' END, 'algorithm_id',
      CASE WHEN INITIATING_PROCESS_SHA1 IS NULL AND INITIATING_PROCESS_MD5 IS NULL
      THEN 0 WHEN INITIATING_PROCESS_SHA1 IS NOT NULL THEN 2 WHEN INITIATING_PROCESS_MD5
      IS NOT NULL THEN 1 END::NUMBER, 'value', COALESCE(INITIATING_PROCESS_SHA1, INITIATING_PROCESS_MD5)::VARCHAR)))::ARRAY
    actor.process.file.name: (INITIATING_PROCESS_FILE_NAME)::VARCHAR
    actor.process.file.path: (INITIATING_PROCESS_FOLDER_PATH)::VARCHAR
    actor.process.integrity: (CASE ((CASE WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='Untrusted'
      THEN 1 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='Low' THEN 2 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='Medium'
      THEN 3 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='High' THEN 4 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='System'
      THEN 5 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='Protected' THEN 6 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL
      IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Untrusted'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'System'
      WHEN 6 THEN 'Protected' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.integrity_id: (CASE WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='Untrusted'
      THEN 1 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='Low' THEN 2 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='Medium'
      THEN 3 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='High' THEN 4 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='System'
      THEN 5 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL='Protected' THEN 6 WHEN INITIATING_PROCESS_INTEGRITY_LEVEL
      IS NULL THEN 0 ELSE 99 END)::NUMBER
    actor.process.parent_process.created_time: (date_part('epoch_milliseconds', (INITIATING_PROCESS_PARENT_CREATION_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.parent_process.created_time_dt: (INITIATING_PROCESS_PARENT_CREATION_TIME)::TIMESTAMP_LTZ
    actor.process.parent_process.name: (INITIATING_PROCESS_PARENT_FILE_NAME)::VARCHAR
    actor.process.parent_process.pid: (INITIATING_PROCESS_PARENT_ID)::NUMBER
    actor.process.pid: (INITIATING_PROCESS_ID)::NUMBER
    actor.process.user.account.name: (INITIATING_PROCESS_ACCOUNT_NAME)::VARCHAR
    actor.process.user.account.uid: (INITIATING_PROCESS_ACCOUNT_SID)::VARCHAR
    actor.process.user.domain: (INITIATING_PROCESS_ACCOUNT_DOMAIN)::VARCHAR
    api: NULL::VARIANT
    app_name: (INITIATING_PROCESS_FILE_NAME)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (DEVICE_NAME)::VARCHAR
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.hostname: (CASE WHEN REMOTE_URL ILIKE '%http%' THEN PARSE_URL(REMOTE_URL,1):host
      ELSE REMOTE_URL END)::VARCHAR
    dst_endpoint.ip: (REMOTE_IP)::VARCHAR
    dst_endpoint.port: (REMOTE_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('mdatp-device-network-events')::VARCHAR
    metadata.product.vendor_name: ('mdatp')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.container'''
      type: '''Container'''
      type_id: 27
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (INITIATING_PROCESS_FILE_NAME)::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (INITIATING_PROCESS_PARENT_FILE_NAME)::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DEVICE_NAME)::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (CASE WHEN REMOTE_URL ILIKE '%http%' THEN PARSE_URL(REMOTE_URL,1):host
        ELSE REMOTE_URL END)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (REMOTE_IP)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (LOCAL_IP)::VARCHAR
    - name: '''url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (PARSE_URL(REMOTE_URL,1):host)::VARCHAR
    - name: '''url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (REMOTE_URL)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (LOCAL_IP)::VARCHAR
    src_endpoint.port: (LOCAL_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400100 + (CASE WHEN ACTION_TYPE=''ConnectionSuccess'' THEN
      1 WHEN ACTION_TYPE=''ConnectionFailed'' THEN 4 WHEN ACTION_TYPE IS NULL THEN
      0 ELSE 99 END))::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown'' WHEN
      400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400100 + (CASE WHEN ACTION_TYPE='ConnectionSuccess' THEN 1 WHEN ACTION_TYPE='ConnectionFailed'
      THEN 4 WHEN ACTION_TYPE IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url.hostname: (PARSE_URL(REMOTE_URL,1):host)::VARCHAR
    url.path: (PARSE_URL(REMOTE_URL,1):path)::VARCHAR
    url.port: (PARSE_URL(REMOTE_URL,1):port)::NUMBER
    url.query_string: (PARSE_URL(REMOTE_URL,1):query)::VARCHAR
    url.scheme: (PARSE_URL(REMOTE_URL,1):scheme)::VARCHAR
    url.url_string: (REMOTE_URL)::VARCHAR
