type: mapping
id: mdatp_device_image_load_events_1005_module_activity_1.1.0
version: '3'
name: Mdatp Device Image Load Events to OCSF class Module Activity
data-types:
- mdatp-device-image-load-events
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE ILIKE '%load%'
      THEN 1 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE ILIKE
      '%load%' THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Load'
      WHEN 2 THEN 'Unload' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (INITIATING_PROCESS_COMMAND_LINE)::VARCHAR
    actor.process.created_time: (date_part('epoch_milliseconds', (INITIATING_PROCESS_CREATION_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.created_time_dt: (INITIATING_PROCESS_CREATION_TIME)::TIMESTAMP_LTZ
    actor.process.file.hashes: (ARRAY_CONSTRUCT( OBJECT_CONSTRUCT_KEEP_NULL('algorithm_id',
      CASE WHEN INITIATING_PROCESS_SHA1 IS NOT NULL THEN 2 WHEN INITIATING_PROCESS_MD5
      IS NOT NULL THEN 1 END::NUMBER, 'algorithm', CASE WHEN INITIATING_PROCESS_SHA1
      IS NOT NULL THEN 'SHA-1' WHEN INITIATING_PROCESS_MD5 IS NOT NULL THEN 'MD5'
      END::VARCHAR, 'value', COALESCE(INITIATING_PROCESS_SHA1, INITIATING_PROCESS_MD5)::VARCHAR)))::ARRAY
    actor.process.file.name: (INITIATING_PROCESS_FILE_NAME)::VARCHAR
    actor.process.file.path: (INITIATING_PROCESS_FOLDER_PATH)::VARCHAR
    actor.process.integrity: (CASE ((CASE INITIATING_PROCESS_INTEGRITY_LEVEL::VARCHAR
      WHEN 'Untrusted' THEN 1 WHEN 'Low' THEN 2 WHEN 'Medium' THEN 3 WHEN 'High' THEN
      4 WHEN 'System' THEN 5 ELSE 0 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Untrusted' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5
      THEN 'System' WHEN 6 THEN 'Protected' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.integrity_id: (CASE INITIATING_PROCESS_INTEGRITY_LEVEL::VARCHAR
      WHEN 'Untrusted' THEN 1 WHEN 'Low' THEN 2 WHEN 'Medium' THEN 3 WHEN 'High' THEN
      4 WHEN 'System' THEN 5 ELSE 0 END)::NUMBER
    actor.process.parent_process.created_time: (date_part('epoch_milliseconds', (INITIATING_PROCESS_PARENT_CREATION_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.parent_process.created_time_dt: (INITIATING_PROCESS_PARENT_CREATION_TIME)::TIMESTAMP_LTZ
    actor.process.parent_process.file.name: (INITIATING_PROCESS_PARENT_FILE_NAME)::VARCHAR
    actor.process.parent_process.pid: (INITIATING_PROCESS_PARENT_ID)::NUMBER
    actor.process.pid: (INITIATING_PROCESS_ID)::NUMBER
    actor.process.user.account.name: (INITIATING_PROCESS_ACCOUNT_NAME)::VARCHAR
    actor.process.user.account.uid: (INITIATING_PROCESS_ACCOUNT_SID)::VARCHAR
    actor.process.user.domain: (INITIATING_PROCESS_ACCOUNT_DOMAIN)::VARCHAR
    api.operation: (OPERATION_NAME)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('module_activity')::VARCHAR
    class_uid: ('1005')::NUMBER
    cloud.org.uid: (TENANT_ID)::VARCHAR
    cloud.provider: ('Microsoft Defender')::VARCHAR
    count: NULL::NUMBER
    device.container.uid: (APP_GUARD_CONTAINER_ID)::VARCHAR
    device.hostname: (DEVICE_NAME)::VARCHAR
    device.type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN
      10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (0)::NUMBER
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('mdatp-device-image-load-events')::VARCHAR
    metadata.product.vendor_name: ('mdatp')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    module.file.hashes: (ARRAY_CONSTRUCT( OBJECT_CONSTRUCT_KEEP_NULL('algorithm_id',
      CASE WHEN SHA1 IS NOT NULL THEN 2 WHEN MD5 IS NOT NULL THEN 1 END::NUMBER, 'algorithm',
      CASE WHEN SHA1 IS NOT NULL THEN 'SHA-1' WHEN MD5 IS NOT NULL THEN 'MD5' END::VARCHAR,
      'value', COALESCE(SHA1, MD5)::VARCHAR)))::ARRAY
    module.file.name: (FILE_NAME)::VARCHAR
    module.file.path: (FOLDER_PATH)::VARCHAR
    module.load_type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Standard'
      WHEN 2 THEN 'Non Standard' WHEN 3 THEN 'ShellCode' WHEN 4 THEN 'Mapped' WHEN
      5 THEN 'NonStandard Backed' WHEN 99 THEN 'Other' END)::VARCHAR
    module.load_type_id: (0)::NUMBER
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (INITIATING_PROCESS_FILE_NAME)::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (INITIATING_PROCESS_PARENT_FILE_NAME)::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.container'''
      type: '''Container'''
      type_id: 27
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DEVICE_NAME)::VARCHAR
    - name: '''module.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''module.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (FILE_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100500 + (CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE
      ILIKE ''%load%'' THEN 1 ELSE 99 END))::NUMBER) WHEN 100500 THEN ''Module Activity:
      Unknown'' WHEN 100501 THEN ''Module Activity: Load'' WHEN 100502 THEN ''Module
      Activity: Unload'' WHEN 100599 THEN ''Module Activity: Other'' END)::VARCHAR'
    type_uid: (100500 + (CASE WHEN ACTION_TYPE IS NULL THEN 0 WHEN ACTION_TYPE ILIKE
      '%load%' THEN 1 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
