type: mapping
id: mdatp_device_file_events_1001_file_activity_1.1.0
version: '16'
name: Mdatp Device File Events to OCSF class File Activity
data-types:
- mdatp-device-file-events
mapping:
  fields:
    access_mask: NULL::NUMBER
    action: (CASE ((99)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN
      2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (99)::NUMBER
    activity_id: (CASE ACTION_TYPE WHEN 'FileCreated' THEN 1 WHEN 'FileModified' THEN
      3 WHEN 'FileDeleted' THEN 4 WHEN 'FileRenamed' THEN 5 ELSE 0 END)::NUMBER
    activity_name: (CASE ((CASE ACTION_TYPE WHEN 'FileCreated' THEN 1 WHEN 'FileModified'
      THEN 3 WHEN 'FileDeleted' THEN 4 WHEN 'FileRenamed' THEN 5 ELSE 0 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 10 THEN 'Encrypt' WHEN 11 THEN
      'Decrypt' WHEN 12 THEN 'Mount' WHEN 13 THEN 'Unmount' WHEN 14 THEN 'Open' WHEN
      2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete' WHEN 5 THEN 'Rename'
      WHEN 6 THEN 'Set Attributes' WHEN 7 THEN 'Set Security' WHEN 8 THEN 'Get Attributes'
      WHEN 9 THEN 'Get Security' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (INITIATING_PROCESS_COMMAND_LINE)::VARCHAR
    actor.process.created_time: (date_part('epoch_milliseconds', (INITIATING_PROCESS_CREATION_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.created_time_dt: (INITIATING_PROCESS_CREATION_TIME)::TIMESTAMP_LTZ
    actor.process.file.owner.account.name: (INITIATING_PROCESS_ACCOUNT_NAME)::VARCHAR
    actor.process.file.owner.account.uid: (INITIATING_PROCESS_ACCOUNT_SID)::VARCHAR
    actor.process.file.owner.domain: (INITIATING_PROCESS_ACCOUNT_DOMAIN)::VARCHAR
    actor.process.file.owner.uid: (INITIATING_PROCESS_ACCOUNT_SID)::VARCHAR
    actor.process.file.parent_folder: (INITIATING_PROCESS_FOLDER_PATH)::VARCHAR
    actor.process.integrity: (CASE ((CASE INITIATING_PROCESS_INTEGRITY_LEVEL::VARCHAR
      WHEN 'Untrusted' THEN 1 WHEN 'Low' THEN 2 WHEN 'Medium' THEN 3 WHEN 'High' THEN
      4 WHEN 'System' THEN 5 ELSE 0 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Untrusted' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5
      THEN 'System' WHEN 6 THEN 'Protected' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.integrity_id: (CASE INITIATING_PROCESS_INTEGRITY_LEVEL::VARCHAR
      WHEN 'Untrusted' THEN 1 WHEN 'Low' THEN 2 WHEN 'Medium' THEN 3 WHEN 'High' THEN
      4 WHEN 'System' THEN 5 ELSE 0 END)::NUMBER
    actor.process.parent_process.created_time: (date_part('epoch_milliseconds', (INITIATING_PROCESS_PARENT_CREATION_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.parent_process.created_time_dt: (INITIATING_PROCESS_PARENT_CREATION_TIME)::TIMESTAMP_LTZ
    actor.process.parent_process.file.name: (INITIATING_PROCESS_PARENT_FILE_NAME)::VARCHAR
    actor.process.parent_process.pid: (INITIATING_PROCESS_PARENT_ID)::NUMBER
    actor.process.pid: (INITIATING_PROCESS_ID)::NUMBER
    api.operation: (OPERATION_NAME)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: NULL::VARCHAR
    category_uid: NULL::NUMBER
    class_name: ('file_activity')::VARCHAR
    class_uid: ('1001')::NUMBER
    cloud: NULL::VARIANT
    component: NULL::VARCHAR
    connection_uid: NULL::VARCHAR
    count: NULL::NUMBER
    create_mask: NULL::VARCHAR
    device.container.uid: (APP_GUARD_CONTAINER_ID)::VARCHAR
    device.hostname: (DEVICE_NAME)::VARCHAR
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    file.confidentiality: (CASE ((CASE WHEN SENSITIVITY_LABEL='Public' THEN 1 WHEN
      SENSITIVITY_LABEL='Confidential' THEN 2 WHEN SENSITIVITY_LABEL='Internal' THEN
      3 WHEN SENSITIVITY_LABEL='Restricted' THEN 4 WHEN SENSITIVITY_LABEL IS NULL
      THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Not Confidential'
      WHEN 2 THEN 'Confidential' WHEN 3 THEN 'Secret' WHEN 4 THEN 'Top Secret' WHEN
      99 THEN 'Other' END)::VARCHAR
    file.confidentiality_id: (CASE WHEN SENSITIVITY_LABEL='Public' THEN 1 WHEN SENSITIVITY_LABEL='Confidential'
      THEN 2 WHEN SENSITIVITY_LABEL='Internal' THEN 3 WHEN SENSITIVITY_LABEL='Restricted'
      THEN 4 WHEN SENSITIVITY_LABEL IS NULL THEN 0 ELSE 99 END)::NUMBER
    file.created_time: (date_part('epoch_milliseconds', (TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    file.created_time_dt: (TIMESTAMP)::TIMESTAMP_LTZ
    file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm', CASE (CASE
      WHEN MD5 is not null THEN 1 WHEN SHA1 is not null THEN 2 WHEN SHA256 is not
      null THEN 3 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'MD5' WHEN
      2 THEN 'SHA-1' WHEN 3 THEN 'SHA-256' WHEN 4 THEN 'SHA-512' WHEN 5 THEN 'CTPH'
      WHEN 6 THEN 'TLSH' WHEN 7 THEN 'quickXorHash' WHEN 99 THEN 'Other' END, 'algorithm_id',
      CASE WHEN MD5 is not null THEN 1 WHEN SHA1 is not null THEN 2 WHEN SHA256 is
      not null THEN 3 ELSE 99 END::NUMBER)))::ARRAY
    file.name: (FILE_NAME)::VARCHAR
    file.path: (FOLDER_PATH)::VARCHAR
    file_diff: NULL::VARCHAR
    file_result: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('mdatp-device-file-events')::VARCHAR
    metadata.product.vendor_name: ('mdatp')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.owner'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (INITIATING_PROCESS_PARENT_FILE_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.container'''
      type: '''Container'''
      type_id: 27
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DEVICE_NAME)::VARCHAR
    - name: '''file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (FILE_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE ACTION_TYPE WHEN ''FileCreated'' THEN 100101 WHEN ''FileModified''
      THEN 100103 WHEN ''FileDeleted'' THEN 100104 WHEN ''FileRenamed'' THEN 100105
      ELSE 100100 END)::NUMBER) WHEN 100100 THEN ''File System Activity: Unknown''
      WHEN 100101 THEN ''File System Activity: Create'' WHEN 100102 THEN ''File System
      Activity: Read'' WHEN 100103 THEN ''File System Activity: Update'' WHEN 100104
      THEN ''File System Activity: Delete'' WHEN 100105 THEN ''File System Activity:
      Rename'' WHEN 100106 THEN ''File System Activity: Set Attributes'' WHEN 100107
      THEN ''File System Activity: Set Security'' WHEN 100108 THEN ''File System Activity:
      Get Attributes'' WHEN 100109 THEN ''File System Activity: Get Security'' WHEN
      100110 THEN ''File System Activity: Encrypt'' WHEN 100111 THEN ''File System
      Activity: Decrypt'' WHEN 100112 THEN ''File System Activity: Mount'' WHEN 100113
      THEN ''File System Activity: Unmount'' WHEN 100114 THEN ''File System Activity:
      Open'' WHEN 100199 THEN ''File System Activity: Other'' END)::VARCHAR'
    type_uid: (CASE ACTION_TYPE WHEN 'FileCreated' THEN 100101 WHEN 'FileModified'
      THEN 100103 WHEN 'FileDeleted' THEN 100104 WHEN 'FileRenamed' THEN 100105 ELSE
      100100 END)::NUMBER
    unmapped: NULL::VARIANT
