type: mapping
id: meraki_networks_5001_inventory_info_1.1.0
version: '1'
name: Meraki Networks to OCSF class Inventory Info
data-types:
- meraki-networks
mapping:
  fields:
    activity_id: (2)::NUMBER
    activity_name: (CASE (2::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Log' WHEN
      2 THEN 'Collect' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE (5::NUMBER) WHEN 5 THEN 'Discovery' END)::VARCHAR
    category_uid: (5)::NUMBER
    class_name: ('inventory_info')::VARCHAR
    class_uid: ('5001')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (PARSE_URL(URL,1):host)::VARCHAR
    device.name: (NAME)::VARCHAR
    device.org.uid: (ORGANIZATION_ID)::VARCHAR
    device.type: (CASE (CASE WHEN PRODUCT_TYPES[0] = 'appliance' THEN 9 WHEN PRODUCT_TYPES[0]
      = 'switch' THEN 10 WHEN PRODUCT_TYPES[0] = 'systemsManager' THEN 5 WHEN PRODUCT_TYPES[0]
      IN ('wireless', 'cellularGateway', 'sensor', 'camera') THEN 7 ELSE 99 END::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN 10 THEN 'Switch' WHEN 11 THEN
      'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop' WHEN 4 THEN 'Tablet' WHEN 5
      THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN 'IOT' WHEN 8 THEN 'Browser'
      WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN PRODUCT_TYPES[0] = 'appliance' THEN 9 WHEN PRODUCT_TYPES[0]
      = 'switch' THEN 10 WHEN PRODUCT_TYPES[0] = 'systemsManager' THEN 5 WHEN PRODUCT_TYPES[0]
      IN ('wireless', 'cellularGateway', 'sensor', 'camera') THEN 7 ELSE 99 END)::NUMBER
    device.uid: (ID)::VARCHAR
    device.zone: (TIME_ZONE)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: (NOTES)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('meraki-networks')::VARCHAR
    metadata.product.vendor_name: ('meraki')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (PARSE_URL(URL,1):host)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', pull_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (pull_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (500102::NUMBER) WHEN 500100 THEN ''Device Inventory Info: Unknown''
      WHEN 500101 THEN ''Device Inventory Info: Log'' WHEN 500102 THEN ''Device Inventory
      Info: Collect'' WHEN 500199 THEN ''Device Inventory Info: Other'' END)::VARCHAR'
    type_uid: (500102)::NUMBER
    unmapped: NULL::VARIANT
