type: mapping
id: microsoft_365_defender_advanced_hunting_3002_authentication_1.1.0
version: '6'
name: Microsoft 365 Defender Advanced Hunting to OCSF class Authentication
data-types:
- microsoft-365-defender-advanced-hunting
mapping:
  fields:
    activity_id: (1)::NUMBER
    activity_name: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN
      2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket' WHEN 4 THEN 'Service Ticket
      Request' WHEN 5 THEN 'Service Ticket Renew' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: (CASE ((CASE WHEN PROPERTIES:LogonType ILIKE '%OAuth2%' THEN 6
      WHEN PROPERTIES:LogonType ILIKE '%Saml%' THEN 5 WHEN PROPERTIES:LogonType IS
      NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'NTLM' WHEN
      10 THEN 'RADIUS' WHEN 2 THEN 'Kerberos' WHEN 3 THEN 'Digest' WHEN 4 THEN 'OpenID'
      WHEN 5 THEN 'SAML' WHEN 6 THEN 'OAUTH 2.0' WHEN 7 THEN 'PAP' WHEN 8 THEN 'CHAP'
      WHEN 9 THEN 'EAP' WHEN 99 THEN 'Other' END)::VARCHAR
    auth_protocol_id: (CASE WHEN PROPERTIES:LogonType ILIKE '%OAuth2%' THEN 6 WHEN
      PROPERTIES:LogonType ILIKE '%Saml%' THEN 5 WHEN PROPERTIES:LogonType IS NULL
      THEN 0 ELSE 99 END)::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud.provider: ('Microsoft Defender')::VARCHAR
    count: NULL::NUMBER
    device.location.country: (PROPERTIES:Location)::VARCHAR
    device.name: (PROPERTIES:DeviceName)::VARCHAR
    device.os.name: (PROPERTIES:OSPlatform)::VARCHAR
    device.type: (CASE ((CASE WHEN PROPERTIES:DeviceType='Desktop' THEN 2 WHEN PROPERTIES:DeviceType='Mobile'
      THEN 5 WHEN PROPERTIES:DeviceType='Tablet' THEN 4 WHEN PROPERTIES:DeviceType
      IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server'
      WHEN 10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN PROPERTIES:DeviceType='Desktop' THEN 2 WHEN PROPERTIES:DeviceType='Mobile'
      THEN 5 WHEN PROPERTIES:DeviceType='Tablet' THEN 4 WHEN PROPERTIES:DeviceType
      IS NULL THEN 0 ELSE 99 END)::NUMBER
    dst_endpoint.hostname: (PROPERTIES:DestinationDeviceName)::VARCHAR
    dst_endpoint.ip: (PROPERTIES:DestinationIPAddress)::VARCHAR
    dst_endpoint.port: (PROPERTIES:DestinationPort)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('microsoft-365-defender-advanced-hunting')::VARCHAR
    metadata.product.vendor_name: ('microsoft-defender')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (PROPERTIES:DestinationDeviceName)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PROPERTIES:DestinationIPAddress)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PROPERTIES:IPAddress)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (PROPERTIES:AccountUpn)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PROPERTIES:AccountName)::VARCHAR
    raw_data: NULL::VARCHAR
    service.name: (PROPERTIES:ISP)::VARCHAR
    session: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (PROPERTIES:IPAddress)::VARCHAR
    src_endpoint.port: (PROPERTIES:Port)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN PROPERTIES:ActionType='LogonSuccess' THEN 1 WHEN PROPERTIES:ActionType='LogonFailed'
      THEN 2 WHEN PROPERTIES:ActionType IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other'
      END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (COALESCE(PROPERTIES:FailureReason, PROPERTIES:ActionType))::VARCHAR
    status_id: (CASE WHEN PROPERTIES:ActionType='LogonSuccess' THEN 1 WHEN PROPERTIES:ActionType='LogonFailed'
      THEN 2 WHEN PROPERTIES:ActionType IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300201)::NUMBER) WHEN 300200 THEN ''Authentication: Unknown''
      WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (300201)::NUMBER
    unmapped: NULL::VARIANT
    user.account.uid: (PROPERTIES:AccountObjectId)::VARCHAR
    user.domain: (PROPERTIES:AccountDomain)::VARCHAR
    user.email_addr: (PROPERTIES:AccountUpn)::VARCHAR
    user.full_name: (COALESCE(PROPERTIES:AdditionalFields:"ACTOR.ENTITY_USER", PROPERTIES:AdditionalFields:"ACTOR.ALIAS"))::VARCHAR
    user.name: (PROPERTIES:AccountName)::VARCHAR
    user.org.uid: (TENANT_ID)::VARCHAR
  predicate: CATEGORY ILIKE '%IdentityLogonEvents%'
