type: mapping
id: microsoft_365_defender_advanced_hunting_1004_memory_activity_1.1.0
version: '3'
name: Microsoft 365 Defender Advanced Hunting to OCSF class Memory Activity
data-types:
- microsoft-365-defender-advanced-hunting
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN PROPERTIES:ActionType ILIKE '%allocate%' THEN 1 WHEN PROPERTIES:ActionType
      ILIKE '%protect%' THEN 2 WHEN PROPERTIES:ActionType ILIKE '%read%' THEN 7 WHEN
      PROPERTIES:ActionType IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN PROPERTIES:ActionType ILIKE '%allocate%' THEN
      1 WHEN PROPERTIES:ActionType ILIKE '%protect%' THEN 2 WHEN PROPERTIES:ActionType
      ILIKE '%read%' THEN 7 WHEN PROPERTIES:ActionType IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allocate Page' WHEN 2 THEN 'Modify Page'
      WHEN 3 THEN 'Delete Page' WHEN 4 THEN 'Buffer Overflow' WHEN 5 THEN 'Disable
      DEP' WHEN 6 THEN 'Enable DEP' WHEN 7 THEN 'Read' WHEN 8 THEN 'Write' WHEN 99
      THEN 'Other' END)::VARCHAR
    actor.user.name: (PROPERTIES:AccountName)::VARCHAR
    actual_permissions: NULL::NUMBER
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    base_address: NULL::VARCHAR
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('memory_activity')::VARCHAR
    class_uid: ('1004')::NUMBER
    cloud.org.uid: (TENANT_ID)::VARCHAR
    cloud.provider: ('Microsoft Defender')::VARCHAR
    count: NULL::NUMBER
    device.container.uid: (PROPERTIES:AppGuardContainerId)::VARCHAR
    device.ip: (PROPERTIES:RemoteIP)::VARCHAR
    device.name: (PROPERTIES:DeviceName)::VARCHAR
    device.type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN
      10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (0)::NUMBER
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (PROPERTIES:ActionType)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('microsoft-365-defender-advanced-hunting')::VARCHAR
    metadata.product.vendor_name: ('microsoft-defender')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PROPERTIES:AccountName)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.container'''
      type: '''Container'''
      type_id: 27
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PROPERTIES:RemoteIP)::VARCHAR
    - name: '''process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (PROPERTIES:FileName)::VARCHAR
    - name: '''process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (PROPERTIES:InitiatingProcessFileName)::VARCHAR
    - name: '''process.parent_process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.parent_process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (PROPERTIES:InitiatingProcessParentFileName)::VARCHAR
    - name: '''process.parent_process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.parent_process.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (PROPERTIES:InitiatingProcessAccountUpn)::VARCHAR
    - name: '''process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    process.cmd_line: (PROPERTIES:ProcessCommandLine)::VARCHAR
    process.created_time: (date_part('epoch_milliseconds', (PROPERTIES:ProcessCreationTime)::TIMESTAMP_LTZ))::NUMBER
    process.created_time_dt: (PROPERTIES:ProcessCreationTime)::TIMESTAMP_LTZ
    process.file.company_name: (PROPERTIES:ProcessVersionInfoCompanyName)::VARCHAR
    process.file.desc: (PROPERTIES:ProcessVersionInfoFileDescription)::VARCHAR
    process.file.hashes: (ARRAY_CONSTRUCT( OBJECT_CONSTRUCT_KEEP_NULL('algorithm_id',
      CASE WHEN PROPERTIES:SHA256 IS NOT NULL THEN 3 WHEN PROPERTIES:SHA1 IS NOT NULL
      THEN 2 WHEN PROPERTIES:MD5 IS NOT NULL THEN 1 END::NUMBER, 'algorithm', CASE
      WHEN PROPERTIES:SHA256 IS NOT NULL THEN 'SHA-256' WHEN PROPERTIES:SHA1 IS NOT
      NULL THEN 'SHA-1' WHEN PROPERTIES:MD5 IS NOT NULL THEN 'MD5' END::VARCHAR, 'value',
      COALESCE( PROPERTIES:SHA256, PROPERTIES:SHA1, PROPERTIES:MD5)::VARCHAR)))::ARRAY
    process.file.name: (PROPERTIES:FileName)::VARCHAR
    process.file.path: (PROPERTIES:FolderPath)::VARCHAR
    process.file.size: (PROPERTIES:FileSize)::NUMBER
    process.integrity: (CASE ((CASE WHEN PROPERTIES:ProcessIntegrityLevel IS NULL
      THEN 0 WHEN PROPERTIES:ProcessIntegrityLevel = 'Untrusted' THEN 1 WHEN PROPERTIES:ProcessIntegrityLevel
      = 'Low' THEN 2 WHEN PROPERTIES:ProcessIntegrityLevel = 'Medium' THEN 3 WHEN
      PROPERTIES:ProcessIntegrityLevel = 'High' THEN 4 WHEN PROPERTIES:ProcessIntegrityLevel
      = 'System' THEN 5 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Untrusted'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'System'
      WHEN 6 THEN 'Protected' WHEN 99 THEN 'Other' END)::VARCHAR
    process.integrity_id: (CASE WHEN PROPERTIES:ProcessIntegrityLevel IS NULL THEN
      0 WHEN PROPERTIES:ProcessIntegrityLevel = 'Untrusted' THEN 1 WHEN PROPERTIES:ProcessIntegrityLevel
      = 'Low' THEN 2 WHEN PROPERTIES:ProcessIntegrityLevel = 'Medium' THEN 3 WHEN
      PROPERTIES:ProcessIntegrityLevel = 'High' THEN 4 WHEN PROPERTIES:ProcessIntegrityLevel
      = 'System' THEN 5 ELSE 99 END)::NUMBER
    process.parent_process.cmd_line: (PROPERTIES:InitiatingProcessCommandLine)::VARCHAR
    process.parent_process.created_time: (date_part('epoch_milliseconds', (PROPERTIES:InitiatingProcessCreationTime)::TIMESTAMP_LTZ))::NUMBER
    process.parent_process.created_time_dt: (PROPERTIES:InitiatingProcessCreationTime)::TIMESTAMP_LTZ
    process.parent_process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm_id',
      CASE WHEN PROPERTIES:InitiatingProcessSHA256 IS NOT NULL THEN 3 WHEN PROPERTIES:InitiatingProcessSHA1
      IS NOT NULL THEN 2 WHEN PROPERTIES:InitiatingProcessMD5 IS NOT NULL THEN 1 END::NUMBER,
      'algorithm', CASE WHEN PROPERTIES:InitiatingProcessSHA256 IS NOT NULL THEN 'SHA-256'
      WHEN PROPERTIES:InitiatingProcessSHA1 IS NOT NULL THEN 'SHA-1' WHEN PROPERTIES:InitiatingProcessMD5
      IS NOT NULL THEN 'MD5' END::VARCHAR, 'value', COALESCE( PROPERTIES:InitiatingProcessSHA256,
      PROPERTIES:InitiatingProcessSHA1, PROPERTIES:InitiatingProcessMD5)::VARCHAR)))::ARRAY
    process.parent_process.file.name: (PROPERTIES:InitiatingProcessFileName)::VARCHAR
    process.parent_process.file.path: (PROPERTIES:InitiatingProcessFolderPath)::VARCHAR
    process.parent_process.file.product.name: (PROPERTIES:InitiatingProcessVersionInfoProductName)::VARCHAR
    process.parent_process.file.product.version: (PROPERTIES:InitiatingProcessVersionInfoProductVersion)::VARCHAR
    process.parent_process.file.size: (PROPERTIES:InitiatingProcessFileSize)::NUMBER
    process.parent_process.parent_process.created_time: (date_part('epoch_milliseconds',
      (PROPERTIES:InitiatingProcessParentCreationTime)::TIMESTAMP_LTZ))::NUMBER
    process.parent_process.parent_process.created_time_dt: (PROPERTIES:InitiatingProcessParentCreationTime)::TIMESTAMP_LTZ
    process.parent_process.parent_process.file.name: (PROPERTIES:InitiatingProcessParentFileName)::VARCHAR
    process.parent_process.parent_process.pid: (PROPERTIES:InitiatingProcessParentId)::NUMBER
    process.parent_process.pid: (PROPERTIES:InitiatingProcessId)::NUMBER
    process.parent_process.session.is_remote: (CASE WHEN PROPERTIES:IsInitiatingProcessRemoteSession
      = 'true' THEN TRUE ELSE FALSE END)::BOOLEAN
    process.parent_process.session.uid: (PROPERTIES:InitiatingProcessSessionId)::VARCHAR
    process.parent_process.user.account.name: (PROPERTIES:InitiatingProcessAccountName)::VARCHAR
    process.parent_process.user.account.uid: (COALESCE(PROPERTIES:InitiatingProcessAccountObjectId,
      PROPERTIES:InitiatingProcessAccountSid))::VARCHAR
    process.parent_process.user.domain: (PROPERTIES:InitiatingProcessAccountDomain)::VARCHAR
    process.parent_process.user.email_addr: (PROPERTIES:InitiatingProcessAccountUpn)::VARCHAR
    process.pid: (PROPERTIES:ProcessId)::NUMBER
    process.session.is_remote: (CASE WHEN PROPERTIES:IsProcessRemoteSession = 'true'
      THEN TRUE ELSE FALSE END)::BOOLEAN
    process.session.uid: (PROPERTIES:CreatedProcessSessionId)::VARCHAR
    process.uid: (PROPERTIES:DeviceId::VARCHAR || ':' || TO_CHAR(PROPERTIES:ProcessCreationTime::TIMESTAMP_LTZ,'YYYY-MM-DD')||
      ':' || PROPERTIES:ProcessId)::VARCHAR
    process.user.account.name: (PROPERTIES:AccountName)::VARCHAR
    process.user.account.uid: (PROPERTIES:AccountSid)::VARCHAR
    process.user.domain: (PROPERTIES:AccountDomain)::VARCHAR
    raw_data: NULL::VARCHAR
    requested_permissions: NULL::NUMBER
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    size: NULL::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100400 + (CASE WHEN PROPERTIES:ActionType ILIKE ''%allocate%''
      THEN 1 WHEN PROPERTIES:ActionType ILIKE ''%protect%'' THEN 2 WHEN PROPERTIES:ActionType
      ILIKE ''%read%'' THEN 7 WHEN PROPERTIES:ActionType IS NULL THEN 0 ELSE 99 END))::NUMBER)
      WHEN 100400 THEN ''Memory Activity: Unknown'' WHEN 100401 THEN ''Memory Activity:
      Allocate Page'' WHEN 100402 THEN ''Memory Activity: Modify Page'' WHEN 100403
      THEN ''Memory Activity: Delete Page'' WHEN 100404 THEN ''Memory Activity: Buffer
      Overflow'' WHEN 100405 THEN ''Memory Activity: Disable DEP'' WHEN 100406 THEN
      ''Memory Activity: Enable DEP'' WHEN 100407 THEN ''Memory Activity: Read'' WHEN
      100408 THEN ''Memory Activity: Write'' WHEN 100499 THEN ''Memory Activity: Other''
      END)::VARCHAR'
    type_uid: (100400 + (CASE WHEN PROPERTIES:ActionType ILIKE '%allocate%' THEN 1
      WHEN PROPERTIES:ActionType ILIKE '%protect%' THEN 2 WHEN PROPERTIES:ActionType
      ILIKE '%read%' THEN 7 WHEN PROPERTIES:ActionType IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: PROPERTIES:ActionType ILIKE '%memory%'
