type: mapping
id: microsoft_365_defender_identity_query_events_4003_dns_activity_1.1.0
version: '9'
name: Microsoft 365 Defender Identity Query Events to OCSF class Dns Activity
data-types:
- microsoft-365-defender-identity-query-events
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (1)::NUMBER
    activity_name: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Query' WHEN
      2 THEN 'Response' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.name: (RAW:AccountName)::VARCHAR
    answers: NULL::ARRAY
    api.operation: (OPERATION_NAME)::VARCHAR
    app_name: (APPLICATION)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('dns_activity')::VARCHAR
    class_uid: ('4003')::NUMBER
    cloud.account.name: (RAW:properties:AccountName)::VARCHAR
    cloud.account.type: (CASE ((6)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'LDAP
      Account' WHEN 10 THEN 'AWS Account' WHEN 2 THEN 'Windows Account' WHEN 3 THEN
      'AWS IAM User' WHEN 4 THEN 'AWS IAM Role' WHEN 5 THEN 'GCP Account' WHEN 6 THEN
      'Azure AD Account' WHEN 7 THEN 'Mac OS Account' WHEN 8 THEN 'Apple Account'
      WHEN 9 THEN 'Linux Account' WHEN 99 THEN 'Other' END)::VARCHAR
    cloud.account.type_id: (6)::NUMBER
    cloud.provider: ('MS Azure')::VARCHAR
    connection_info: NULL::VARIANT
    count: (RAW:properties:AdditionalFields:Count)::NUMBER
    device.name: (DEVICE_NAME)::VARCHAR
    device.uid: (TENANT_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (DESTINATION_IP_ADDRESS)::VARCHAR
    dst_endpoint.name: (DESTINATION_DEVICE_NAME)::VARCHAR
    dst_endpoint.os.name: (RAW:properties:AdditionalFields:DestinationComputerOperatingSystem)::VARCHAR
    dst_endpoint.os.type: (CASE ((CASE (RAW:properties:AdditionalFields:DestinationComputerOperatingSystemType::VARCHAR)
      WHEN 'windows' THEN 100 WHEN 'unknown' THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN
      'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN
      302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN
      'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    dst_endpoint.os.type_id: (CASE (RAW:properties:AdditionalFields:DestinationComputerOperatingSystemType::VARCHAR)
      WHEN 'windows' THEN 100 WHEN 'unknown' THEN 0 ELSE 99 END)::NUMBER
    dst_endpoint.os.version: (RAW:properties:AdditionalFields:DestinationComputerOperatingSystemVersion)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('microsoft-365-defender-identity-query-events')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (RAW:AccountName)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP_ADDRESS)::VARCHAR
    - name: '''query.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (QUERY_TARGET)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IP_ADDRESS)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    query.hostname: (QUERY_TARGET)::VARCHAR
    query.type: (QUERY_TYPE)::VARCHAR
    query_time: NULL::NUMBER
    query_time_dt: NULL::TIMESTAMP_LTZ
    raw_data: NULL::VARCHAR
    rcode: NULL::VARCHAR
    rcode_id: NULL::NUMBER
    response_time: (date_part('epoch_milliseconds', (RECEIVED_TIME)::TIMESTAMP_LTZ))::NUMBER
    response_time_dt: (RECEIVED_TIME)::TIMESTAMP_LTZ
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (IP_ADDRESS)::VARCHAR
    src_endpoint.os.name: (RAW:properties:AdditionalFields:SourceComputerOperatingSystem)::VARCHAR
    src_endpoint.os.type: (CASE ((CASE (RAW:properties:AdditionalFields:SourceComputerOperatingSystemType::VARCHAR)
      WHEN 'windows' THEN 100 WHEN 'unknown' THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN
      'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN
      302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN
      'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    src_endpoint.os.type_id: (CASE (RAW:properties:AdditionalFields:SourceComputerOperatingSystemType::VARCHAR)
      WHEN 'windows' THEN 100 WHEN 'unknown' THEN 0 ELSE 99 END)::NUMBER
    src_endpoint.os.version: (RAW:properties:AdditionalFields:SourceComputerOperatingSystemVersion)::VARCHAR
    src_endpoint.port: (PORT)::NUMBER
    src_endpoint.uid: (RAW:properties:AdditionalFields:SourceComputerId)::VARCHAR
    start_time: (date_part('epoch_milliseconds', (TIMESTAMP)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (TIMESTAMP)::TIMESTAMP_LTZ
    status: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2
      THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (0)::NUMBER
    time: (date_part('epoch_milliseconds', time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400301)::NUMBER) WHEN 400300 THEN ''DNS Activity: Unknown''
      WHEN 400301 THEN ''DNS Activity: Query'' WHEN 400302 THEN ''DNS Activity: Response''
      WHEN 400306 THEN ''DNS Activity: Traffic'' WHEN 400399 THEN ''DNS Activity:
      Other'' END)::VARCHAR'
    type_uid: (400301)::NUMBER
    unmapped: NULL::VARIANT
  predicate: ACTION_TYPE = 'DNS query'
