type: mapping
id: microsoft_365_defender_advanced_hunting_5001_inventory_info_1.1.0
version: '4'
name: Microsoft 365 Defender Advanced Hunting to OCSF class Inventory Info
data-types:
- microsoft-365-defender-advanced-hunting
mapping:
  fields:
    activity_id: (2)::NUMBER
    activity_name: (CASE ((2)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Log' WHEN
      2 THEN 'Collect' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.domain: (PARSE_JSON(PROPERTIES:LoggedOnUsers)[0]:DomainName)::VARCHAR
    actor.user.name: (PARSE_JSON(PROPERTIES:LoggedOnUsers)[0]:UserName)::VARCHAR
    actor.user.uid: (PARSE_JSON(PROPERTIES:LoggedOnUsers)[0]:Sid)::VARCHAR
    api: NULL::VARIANT
    category_name: (CASE ((5)::NUMBER) WHEN 5 THEN 'Discovery' END)::VARCHAR
    category_uid: (5)::NUMBER
    class_name: ('inventory_info')::VARCHAR
    class_uid: ('5001')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (PROPERTIES:DeviceName)::VARCHAR
    device.ip: (PROPERTIES:PublicIP)::VARCHAR
    device.os.build: (PROPERTIES:OSBuild)::VARCHAR
    device.os.cpu_bits: (REGEXP_SUBSTR(PROPERTIES:OSArchitecture, '\\d+'))::NUMBER
    device.os.name: (PROPERTIES:OSPlatform)::VARCHAR
    device.os.type: (CASE ((CASE WHEN  PROPERTIES:OSPlatform IS NULL THEN 0 WHEN PROPERTIES:OSPlatform
      ILIKE ANY ('OS X%', 'macOS%', 'Mac OS%') THEN 300 WHEN PROPERTIES:OSPlatform
      ILIKE 'iOS%' THEN 301 WHEN PROPERTIES:OSPlatform = 'Windows Mobile' THEN 101
      WHEN PROPERTIES:OSPlatform ILIKE 'Android%' THEN 201 WHEN PROPERTIES:OSPlatform
      ILIKE 'Windows%' THEN 100 WHEN PROPERTIES:OSPlatform ILIKE 'Linux%' THEN 200
      ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101
      THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300
      THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris'
      WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN  PROPERTIES:OSPlatform IS NULL THEN 0 WHEN PROPERTIES:OSPlatform
      ILIKE ANY ('OS X%', 'macOS%', 'Mac OS%') THEN 300 WHEN PROPERTIES:OSPlatform
      ILIKE 'iOS%' THEN 301 WHEN PROPERTIES:OSPlatform = 'Windows Mobile' THEN 101
      WHEN PROPERTIES:OSPlatform ILIKE 'Android%' THEN 201 WHEN PROPERTIES:OSPlatform
      ILIKE 'Windows%' THEN 100 WHEN PROPERTIES:OSPlatform ILIKE 'Linux%' THEN 200
      ELSE 99 END)::NUMBER
    device.os.version: (PROPERTIES:OSVersion)::VARCHAR
    device.type: (CASE ((CASE WHEN PROPERTIES:DeviceType IS NULL THEN 0 WHEN PROPERTIES:DeviceType
      = 'Server' THEN 1 WHEN PROPERTIES:DeviceType = 'Desktop' THEN 2 WHEN PROPERTIES:DeviceType
      = 'Tablet' THEN 4 WHEN PROPERTIES:DeviceType = 'Mobile' THEN 5 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN 10 THEN 'Switch' WHEN 11 THEN
      'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop' WHEN 4 THEN 'Tablet' WHEN 5
      THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN 'IOT' WHEN 8 THEN 'Browser'
      WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN PROPERTIES:DeviceType IS NULL THEN 0 WHEN PROPERTIES:DeviceType
      = 'Server' THEN 1 WHEN PROPERTIES:DeviceType = 'Desktop' THEN 2 WHEN PROPERTIES:DeviceType
      = 'Tablet' THEN 4 WHEN PROPERTIES:DeviceType = 'Mobile' THEN 5 ELSE 99 END)::NUMBER
    device.uid: (COALESCE(PROPERTIES:DeviceId, TENANT_ID))::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('microsoft-365-defender-advanced-hunting')::VARCHAR
    metadata.product.vendor_name: ('microsoft-defender')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (PARSE_JSON(PROPERTIES:LoggedOnUsers)[0]:UserName)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (PROPERTIES:DeviceName)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PROPERTIES:PublicIP)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: (date_part('epoch_milliseconds', (TIME_RECEIVED_BY_SVC)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (TIME_RECEIVED_BY_SVC)::TIMESTAMP_LTZ
    status: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2
      THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (0)::NUMBER
    time: (date_part('epoch_milliseconds', time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((500102)::NUMBER) WHEN 500100 THEN ''Device Inventory Info:
      Unknown'' WHEN 500101 THEN ''Device Inventory Info: Log'' WHEN 500102 THEN ''Device
      Inventory Info: Collect'' WHEN 500199 THEN ''Device Inventory Info: Other''
      END)::VARCHAR'
    type_uid: (500102)::NUMBER
    unmapped: NULL::VARIANT
  predicate: category = 'AdvancedHunting-DeviceInfo'
