type: mapping
id: mimecast_url_protect_logs_v2_4012_email_url_activity_1.1.0
version: '1'
name: Mimecast Url Protect Logs V2 to OCSF class Email Url Activity
data-types:
- mimecast-url-protect-logs-v2
mapping:
  fields:
    action: (CASE (CASE WHEN ACTION='Block' THEN 2 WHEN ACTION IS NULL THEN 0 ELSE
      99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied'
      WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION='Block' THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99
      END)::NUMBER
    activity_id: (3)::NUMBER
    activity_name: (CASE (3::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Send' WHEN
      2 THEN 'Receive' WHEN 3 THEN 'Scan' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.domain: (SENDER_DOMAIN)::VARCHAR
    actor.user.email_addr: (SENDER_ENVELOPE)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('email_url_activity')::VARCHAR
    class_uid: ('4012')::NUMBER
    cloud.account.uid: (ACCOUNT_ID)::VARCHAR
    cloud.provider: ('Mimecast')::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    email_uid: (MESSAGE_ID)::VARCHAR
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (SUBJECT)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('mimecast-url-protect-logs-v2')::VARCHAR
    metadata.product.vendor_name: ('mimecast_v2')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (SENDER_ENVELOPE)::VARCHAR
    - name: '''url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (PARSE_URL(URL):host)::VARCHAR
    - name: '''url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (URL)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (BLOCK_REASON)::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (401203::NUMBER) WHEN 401200 THEN ''Email URL Activity: Unknown''
      WHEN 401201 THEN ''Email URL Activity: Send'' WHEN 401202 THEN ''Email URL Activity:
      Receive'' WHEN 401203 THEN ''Email URL Activity: Scan'' WHEN 401299 THEN ''Email
      URL Activity: Other'' END)::VARCHAR'
    type_uid: (401203)::NUMBER
    unmapped: NULL::VARIANT
    url.categories: (URL_CATEGORY)::ARRAY
    url.category_ids: (CASE WHEN URL_CATEGORY='Phishing & Fraud' THEN 18 WHEN URL_CATEGORY
      IS NULL THEN 0 ELSE 99 END)::ARRAY
    url.hostname: (PARSE_URL(URL):host)::VARCHAR
    url.path: (PARSE_URL(URL):path)::VARCHAR
    url.port: (PARSE_URL(URL):port)::NUMBER
    url.query_string: (PARSE_URL(URL):query)::VARCHAR
    url.scheme: (PARSE_URL(URL):scheme)::VARCHAR
    url.url_string: (URL)::VARCHAR
