type: mapping
id: mimecast_attachment_protect_logs_v2_4011_email_file_activity_1.1.0
version: '1'
name: Mimecast Attachment Protect Logs V2 to OCSF class Email File Activity
data-types:
- mimecast-attachment-protect-logs-v2
mapping:
  fields:
    action: NULL::VARCHAR
    action_id: NULL::NUMBER
    activity_id: (3)::NUMBER
    activity_name: (CASE (3::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Send' WHEN
      2 THEN 'Receive' WHEN 3 THEN 'Scan' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('email_file_activity')::VARCHAR
    class_uid: ('4011')::NUMBER
    cloud.account.uid: (ACCOUNT_ID)::VARCHAR
    cloud.provider: ('Mimecast')::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    email_uid: (MESSAGE_ID)::VARCHAR
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm', 'MD5', 'algorithm_id',
      '1', 'value', MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm', 'SHA-1', 'algorithm_id',
      '2', 'value', SHA1), OBJECT_CONSTRUCT_KEEP_NULL('algorithm', 'SHA-256', 'algorithm_id',
      '3', 'value', SHA256)))::ARRAY
    file.mime_type: (FILE_MIME)::VARCHAR
    file.name: (FILE_NAME)::VARCHAR
    file.size: (SIZE_ATTACHMENT)::NUMBER
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('mimecast-attachment-protect-logs-v2')::VARCHAR
    metadata.product.vendor_name: ('mimecast_v2')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''file.hashes'''
      type: '''Hash'''
      type_id: 8
      reputation: null::VARIANT
      value: IFF(ARRAY_SIZE((ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'MD5', 'algorithm_id', '1', 'value', MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-1', 'algorithm_id', '2', 'value', SHA1), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-256', 'algorithm_id', '3', 'value', SHA256)))::ARRAY) > 0, ((ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'MD5', 'algorithm_id', '1', 'value', MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-1', 'algorithm_id', '2', 'value', SHA1), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-256', 'algorithm_id', '3', 'value', SHA256)))::ARRAY)[0]:"value", NULL::ARRAY)
    - name: '''file.hashes'''
      type: '''Hash'''
      type_id: 8
      reputation: null::VARIANT
      value: IFF(ARRAY_SIZE((ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'MD5', 'algorithm_id', '1', 'value', MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-1', 'algorithm_id', '2', 'value', SHA1), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-256', 'algorithm_id', '3', 'value', SHA256)))::ARRAY) > 1, ((ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'MD5', 'algorithm_id', '1', 'value', MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-1', 'algorithm_id', '2', 'value', SHA1), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-256', 'algorithm_id', '3', 'value', SHA256)))::ARRAY)[1]:"value", NULL::ARRAY)
    - name: '''file.hashes'''
      type: '''Hash'''
      type_id: 8
      reputation: null::VARIANT
      value: IFF(ARRAY_SIZE((ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'MD5', 'algorithm_id', '1', 'value', MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-1', 'algorithm_id', '2', 'value', SHA1), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-256', 'algorithm_id', '3', 'value', SHA256)))::ARRAY) > 2, ((ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'MD5', 'algorithm_id', '1', 'value', MD5), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-1', 'algorithm_id', '2', 'value', SHA1), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
        'SHA-256', 'algorithm_id', '3', 'value', SHA256)))::ARRAY)[2]:"value", NULL::ARRAY)
    - name: '''file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (FILE_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (401103::NUMBER) WHEN 401100 THEN ''Email File Activity: Unknown''
      WHEN 401101 THEN ''Email File Activity: Send'' WHEN 401102 THEN ''Email File
      Activity: Receive'' WHEN 401103 THEN ''Email File Activity: Scan'' WHEN 401199
      THEN ''Email File Activity: Other'' END)::VARCHAR'
    type_uid: (401103)::NUMBER
    unmapped: NULL::VARIANT
