type: mapping
id: mimecast_process_logs_v2_4009_email_activity_1.1.0
version: '1'
name: Mimecast Process Logs V2 to OCSF class Email Activity
data-types:
- mimecast-process-logs-v2
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION IN ('Acc', 'Hld') THEN 1 WHEN ACTION IN ('Rej',
      'Blk') THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION IN ('Acc', 'Hld') THEN 1 WHEN ACTION IN ('Rej', 'Blk')
      THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Send' WHEN
      2 THEN 'Receive' WHEN 3 THEN 'Scan' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    attempt: NULL::NUMBER
    authorizations: NULL::ARRAY
    banner: NULL::VARCHAR
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('email_activity')::VARCHAR
    class_uid: ('4009')::NUMBER
    cloud.account.uid: (ACCOUNT_CODE)::VARCHAR
    cloud.provider: ('Mimecast')::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    direction: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Inbound' WHEN
      2 THEN 'Outbound' WHEN 3 THEN 'Internal' WHEN 99 THEN 'Other' END)::VARCHAR
    direction_id: (0)::NUMBER
    disposition: (CASE ((CASE WHEN ACTION IN ('Acc', 'Hld') THEN 1 WHEN ACTION IN
      ('Rej', 'Blk') THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 10 THEN 'Exonerated' WHEN 11 THEN
      'Corrected' WHEN 12 THEN 'Partially Corrected' WHEN 13 THEN 'Uncorrected' WHEN
      14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN 16 THEN 'No Action' WHEN 17 THEN
      'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN 'Alert' WHEN 2 THEN 'Blocked' WHEN
      20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN 22 THEN 'Captcha' WHEN 23 THEN 'Challenge'
      WHEN 24 THEN 'Access Revoked' WHEN 25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized'
      WHEN 27 THEN 'Error' WHEN 3 THEN 'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5
      THEN 'Deleted' WHEN 6 THEN 'Dropped' WHEN 7 THEN 'Custom Action' WHEN 8 THEN
      'Approved' WHEN 9 THEN 'Restored' WHEN 99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN ACTION IN ('Acc', 'Hld') THEN 1 WHEN ACTION IN ('Rej',
      'Blk') THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    email.from: (SENDER_ENVELOPE)::VARCHAR
    email.message_uid: (MESSAGE_ID)::VARCHAR
    email.size: (EMAIL_SIZE)::NUMBER
    email.subject: (SUBJECT)::VARCHAR
    email.uid: (AGGREGATE_ID)::VARCHAR
    email_auth: NULL::VARIANT
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (ATTACHMENTS)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('mimecast-process-logs-v2')::VARCHAR
    metadata.product.vendor_name: ('mimecast_v2')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''email'''
      type: '''Email'''
      type_id: 22
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''email.from'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (SENDER_ENVELOPE)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    smtp_hello: NULL::VARCHAR
    src_endpoint: NULL::VARIANT
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN ACTION IN ('Acc', 'Hld') THEN 1 WHEN ACTION IN ('Rej',
      'Blk') THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN ACTION IN ('Acc', 'Hld') THEN 1 WHEN ACTION IN ('Rej', 'Blk')
      THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((400900)::NUMBER) WHEN 400900 THEN ''Email Activity: Unknown''
      WHEN 400901 THEN ''Email Activity: Send'' WHEN 400902 THEN ''Email Activity:
      Receive'' WHEN 400903 THEN ''Email Activity: Scan'' WHEN 400999 THEN ''Email
      Activity: Other'' END)::VARCHAR'
    type_uid: (400900)::NUMBER
    unmapped: NULL::VARIANT
