type: mapping
id: netflow_logs_v9_4001_network_activity_1.1.0
version: '11'
name: Netflow Logs V9 to OCSF class Network Activity
data-types:
- netflow-logs-v9
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (6)::NUMBER
    activity_name: (CASE ((6)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN
      2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((CASE WHEN NETWORK_DIRECTION IS NULL THEN 0
      WHEN NETWORK_DIRECTION = 'inbound' THEN 1 WHEN NETWORK_DIRECTION = 'outbound'
      THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Inbound' WHEN
      2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other' END)::VARCHAR
    connection_info.direction_id: (CASE WHEN NETWORK_DIRECTION IS NULL THEN 0 WHEN
      NETWORK_DIRECTION = 'inbound' THEN 1 WHEN NETWORK_DIRECTION = 'outbound' THEN
      2 ELSE 99 END)::NUMBER
    connection_info.protocol_name: (NETWORK_TRANSPORT)::VARCHAR
    connection_info.protocol_num: (CASE WHEN NETWORK_TRANSPORT IS NULL THEN 0 WHEN
      NETWORK_TRANSPORT = 'icmp' THEN 1 WHEN NETWORK_TRANSPORT = 'tcp' THEN 6 WHEN
      NETWORK_TRANSPORT = 'udp' THEN 17 ELSE 99 END)::NUMBER
    connection_info.protocol_ver: (CASE ((CASE WHEN RAW:netflow:ip_protocol_version
      IS NULL THEN 0 WHEN RAW:netflow:ip_protocol_version IN (4, 6) THEN RAW:netflow:ip_protocol_version
      ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 4 THEN 'Internet Protocol version
      4 (IPv4)' WHEN 6 THEN 'Internet Protocol version 6 (IPv6)' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.protocol_ver_id: (CASE WHEN RAW:netflow:ip_protocol_version IS
      NULL THEN 0 WHEN RAW:netflow:ip_protocol_version IN (4, 6) THEN RAW:netflow:ip_protocol_version
      ELSE 99 END)::NUMBER
    connection_info.tcp_flags: (RAW:netflow:tcp_flags)::NUMBER
    count: NULL::NUMBER
    device.hostname: (LOGGING_HOST)::VARCHAR
    device.org.name: (RAW:source:as:organization:name)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.hostname: (DESTINATION_HOSTNAME)::VARCHAR
    dst_endpoint.ip: (DESTINATION_IP)::VARCHAR
    dst_endpoint.location.city: (RAW:destination:geo:city_name)::VARCHAR
    dst_endpoint.location.country: (RAW:destination:geo:country_code3)::VARCHAR
    dst_endpoint.location.postal_code: (RAW:destination:geo:postal_code)::VARCHAR
    dst_endpoint.location.region: (RAW:destination:geo:region_code)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (NETFLOW_LAST_SWITCHED)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (NETFLOW_LAST_SWITCHED)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('netflow-logs-v9')::VARCHAR
    metadata.product.vendor_name: ('Netflow')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (LOGGING_HOST)::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DESTINATION_HOSTNAME)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP)::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SOURCE_HOSTNAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.hostname: (SOURCE_HOSTNAME)::VARCHAR
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.location.city: (RAW:source:geo:city_name)::VARCHAR
    src_endpoint.location.country: (RAW:source:geo:country_code3)::VARCHAR
    src_endpoint.location.postal_code: (RAW:source:geo:postal_code)::VARCHAR
    src_endpoint.location.region: (RAW:source:geo:region_code)::VARCHAR
    src_endpoint.port: (SOURCE_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', netflow_last_switched::TIMESTAMP_LTZ))::NUMBER
    time_dt: (netflow_last_switched)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes: (NVL(source_bytes, 0) + NVL(destination_bytes, 0))::NUMBER
    traffic.bytes_in: (SOURCE_BYTES)::NUMBER
    traffic.bytes_out: (DESTINATION_BYTES)::NUMBER
    traffic.packets: (NVL(source_packets, 0) + NVL(destination_packets, 0))::NUMBER
    traffic.packets_in: (SOURCE_PACKETS)::NUMBER
    traffic.packets_out: (DESTINATION_PACKETS)::NUMBER
    type_name: '(CASE ((400106)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown''
      WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400106)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
