type: mapping
id: netiq_edirectory_audit_3002_authentication_1.1.0
version: '11'
name: Netiq Edirectory Audit to OCSF class Authentication
data-types:
- netiq-edirectory-audit
mapping:
  fields:
    activity_id: (CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME = 'LOGIN' THEN
      1 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME = 'LOGIN'
      THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN
      2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket' WHEN 4 THEN 'Service Ticket
      Request' WHEN 5 THEN 'Service Ticket Renew' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.name: (SOURCE_USER)::VARCHAR
    api.service.name: (SOURCE_SERVICE_NAME)::VARCHAR
    api.service.version: (SOURCE_PROCESS)::VARCHAR
    auth_protocol: NULL::VARCHAR
    auth_protocol_id: NULL::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (DEVICE_HOST)::VARCHAR
    device.ip: (DEVICE)::VARCHAR
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: (RAW:msg)::VARCHAR
    metadata.event_code: (event_name)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('netiq-edirectory-audit')::VARCHAR
    metadata.product.vendor_name: ('netiq')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (SOURCE_USER)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DEVICE_HOST)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DEVICE)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(RAW:src, SPLIT_PART(INTRUDER_ADDRESS, ':', 2)))::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (SOURCE_USER)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session: NULL::VARIANT
    severity: (CASE ((RAW:severity)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (RAW:severity)::NUMBER
    src_endpoint.ip: (COALESCE(RAW:src, SPLIT_PART(INTRUDER_ADDRESS, ':', 2)))::VARCHAR
    src_endpoint.port: (RAW:spt)::NUMBER
    start_time: (date_part('epoch_milliseconds', (RECEIVED_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (RECEIVED_TIME)::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN OUTCOME IS NULL THEN 0 WHEN OUTCOME = 'Success' THEN
      1 WHEN OUTCOME = 'Failure' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN OUTCOME IS NULL THEN 0 WHEN OUTCOME = 'Success' THEN 1 WHEN
      OUTCOME = 'Failure' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', received_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (received_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300200 + CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME
      = ''LOGIN'' THEN 1 ELSE 99 END)::NUMBER) WHEN 300200 THEN ''Authentication:
      Unknown'' WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (300200 + CASE WHEN EVENT_NAME IS NULL THEN 0 WHEN EVENT_NAME = 'LOGIN'
      THEN 1 ELSE 99 END)::NUMBER
    unmapped: NULL::VARIANT
    user.name: (SOURCE_USER)::VARCHAR
  predicate: EVENT_NAME in ('LOGIN')
