type: mapping
id: netskope_v2_alerts_2004_detection_finding_1.1.0
version: '1'
name: Netskope V2 Alerts to OCSF class Detection Finding
data-types:
- netskope-v2-alerts
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION IN ('allow', 'bypass') THEN 1 WHEN ACTION = 'block'
      THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION IN ('allow', 'bypass') THEN 1 WHEN ACTION = 'block'
      THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN ACTIVITY IN ('Create', 'Upload', 'Send', 'Download') THEN
      1 WHEN ACTIVITY IN ('Delete', 'Login Failed') THEN 3 WHEN ACTIVITY IN ('Post',
      'Move', 'Browse') THEN 2 WHEN ACTIVITY IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTIVITY IN ('Create', 'Upload', 'Send', 'Download')
      THEN 1 WHEN ACTIVITY IN ('Delete', 'Login Failed') THEN 3 WHEN ACTIVITY IN ('Post',
      'Move', 'Browse') THEN 2 WHEN ACTIVITY IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Update' WHEN 3 THEN
      'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.session.uid: (COALESCE(SESSION_ID, APP_SESSION_ID))::VARCHAR
    actor.user.email_addr: (COALESCE(USER, USER_KEY))::VARCHAR
    actor.user.name: (SPLIT_PART(COALESCE(USER, USER_KEY), '@', 1))::VARCHAR
    actor.user.org.name: (ORG)::VARCHAR
    actor.user.org.uid: (ORGANIZATION_ID)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('policy', OBJECT_CONSTRUCT_KEEP_NULL('name',
      POLICY, 'uid', POLICY_ID))))::ARRAY
    category_name: (CASE ((2)::NUMBER) WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: (2)::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud.account.name: (ACCOUNT_NAME)::VARCHAR
    cloud.account.uid: (ACCOUNT_ID)::VARCHAR
    comment: NULL::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: NULL::NUMBER
    confidence_score: NULL::NUMBER
    count: (COUNT)::NUMBER
    device.hostname: (DOMAIN)::VARCHAR
    device.name: (DEVICE)::VARCHAR
    device.os.name: (HOST_OS)::VARCHAR
    device.os.type: (CASE ((CASE WHEN DEVICE = 'Mac Device' THEN 300 WHEN DEVICE =
      'Windows Device' THEN 100 WHEN DEVICE IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN
      200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN
      'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN
      402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN DEVICE = 'Mac Device' THEN 300 WHEN DEVICE = 'Windows
      Device' THEN 100 WHEN DEVICE IS NULL THEN 0 ELSE 99 END)::NUMBER
    device.os.version: (OS_VERSION)::VARCHAR
    disposition: (CASE ((CASE WHEN ACTION = 'alert' THEN 19 WHEN ACTION IN ('bypass',
      'allow') THEN 1 WHEN ACTION = 'block' THEN 2 WHEN ACTION IN ('Detection', 'anomaly_detection')
      THEN 15 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 10 THEN 'Exonerated' WHEN 11 THEN 'Corrected' WHEN
      12 THEN 'Partially Corrected' WHEN 13 THEN 'Uncorrected' WHEN 14 THEN 'Delayed'
      WHEN 15 THEN 'Detected' WHEN 16 THEN 'No Action' WHEN 17 THEN 'Logged' WHEN
      18 THEN 'Tagged' WHEN 19 THEN 'Alert' WHEN 2 THEN 'Blocked' WHEN 20 THEN 'Count'
      WHEN 21 THEN 'Reset' WHEN 22 THEN 'Captcha' WHEN 23 THEN 'Challenge' WHEN 24
      THEN 'Access Revoked' WHEN 25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized' WHEN
      27 THEN 'Error' WHEN 3 THEN 'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5 THEN
      'Deleted' WHEN 6 THEN 'Dropped' WHEN 7 THEN 'Custom Action' WHEN 8 THEN 'Approved'
      WHEN 9 THEN 'Restored' WHEN 99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN ACTION = 'alert' THEN 19 WHEN ACTION IN ('bypass',
      'allow') THEN 1 WHEN ACTION = 'block' THEN 2 WHEN ACTION IN ('Detection', 'anomaly_detection')
      THEN 15 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    duration: (CONNECTION_DURATION)::NUMBER
    end_time: (date_part('epoch_milliseconds', (SUPPRESSION_END_TIME)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (SUPPRESSION_END_TIME)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('dst_endpoint', OBJECT_CONSTRUCT_KEEP_NULL('location',
      OBJECT_CONSTRUCT_KEEP_NULL('country', DST_COUNTRY, 'coordinates', ARRAY_CONSTRUCT_COMPACT(DST_LATITUDE,
      DST_LONGITUDE), 'city', DST_LOCATION, 'region', DST_REGION, 'postal_code', IFF(DST_ZIPCODE
      IS NULL OR DST_ZIPCODE = 'N/A', NULL, DST_ZIPCODE)), 'zone', DST_TIMEZONE, 'ip',
      DST_IP, 'port', DST_PORT, 'hostname', DST_HOST, 'domain', DOMAIN), 'file', OBJECT_CONSTRUCT_KEEP_NULL('size',
      FILE_SIZE, 'mime_type', MIME_TYPE, 'path', COALESCE(FILE_PATH, ORIGNAL_FILE_PATH),
      'type_id', IFF(FILE_TYPE IS NULL, 0, 1), 'type', CASE (IFF(FILE_TYPE IS NULL,
      0, 1)) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Regular File' ELSE 'Other' END, 'hashes',
      OBJECT_CONSTRUCT_KEEP_NULL('value', COALESCE(SHA256, MD5), 'algorithm_id', CASE
      WHEN SHA256 IS NOT NULL THEN 3 WHEN MD5 IS NOT NULL THEN 1 WHEN COALESCE(SHA256,
      MD5) IS NULL THEN 0 ELSE 99 END, 'algorithm', CASE (CASE WHEN SHA256 IS NOT
      NULL THEN 3 WHEN MD5 IS NOT NULL THEN 1 WHEN COALESCE(SHA256, MD5) IS NULL THEN
      0 ELSE 99 END) WHEN 3 THEN 'SHA-256' WHEN 1 THEN 'MD5' WHEN 0 THEN 'Unknown'
      ELSE 'Other' END), 'name', COALESCE(DLP_FILE, LOG_FILE_NAME), 'uid', OBJECT_ID),
      'src_endpoint', OBJECT_CONSTRUCT_KEEP_NULL('location', OBJECT_CONSTRUCT_KEEP_NULL('country',
      SRC_COUNTRY, 'coordinates', ARRAY_CONSTRUCT_COMPACT(SRC_LATITUDE, SRC_LONGITUDE),
      'city', SRC_LOCATION, 'region', SRC_REGION), 'zone', SRC_TIMEZONE, 'postal_code',
      IFF(SRC_ZIPCODE IS NULL OR SRC_ZIPCODE = 'N/A', NULL, SRC_ZIPCODE), 'ip', SRC_IP),
      'actor', OBJECT_CONSTRUCT_KEEP_NULL('user', OBJECT_CONSTRUCT_KEEP_NULL('email_addr',
      COALESCE(USER, USER_KEY), 'name', SPLIT_PART(COALESCE(USER, USER_KEY), '@',
      1), 'uid', USER_ID, 'account', OBJECT_CONSTRUCT_KEEP_NULL('name', ACCOUNT_NAME,
      'uid', ACCOUNT_ID), 'org', OBJECT_CONSTRUCT_KEEP_NULL('name', ORG, 'uid', ORGANIZATION_ID)),
      'session', OBJECT_CONSTRUCT_KEEP_NULL('uid', COALESCE(SESSION_ID, APP_SESSION_ID)::VARCHAR),
      'authorizations', ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('policy', OBJECT_CONSTRUCT_KEEP_NULL('name',
      POLICY, 'uid', POLICY_ID)))), 'connection_info', OBJECT_CONSTRUCT_KEEP_NULL('uid',
      CONNECTION_ID::VARCHAR, 'protocol_ver_id', PARSE_IP(USER_IP, 'INET', 1):family::NUMBER,
      'protocol_ver', CASE (PARSE_IP(USER_IP, 'INET', 1):family::NUMBER) WHEN 4 THEN
      'Internet Protocol version 4 (IPv4)' WHEN 6 THEN 'Internet Protocol version
      6 (IPv6)' WHEN 0 THEN 'Unknown' WHEN 99 THEN 'Other' END))))::ARRAY
    finding_info.analytic.name: (ALERT_NAME)::VARCHAR
    finding_info.analytic.type: (CASE ((CASE WHEN ALERT_TYPE IN ('policy', 'uba')
      THEN 1 WHEN ALERT_TYPE = 'Malware' THEN 2 WHEN ALERT_TYPE IS NULL THEN 0 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Rule' WHEN 2 THEN 'Behavioral'
      WHEN 3 THEN 'Statistical' WHEN 4 THEN 'Learning (ML/DL)' WHEN 99 THEN 'Other'
      END)::VARCHAR
    finding_info.analytic.type_id: (CASE WHEN ALERT_TYPE IN ('policy', 'uba') THEN
      1 WHEN ALERT_TYPE = 'Malware' THEN 2 WHEN ALERT_TYPE IS NULL THEN 0 ELSE 99
      END)::NUMBER
    finding_info.analytic.uid: (ALERT_ID)::VARCHAR
    finding_info.desc: (BREACH_DESCRIPTION)::VARCHAR
    finding_info.src_url: (URL)::VARCHAR
    finding_info.title: (TITLE)::VARCHAR
    finding_info.uid: (TRANSACTION_ID)::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: (ALERT_NAME)::VARCHAR
    metadata.event_code: (alert_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('netskope-v2-alerts')::VARCHAR
    metadata.product.vendor_name: ('netskope-v2')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (COALESCE(USER, USER_KEY))::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (SPLIT_PART(COALESCE(USER, USER_KEY), '@', 1))::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DOMAIN)::VARCHAR
    - name: '''finding_info.src_url'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (URL)::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('uid', COALESCE(DLP_INCIDENT_ID,
      DLP_PARENT_ID)::VARCHAR, 'criticality', DLP_RULE_SEVERITY, 'name', DLP_PROFILE,
      'namespace', DLP_FILE, 'type', DLP_RULE)))::ARRAY
    risk_level: NULL::VARCHAR
    risk_level_id: NULL::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE ((CASE WHEN SEVERITY = 'informational' THEN 1 WHEN SEVERITY =
      'High' THEN 4 WHEN SEVERITY = 'medium' THEN 3 WHEN SEVERITY IS NULL THEN 0 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN 2 THEN
      'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical' WHEN 6
      THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY = 'informational' THEN 1 WHEN SEVERITY = 'High'
      THEN 4 WHEN SEVERITY = 'medium' THEN 3 WHEN SEVERITY IS NULL THEN 0 ELSE 99
      END)::NUMBER
    start_time: (date_part('epoch_milliseconds', (SUPPRESSION_START_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (SUPPRESSION_START_TIME)::TIMESTAMP_LTZ
    status: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'New' WHEN 2 THEN
      'In Progress' WHEN 3 THEN 'Suppressed' WHEN 4 THEN 'Resolved' WHEN 99 THEN 'Other'
      END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (0)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((200400 + (CASE WHEN ACTIVITY IN (''Create'', ''Upload'', ''Send'',
      ''Download'') THEN 1 WHEN ACTIVITY IN (''Delete'', ''Login Failed'') THEN 3
      WHEN ACTIVITY IN (''Post'', ''Move'', ''Browse'') THEN 2 WHEN ACTIVITY IS NULL
      THEN 0 ELSE 99 END))::NUMBER) WHEN 200400 THEN ''Detection Finding: Unknown''
      WHEN 200401 THEN ''Detection Finding: Create'' WHEN 200402 THEN ''Detection
      Finding: Update'' WHEN 200403 THEN ''Detection Finding: Close'' WHEN 200499
      THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: (200400 + (CASE WHEN ACTIVITY IN ('Create', 'Upload', 'Send', 'Download')
      THEN 1 WHEN ACTIVITY IN ('Delete', 'Login Failed') THEN 3 WHEN ACTIVITY IN ('Post',
      'Move', 'Browse') THEN 2 WHEN ACTIVITY IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
