type: mapping
id: netskope_v2_audit_events_3002_authentication_1.1.0
version: '1'
name: Netskope V2 Audit Events to OCSF class Authentication
data-types:
- netskope-v2-audit-events
mapping:
  fields:
    activity_id: (CASE WHEN AUDIT_LOG_EVENT IS NULL THEN 0 WHEN AUDIT_LOG_EVENT ILIKE
      '%login%' THEN 1 WHEN AUDIT_LOG_EVENT ILIKE '%logout%' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN AUDIT_LOG_EVENT IS NULL THEN 0 WHEN AUDIT_LOG_EVENT
      ILIKE '%login%' THEN 1 WHEN AUDIT_LOG_EVENT ILIKE '%logout%' THEN 2 ELSE 99
      END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN 2 THEN 'Logoff'
      WHEN 3 THEN 'Authentication Ticket' WHEN 4 THEN 'Service Ticket Request' WHEN
      5 THEN 'Service Ticket Renew' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: NULL::VARCHAR
    auth_protocol_id: NULL::NUMBER
    category_name: (CASE (3::NUMBER) WHEN 3 THEN 'Identity & Access Management' END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: (COUNT)::NUMBER
    device: NULL::VARIANT
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: NULL::VARCHAR
    metadata.event_code: (type)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('netskope-v2-audit-events')::VARCHAR
    metadata.product.vendor_name: ('netskope-v2')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER_PRINCIPAL_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session: NULL::VARIANT
    severity: (CASE (SEVERITY_LEVEL::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (SEVERITY_LEVEL)::NUMBER
    src_endpoint: NULL::VARIANT
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN AUDIT_LOG_EVENT IS NULL THEN 0 WHEN AUDIT_LOG_EVENT ILIKE
      '%success%' THEN 1 WHEN AUDIT_LOG_EVENT ILIKE '%fail%' THEN 2 ELSE 99 END::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (AUDIT_LOG_EVENT)::VARCHAR
    status_id: (CASE WHEN AUDIT_LOG_EVENT IS NULL THEN 0 WHEN AUDIT_LOG_EVENT ILIKE
      '%success%' THEN 1 WHEN AUDIT_LOG_EVENT ILIKE '%fail%' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (CASE WHEN AUDIT_LOG_EVENT IS NULL THEN 300200 WHEN AUDIT_LOG_EVENT
      ILIKE ''%login%'' THEN 300201 WHEN AUDIT_LOG_EVENT ILIKE ''%logout%'' THEN 300202
      ELSE 3002099 END::NUMBER) WHEN 300200 THEN ''Authentication: Unknown'' WHEN
      300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication: Logoff''
      WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204 THEN
      ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN AUDIT_LOG_EVENT IS NULL THEN 300200 WHEN AUDIT_LOG_EVENT
      ILIKE '%login%' THEN 300201 WHEN AUDIT_LOG_EVENT ILIKE '%logout%' THEN 300202
      ELSE 3002099 END)::NUMBER
    unmapped: NULL::VARIANT
    user.account.name: (SAM_ACCOUNT_NAME)::VARCHAR
    user.email_addr: (USER)::VARCHAR
    user.name: (USER_PRINCIPAL_NAME)::VARCHAR
    user.type: (CASE (CASE WHEN SUPPORTING_DATA_TYPE IS NULL THEN 0 WHEN SUPPORTING_DATA_TYPE
      ILIKE '%user%' THEN 1 WHEN SUPPORTING_DATA_TYPE ILIKE '%admin%' THEN 2 ELSE
      99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin'
      WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN SUPPORTING_DATA_TYPE IS NULL THEN 0 WHEN SUPPORTING_DATA_TYPE
      ILIKE '%user%' THEN 1 WHEN SUPPORTING_DATA_TYPE ILIKE '%admin%' THEN 2 ELSE
      99 END)::NUMBER
    user.uid: (ID)::VARCHAR
  predicate: AUDIT_LOG_EVENT ILIKE ANY ('%login%', '%logout%')
