type: mapping
id: o365_audit_logs_6003_api_activity_1.1.0
version: '12'
name: O365 Audit Logs to OCSF class Api Activity
data-types:
- o365-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION ILIKE '%Create%'
      THEN 1 WHEN OPERATION ILIKE '%Read%' OR OPERATION ILIKE '%Get%' THEN 2 WHEN
      OPERATION ILIKE '%Update%' THEN 3 WHEN OPERATION ILIKE '%Delete%' THEN 4 ELSE
      99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION ILIKE
      '%Create%' THEN 1 WHEN OPERATION ILIKE '%Read%' OR OPERATION ILIKE '%Get%' THEN
      2 WHEN OPERATION ILIKE '%Update%' THEN 3 WHEN OPERATION ILIKE '%Delete%' THEN
      4 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN
      'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.file.name: (RAW:SourceFileName)::VARCHAR
    actor.process.file.parent_folder: (RECORD_SPECIFIC_DETAILS:parent_folder:Path)::VARCHAR
    actor.process.name: (RECORD_SPECIFIC_DETAILS:client_process_name)::VARCHAR
    actor.session.uid: (RECORD_SPECIFIC_DETAILS:session_id)::VARCHAR
    actor.user.domain: (RAW:user:domain)::VARCHAR
    actor.user.email_addr: (COALESCE(USER_ID, RAW:user:email))::VARCHAR
    actor.user.name: (COALESCE(USER_ID, RAW:user:email))::VARCHAR
    actor.user.org.name: (RECORD_SPECIFIC_DETAILS:organization_name)::VARCHAR
    actor.user.org.uid: (ORGANIZATION_ID)::VARCHAR
    actor.user.type: (CASE ((CASE WHEN USER_TYPE IS NULL THEN 0 WHEN USER_TYPE = 0
      THEN 1 WHEN USER_TYPE = 2 THEN 2 WHEN USER_TYPE = 4 THEN 3 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (CASE WHEN USER_TYPE IS NULL THEN 0 WHEN USER_TYPE = 0 THEN
      1 WHEN USER_TYPE = 2 THEN 2 WHEN USER_TYPE = 4 THEN 3 ELSE 99 END)::NUMBER
    actor.user.uid: (USER_KEY)::VARCHAR
    api.operation: (OPERATION)::VARCHAR
    api.request.uid: (RECORD_SPECIFIC_DETAILS:client_request_id)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud.account.uid: (RAW:cloud:account:id)::VARCHAR
    cloud.provider: (RAW:cloud:provider)::VARCHAR
    cloud.region: (RAW:cloud:region)::VARCHAR
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.url.url_string: (RAW:SiteUrl)::VARCHAR
    http_request.user_agent: (RAW:UserAgent)::VARCHAR
    message: NULL::VARCHAR
    metadata.event_code: (workload)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('o365-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('office365')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (RAW:SourceFileName)::VARCHAR
    - name: '''actor.process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (RECORD_SPECIFIC_DETAILS:client_process_name)::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (COALESCE(USER_ID, RAW:user:email))::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(USER_ID, RAW:user:email))::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (RAW:SiteUrl)::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (RAW:host:name)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    resources: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', IFF(SPLIT_PART(OBJECT_ID,
      '\\', -1) ILIKE '%.%', SPLIT_PART(OBJECT_ID, '\\', -1), NULL), 'uid', IFF(SPLIT_PART(OBJECT_ID,
      '\\', -1) ILIKE '%.%', NULL, SPLIT_PART(OBJECT_ID, '\\', -1)))))::ARRAY
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.hostname: (RAW:host:name)::VARCHAR
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    src_endpoint.uid: (RAW:host:id)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RESULT_STATUS IS NULL THEN 0 WHEN RESULT_STATUS IN ('Success',
      'Succeeded') THEN 1 WHEN RESULT_STATUS='Failed' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN RESULT_STATUS IS NULL THEN 0 WHEN RESULT_STATUS IN ('Success',
      'Succeeded') THEN 1 WHEN RESULT_STATUS='Failed' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((600300 + (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION
      ILIKE ''%Create%'' THEN 1 WHEN OPERATION ILIKE ''%Read%'' OR OPERATION ILIKE
      ''%Get%'' THEN 2 WHEN OPERATION ILIKE ''%Update%'' THEN 3 WHEN OPERATION ILIKE
      ''%Delete%'' THEN 4 ELSE 99 END))::NUMBER) WHEN 600300 THEN ''API Activity:
      Unknown'' WHEN 600301 THEN ''API Activity: Create'' WHEN 600302 THEN ''API Activity:
      Read'' WHEN 600303 THEN ''API Activity: Update'' WHEN 600304 THEN ''API Activity:
      Delete'' WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (600300 + (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION ILIKE '%Create%'
      THEN 1 WHEN OPERATION ILIKE '%Read%' OR OPERATION ILIKE '%Get%' THEN 2 WHEN
      OPERATION ILIKE '%Update%' THEN 3 WHEN OPERATION ILIKE '%Delete%' THEN 4 ELSE
      99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: OPERATION = 'SharingPolicyChanged' OR OPERATION ILIKE '%Create%' OR OPERATION
    ILIKE '%Read%' OR OPERATION ILIKE '%Get%' OR OPERATION ILIKE '%Update%' OR OPERATION
    ILIKE '%Delete%'
