type: mapping
id: o365_audit_logs_2004_detection_finding_1.1.0
version: '1'
name: O365 Audit Logs to OCSF class Detection Finding
data-types:
- o365-audit-logs
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN OPERATION ILIKE '%triggered%' THEN 1 WHEN OPERATION ILIKE
      '%updated%' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN OPERATION ILIKE '%triggered%' THEN 1 WHEN OPERATION
      ILIKE '%updated%' THEN 2 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Create' WHEN 2 THEN 'Update' WHEN 3 THEN 'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (CASE WHEN USER_ID LIKE '%@%' THEN USER_ID ELSE NULL END)::VARCHAR
    actor.user.name: (CASE WHEN USER_ID NOT LIKE '%@%' THEN USER_ID ELSE NULL END)::VARCHAR
    actor.user.type: (CASE (CASE WHEN USER_TYPE=0 THEN 1 WHEN USER_TYPE=2 THEN 2 WHEN
      USER_TYPE=4 THEN 3 WHEN USER_TYPE IS NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (CASE WHEN USER_TYPE=0 THEN 1 WHEN USER_TYPE=2 THEN 2 WHEN
      USER_TYPE=4 THEN 3 WHEN USER_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    actor.user.uid: (USER_KEY)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((2)::NUMBER) WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: (2)::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud.org.uid: (ORGANIZATION_ID)::VARCHAR
    comment: (RECORD_SPECIFIC_DETAILS:comments)::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: NULL::NUMBER
    confidence_score: NULL::NUMBER
    count: NULL::NUMBER
    device.ip: (CLIENT_IP)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: NULL::ARRAY
    finding_info.created_time: (date_part('epoch_milliseconds', RECORD_SPECIFIC_DETAILS:creation_time::TIMESTAMP_LTZ))::NUMBER
    finding_info.created_time_dt: (RECORD_SPECIFIC_DETAILS:creation_time)::TIMESTAMP_LTZ
    finding_info.title: (RECORD_SPECIFIC_DETAILS:name)::VARCHAR
    finding_info.types: (ARRAY_CONSTRUCT(RECORD_SPECIFIC_DETAILS:alert_type))::ARRAY
    finding_info.uid: (RECORD_SPECIFIC_DETAILS:alert_id)::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (workload)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('o365-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('office365')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (CASE WHEN USER_ID LIKE '%@%' THEN USER_ID ELSE NULL END)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (CASE WHEN USER_ID NOT LIKE '%@%' THEN USER_ID ELSE NULL END)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: NULL::ARRAY
    risk_level: NULL::VARCHAR
    risk_level_id: NULL::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE (CASE WHEN RECORD_SPECIFIC_DETAILS:severity IS NULL THEN 0 WHEN
      RECORD_SPECIFIC_DETAILS:severity = 'Low' THEN 2 ELSE 99 END::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium'
      WHEN 4 THEN 'High' WHEN 5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other'
      END)::VARCHAR
    severity_id: (CASE WHEN RECORD_SPECIFIC_DETAILS:severity IS NULL THEN 0 WHEN RECORD_SPECIFIC_DETAILS:severity
      = 'Low' THEN 2 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN RESULT_STATUS IS NULL THEN 0 WHEN RESULT_STATUS ILIKE
      '%succ%' THEN 4 WHEN RESULT_STATUS ILIKE '%new%' THEN 1 ELSE 99 END::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'New' WHEN 2 THEN 'In Progress' WHEN 3 THEN
      'Suppressed' WHEN 4 THEN 'Resolved' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (RECORD_SPECIFIC_DETAILS:status)::VARCHAR
    status_id: (CASE WHEN RESULT_STATUS IS NULL THEN 0 WHEN RESULT_STATUS ILIKE '%succ%'
      THEN 4 WHEN RESULT_STATUS ILIKE '%new%' THEN 1 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((200400 + (CASE WHEN OPERATION ILIKE ''%triggered%'' THEN 1
      WHEN OPERATION ILIKE ''%updated%'' THEN 2 ELSE 99 END))::NUMBER) WHEN 200400
      THEN ''Detection Finding: Unknown'' WHEN 200401 THEN ''Detection Finding: Create''
      WHEN 200402 THEN ''Detection Finding: Update'' WHEN 200403 THEN ''Detection
      Finding: Close'' WHEN 200499 THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: (200400 + (CASE WHEN OPERATION ILIKE '%triggered%' THEN 1 WHEN OPERATION
      ILIKE '%updated%' THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
  predicate: OPERATION IN ('AlertTriggered', 'AlertUpdated', 'Get-ProtectionAlert',
    'DefenseEvasion', 'EvaluateDataSourcesAgainstTenantDlpPolicies', 'MDCAssessments',
    'UserSubmissionTriage', 'AttackSimUserSubmission')
