type: mapping
id: o365_audit_logs_3001_account_change_1.1.0
version: '10'
name: O365 Audit Logs to OCSF class Account Change
data-types:
- o365-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION ILIKE '%add user%'
      THEN 1 WHEN OPERATION ILIKE '%Enable%' THEN 2 WHEN OPERATION ILIKE '%Change
      user password%' THEN 3 WHEN OPERATION ILIKE '%Reset user password%' THEN 4 WHEN
      OPERATION ILIKE '%Disable%' THEN 5 WHEN OPERATION ILIKE ANY ('%Delete%', '%remove%')
      THEN 6 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION ILIKE
      '%add user%' THEN 1 WHEN OPERATION ILIKE '%Enable%' THEN 2 WHEN OPERATION ILIKE
      '%Change user password%' THEN 3 WHEN OPERATION ILIKE '%Reset user password%'
      THEN 4 WHEN OPERATION ILIKE '%Disable%' THEN 5 WHEN OPERATION ILIKE ANY ('%Delete%',
      '%remove%') THEN 6 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create'
      WHEN 10 THEN 'MFA Factor Enable' WHEN 11 THEN 'MFA Factor Disable' WHEN 2 THEN
      'Enable' WHEN 3 THEN 'Password Change' WHEN 4 THEN 'Password Reset' WHEN 5 THEN
      'Disable' WHEN 6 THEN 'Delete' WHEN 7 THEN 'Attach Policy' WHEN 8 THEN 'Detach
      Policy' WHEN 9 THEN 'Lock' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('account_change')::VARCHAR
    class_uid: ('3001')::NUMBER
    cloud.org.uid: (ORGANIZATION_ID)::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: (RECORD_SPECIFIC_DETAILS:result_description)::VARCHAR
    metadata.event_code: (workload)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('o365-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('office365')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (COALESCE(USER_ID, OBJECT_ID))::VARCHAR
    - name: '''user_result.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:user_principal_name:NewValue)[0])::VARCHAR
    policy: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RESULT_STATUS IS NULL THEN 0 WHEN RESULT_STATUS IN ('Success',
      'Succeeded') THEN 1 WHEN RESULT_STATUS IN ('Failed', 'Failure') THEN 2 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure'
      WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN RESULT_STATUS IS NULL THEN 0 WHEN RESULT_STATUS IN ('Success',
      'Succeeded') THEN 1 WHEN RESULT_STATUS IN ('Failed', 'Failure') THEN 2 ELSE
      99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300100 + (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION
      ILIKE ''%add user%'' THEN 1 WHEN OPERATION ILIKE ''%Enable%'' THEN 2 WHEN OPERATION
      ILIKE ''%Change user password%'' THEN 3 WHEN OPERATION ILIKE ''%Reset user password%''
      THEN 4 WHEN OPERATION ILIKE ''%Disable%'' THEN 5 WHEN OPERATION ILIKE ANY (''%Delete%'',
      ''%remove%'') THEN 6 ELSE 99 END))::NUMBER) WHEN 300100 THEN ''Account Change:
      Unknown'' WHEN 300101 THEN ''Account Change: Create'' WHEN 300102 THEN ''Account
      Change: Enable'' WHEN 300103 THEN ''Account Change: Password Change'' WHEN 300104
      THEN ''Account Change: Password Reset'' WHEN 300105 THEN ''Account Change: Disable''
      WHEN 300106 THEN ''Account Change: Delete'' WHEN 300107 THEN ''Account Change:
      Attach Policy'' WHEN 300108 THEN ''Account Change: Detach Policy'' WHEN 300109
      THEN ''Account Change: Lock'' WHEN 300110 THEN ''Account Change: MFA Factor
      Enable'' WHEN 300111 THEN ''Account Change: MFA Factor Disable'' WHEN 300199
      THEN ''Account Change: Other'' END)::VARCHAR'
    type_uid: (300100 + (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION ILIKE '%add
      user%' THEN 1 WHEN OPERATION ILIKE '%Enable%' THEN 2 WHEN OPERATION ILIKE '%Change
      user password%' THEN 3 WHEN OPERATION ILIKE '%Reset user password%' THEN 4 WHEN
      OPERATION ILIKE '%Disable%' THEN 5 WHEN OPERATION ILIKE ANY ('%Delete%', '%remove%')
      THEN 6 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (COALESCE(USER_ID, OBJECT_ID))::VARCHAR
    user.type: (CASE ((CASE WHEN USER_TYPE IS NULL THEN 0 WHEN USER_TYPE = 0 THEN
      1 WHEN USER_TYPE = 2 THEN 2 WHEN USER_TYPE = 4 THEN 3 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System'
      WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN USER_TYPE IS NULL THEN 0 WHEN USER_TYPE = 0 THEN 1 WHEN
      USER_TYPE = 2 THEN 2 WHEN USER_TYPE = 4 THEN 3 ELSE 99 END)::NUMBER
    user.uid: (USER_KEY)::VARCHAR
    user_result.email_addr: (PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:user_principal_name:NewValue)[0])::VARCHAR
    user_result.full_name: (COALESCE(PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:display_name:NewValue)[0]::VARCHAR,
      RECORD_SPECIFIC_DETAILS:modified_properties:action__client__name:NewValue::VARCHAR))::VARCHAR
    user_result.ldap_person.employee_uid: (PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:employee_id:NewValue)[0])::VARCHAR
    user_result.ldap_person.given_name: (PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:given_name:NewValue)[0])::VARCHAR
    user_result.ldap_person.job_title: (PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:job_title:NewValue)[0])::VARCHAR
    user_result.ldap_person.location.city: (PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:city:NewValue)[0])::VARCHAR
    user_result.ldap_person.location.postal_code: (PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:postal_code:NewValue)[0])::VARCHAR
    user_result.ldap_person.surname: (PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:surname:NewValue)[0])::VARCHAR
    user_result.org.name: (COALESCE(PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:company_name:NewValue)[0]::VARCHAR,
      PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:physical_delivery_office_name:NewValue)[0]::VARCHAR))::VARCHAR
    user_result.org.ou_name: (PARSE_JSON(RECORD_SPECIFIC_DETAILS:modified_properties:department:NewValue)[0])::VARCHAR
    user_result.type: (CASE ((CASE WHEN RECORD_SPECIFIC_DETAILS:modified_properties:"target_id._user_type":NewValue
      IS NULL THEN 0 WHEN RECORD_SPECIFIC_DETAILS:modified_properties:"target_id._user_type":NewValue
      = 'Member' THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User'
      WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    user_result.type_id: (CASE WHEN RECORD_SPECIFIC_DETAILS:modified_properties:"target_id._user_type":NewValue
      IS NULL THEN 0 WHEN RECORD_SPECIFIC_DETAILS:modified_properties:"target_id._user_type":NewValue
      = 'Member' THEN 1 ELSE 99 END)::NUMBER
  predicate: OPERATION = 'SharingPolicyChanged' OR OPERATION ILIKE '%account%' OR
    OPERATION ILIKE '% user%'
