type: mapping
id: o365_audit_logs_4001_network_activity_1.1.0
version: '1'
name: O365 Audit Logs to OCSF class Network Activity
data-types:
- o365-audit-logs
mapping:
  fields:
    action: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN
      'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN OPERATION IN ('PutConnection', 'ConnectFromExternalApplication',
      'ConnectWarehouseAndSqlAnalyticsEndpointLakehouseFromExternalApp') THEN 1 WHEN
      OPERATION IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION IN ('PutConnection', 'ConnectFromExternalApplication',
      'ConnectWarehouseAndSqlAnalyticsEndpointLakehouseFromExternalApp') THEN 1 WHEN
      OPERATION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1
      THEN 'Open' WHEN 2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN
      5 THEN 'Refuse' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.session.uid: (RAW:SessionId)::VARCHAR
    actor.user.credential_uid: (USER_KEY)::VARCHAR
    actor.user.email_addr: (USER_ID)::VARCHAR
    actor.user.org.name: (RAW:OrganizationName)::VARCHAR
    actor.user.org.uid: (ORGANIZATION_ID)::VARCHAR
    actor.user.type: (CASE ((CASE WHEN USER_TYPE=0 THEN 1 WHEN USER_TYPE=2 THEN 2
      WHEN USER_TYPE=4 THEN 3 WHEN USER_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (CASE WHEN USER_TYPE=0 THEN 1 WHEN USER_TYPE=2 THEN 2 WHEN
      USER_TYPE=4 THEN 3 WHEN USER_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    api: NULL::VARIANT
    app_name: (COALESCE(RAW:SourceApp, RAW:ClientAppId, RAW:AppId))::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.name: (RAW:OriginatingServer)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (OPERATION)::VARCHAR
    metadata.event_code: (workload)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('o365-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('office365')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER_ID)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    start_time: (date_part('epoch_milliseconds', (RAW:CreationTime)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (RAW:CreationTime)::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RESULT_STATUS='Success' THEN 1 WHEN RESULT_STATUS IS
      NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success'
      WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (RESULT_STATUS)::VARCHAR
    status_id: (CASE WHEN RESULT_STATUS='Success' THEN 1 WHEN RESULT_STATUS IS NULL
      THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400100 + (CASE WHEN OPERATION IN (''PutConnection'', ''ConnectFromExternalApplication'',
      ''ConnectWarehouseAndSqlAnalyticsEndpointLakehouseFromExternalApp'') THEN 1
      WHEN OPERATION IS NULL THEN 0 ELSE 99 END))::NUMBER) WHEN 400100 THEN ''Network
      Activity: Unknown'' WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102
      THEN ''Network Activity: Close'' WHEN 400103 THEN ''Network Activity: Reset''
      WHEN 400104 THEN ''Network Activity: Fail'' WHEN 400105 THEN ''Network Activity:
      Refuse'' WHEN 400106 THEN ''Network Activity: Traffic'' WHEN 400199 THEN ''Network
      Activity: Other'' END)::VARCHAR'
    type_uid: (400100 + (CASE WHEN OPERATION IN ('PutConnection', 'ConnectFromExternalApplication',
      'ConnectWarehouseAndSqlAnalyticsEndpointLakehouseFromExternalApp') THEN 1 WHEN
      OPERATION IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
  predicate: OPERATION LIKE ANY ('NetworkConfigurationUpdated', 'PutConnection', 'SFAddNetworkSecurityRule',
    'ConnectFromExternalApplication', 'ConnectWarehouseAndSqlAnalyticsEndpointLakehouseFromExternalApp',
    'Set-InboundConnector')
