type: mapping
id: o365_audit_logs_3005_user_access_1.1.0
version: '9'
name: O365 Audit Logs to OCSF class User Access
data-types:
- o365-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION ILIKE ANY ('%assigned%',
      '%add%', '%put%', '%update%', '%modif%', '%AppPermissionGrant%', '%GrantPermissions%',
      '%RoleChanged%', '%RequestCreated%') THEN 1 WHEN OPERATION ILIKE ANY ('%revoke%',
      '%remove%') THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION ILIKE
      ANY ('%assigned%', '%add%', '%put%', '%update%', '%modif%', '%AppPermissionGrant%',
      '%GrantPermissions%', '%RoleChanged%', '%RequestCreated%') THEN 1 WHEN OPERATION
      ILIKE ANY ('%revoke%', '%remove%') THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Assign Privileges' WHEN 2 THEN 'Revoke Privileges' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (CASE WHEN RECORD_SPECIFIC_DETAILS:actor[0]:Type = 5 AND
      RECORD_SPECIFIC_DETAILS:actor[0]:ID ILIKE '%@%' THEN RECORD_SPECIFIC_DETAILS:actor[0]:ID
      ELSE NULL END)::VARCHAR
    actor.user.name: (CASE WHEN RECORD_SPECIFIC_DETAILS:actor[0]:Type = 1 THEN RECORD_SPECIFIC_DETAILS:actor[0]:ID
      ELSE NULL END)::VARCHAR
    actor.user.uid: (CASE WHEN RECORD_SPECIFIC_DETAILS:actor[0]:Type = 2 THEN RECORD_SPECIFIC_DETAILS:actor[0]:ID
      ELSE NULL END)::VARCHAR
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('user_access')::VARCHAR
    class_uid: ('3005')::NUMBER
    cloud.org.uid: (ORGANIZATION_ID)::VARCHAR
    count: NULL::NUMBER
    device.ip: (CLIENT_IP)::VARCHAR
    device.is_managed: (RECORD_SPECIFIC_DETAILS:is_managed_device)::BOOLEAN
    device.name: (RECORD_SPECIFIC_DETAILS:originating_server)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: (OPERATION)::VARCHAR
    metadata.event_code: (workload)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('o365-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('office365')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (CASE WHEN RECORD_SPECIFIC_DETAILS:actor[0]:Type = 5 AND RECORD_SPECIFIC_DETAILS:actor[0]:ID
        ILIKE '%@%' THEN RECORD_SPECIFIC_DETAILS:actor[0]:ID ELSE NULL END)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (CASE WHEN RECORD_SPECIFIC_DETAILS:actor[0]:Type = 1 THEN RECORD_SPECIFIC_DETAILS:actor[0]:ID
        ELSE NULL END)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (CASE WHEN COALESCE(USER_ID, OBJECT_ID) ILIKE '%@%' THEN COALESCE(USER_ID,
        OBJECT_ID) ELSE NULL END)::VARCHAR
    privileges: (ARRAY_CONSTRUCT(IFF(RAW:ModifiedProperties[1]:Name = 'Role.DisplayName',
      RAW:ModifiedProperties[1]:NewValue, NULL)))::ARRAY
    raw_data: NULL::VARCHAR
    resource.name: (RECORD_SPECIFIC_DETAILS:modified_properties['role._display_name']:NewValue)::VARCHAR
    resource.uid: (RECORD_SPECIFIC_DETAILS:modified_properties['role._object_id']:NewValue)::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RESULT_STATUS IS NULL THEN 0 WHEN RESULT_STATUS IN ('Success',
      'Succeeded') THEN 1 WHEN RESULT_STATUS IN ('Failed', 'Failure') THEN 2 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure'
      WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN RESULT_STATUS IS NULL THEN 0 WHEN RESULT_STATUS IN ('Success',
      'Succeeded') THEN 1 WHEN RESULT_STATUS IN ('Failed', 'Failure') THEN 2 ELSE
      99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300500 + (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION
      ILIKE ANY (''%assigned%'', ''%add%'', ''%put%'', ''%update%'', ''%modif%'',
      ''%AppPermissionGrant%'', ''%GrantPermissions%'', ''%RoleChanged%'', ''%RequestCreated%'')
      THEN 1 WHEN OPERATION ILIKE ANY (''%revoke%'', ''%remove%'') THEN 2 ELSE 99
      END))::NUMBER) WHEN 300500 THEN ''User Access Management: Unknown'' WHEN 300501
      THEN ''User Access Management: Assign Privileges'' WHEN 300502 THEN ''User Access
      Management: Revoke Privileges'' WHEN 300599 THEN ''User Access Management: Other''
      END)::VARCHAR'
    type_uid: (300500 + (CASE WHEN OPERATION IS NULL THEN 0 WHEN OPERATION ILIKE ANY
      ('%assigned%', '%add%', '%put%', '%update%', '%modif%', '%AppPermissionGrant%',
      '%GrantPermissions%', '%RoleChanged%', '%RequestCreated%') THEN 1 WHEN OPERATION
      ILIKE ANY ('%revoke%', '%remove%') THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.domain: (RECORD_SPECIFIC_DETAILS:organization_name)::VARCHAR
    user.email_addr: (CASE WHEN COALESCE(USER_ID, OBJECT_ID) ILIKE '%@%' THEN COALESCE(USER_ID,
      OBJECT_ID) ELSE NULL END)::VARCHAR
    user.type: (CASE ((CASE WHEN USER_TYPE IS NULL THEN 0 WHEN USER_TYPE = 0 THEN
      1 WHEN USER_TYPE = 2 THEN 2 WHEN USER_TYPE = 4 THEN 3 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System'
      WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN USER_TYPE IS NULL THEN 0 WHEN USER_TYPE = 0 THEN 1 WHEN
      USER_TYPE = 2 THEN 2 WHEN USER_TYPE = 4 THEN 3 ELSE 99 END)::NUMBER
    user.uid: (USER_KEY)::VARCHAR
  predicate: OPERATION = 'SharingPolicyChanged' OR OPERATION ILIKE ANY ('%role%',
    '%permission%', '%revoke%', '%owner%policy%')
