type: mapping
id: okta_logs_3002_authentication_1.1.0
version: '13'
name: Okta Logs to OCSF class Authentication
data-types:
- okta-logs
mapping:
  fields:
    activity_id: (IFF(EVENT_TYPE = 'user.authentication.slo', 2, 1))::NUMBER
    activity_name: (CASE ((IFF(EVENT_TYPE = 'user.authentication.slo', 2, 1))::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN 2 THEN 'Logoff' WHEN 3 THEN 'Authentication
      Ticket' WHEN 4 THEN 'Service Ticket Request' WHEN 5 THEN 'Service Ticket Renew'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (ACTOR_ALTERNATE_ID)::VARCHAR
    actor.user.name: (ACTOR_DISPLAY_NAME)::VARCHAR
    actor.user.type: (CASE ((CASE WHEN ACTOR_TYPE IS NULL THEN 0 WHEN ACTOR_TYPE =
      'User' THEN 1 WHEN ACTOR_TYPE = 'SystemPrincipal' THEN 3 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (CASE WHEN ACTOR_TYPE IS NULL THEN 0 WHEN ACTOR_TYPE = 'User'
      THEN 1 WHEN ACTOR_TYPE = 'SystemPrincipal' THEN 3 ELSE 99 END)::NUMBER
    actor.user.uid: (ACTOR_ID)::VARCHAR
    api: NULL::VARIANT
    auth_protocol: (CASE ((CASE WHEN DEBUG_CONTEXT:debugData:signOnMode ILIKE '%OpenID%'
      THEN 4 WHEN DEBUG_CONTEXT:debugData:signOnMode ILIKE '%SAML%' THEN 5 WHEN EVENT_TYPE
      = 'user.authentication.auth_via_radius' THEN 10 ELSE 99 END)::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'NTLM' WHEN 10 THEN 'RADIUS' WHEN 2 THEN 'Kerberos'
      WHEN 3 THEN 'Digest' WHEN 4 THEN 'OpenID' WHEN 5 THEN 'SAML' WHEN 6 THEN 'OAUTH
      2.0' WHEN 7 THEN 'PAP' WHEN 8 THEN 'CHAP' WHEN 9 THEN 'EAP' WHEN 99 THEN 'Other'
      END)::VARCHAR
    auth_protocol_id: (CASE WHEN DEBUG_CONTEXT:debugData:signOnMode ILIKE '%OpenID%'
      THEN 4 WHEN DEBUG_CONTEXT:debugData:signOnMode ILIKE '%SAML%' THEN 5 WHEN EVENT_TYPE
      = 'user.authentication.auth_via_radius' THEN 10 ELSE 99 END)::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.org.name: (SECURITY_CONTEXT:asOrg)::VARCHAR
    device.risk_level: (CASE ((CASE REGEXP_SUBSTR(DEBUG_CONTEXT:debugData:risk::VARCHAR,
      'level=(\\w+)', 1, 1, 'e', 1) WHEN 'LOW' THEN 1 WHEN 'MEDIUM' THEN 2 WHEN 'HIGH'
      THEN 3 ELSE 0 END)::NUMBER) WHEN 0 THEN 'Info' WHEN 1 THEN 'Low' WHEN 2 THEN
      'Medium' WHEN 3 THEN 'High' WHEN 4 THEN 'Critical' END)::VARCHAR
    device.risk_level_id: (CASE REGEXP_SUBSTR(DEBUG_CONTEXT:debugData:risk::VARCHAR,
      'level=(\\w+)', 1, 1, 'e', 1) WHEN 'LOW' THEN 1 WHEN 'MEDIUM' THEN 2 WHEN 'HIGH'
      THEN 3 ELSE 0 END)::NUMBER
    device.type: (CASE ((CASE WHEN CLIENT_DEVICE ILIKE 'unknown' OR CLIENT_DEVICE
      IS NULL THEN 0 WHEN CLIENT_DEVICE = 'Computer' THEN 2 WHEN CLIENT_DEVICE = 'Tablet'
      THEN 4 WHEN CLIENT_DEVICE = 'Mobile' THEN 5 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Server' WHEN 10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN
      2 THEN 'Desktop' WHEN 3 THEN 'Laptop' WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile'
      WHEN 6 THEN 'Virtual' WHEN 7 THEN 'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall'
      WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN CLIENT_DEVICE ILIKE 'unknown' OR CLIENT_DEVICE IS NULL
      THEN 0 WHEN CLIENT_DEVICE = 'Computer' THEN 2 WHEN CLIENT_DEVICE = 'Tablet'
      THEN 4 WHEN CLIENT_DEVICE = 'Mobile' THEN 5 ELSE 99 END)::NUMBER
    device.uid: (CLIENT_ID)::VARCHAR
    device.zone: (CLIENT_ZONE)::VARCHAR
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    http_request.uid: (DEBUG_CONTEXT:debugData:requestId)::VARCHAR
    http_request.url.hostname: (IFF(PARSE_URL(DEBUG_CONTEXT:debugData:origin, 1):error
      IS NULL, PARSE_URL(DEBUG_CONTEXT:debugData:origin, 1):host, NULL))::VARCHAR
    http_request.url.path: (SPLIT_PART(DEBUG_CONTEXT:debugData:url, '?', 1))::VARCHAR
    http_request.url.port: (IFF(PARSE_URL(DEBUG_CONTEXT:debugData:origin, 1):error
      IS NULL, PARSE_URL(DEBUG_CONTEXT:debugData:origin, 1):port, NULL))::NUMBER
    http_request.url.query_string: (IFF(SPLIT_PART(DEBUG_CONTEXT:debugData:url, '?',
      -1) = '', NULL, SPLIT_PART(DEBUG_CONTEXT:debugData:url, '?', -1)))::VARCHAR
    http_request.url.scheme: (IFF(PARSE_URL(DEBUG_CONTEXT:debugData:origin, 1):error
      IS NULL, PARSE_URL(DEBUG_CONTEXT:debugData:origin, 1):scheme, NULL))::VARCHAR
    http_request.user_agent: (CLIENT_USER_AGENT_RAW_USER_AGENT)::VARCHAR
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process.uid: (UUID)::VARCHAR
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: (DISPLAY_MESSAGE)::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('okta-logs')::VARCHAR
    metadata.product.vendor_name: ('okta')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (ACTOR_ALTERNATE_ID)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (ACTOR_DISPLAY_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (IFF(PARSE_URL(DEBUG_CONTEXT:debugData:origin, 1):error IS NULL, PARSE_URL(DEBUG_CONTEXT:debugData:origin,
        1):host, NULL))::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP_ADDRESS)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (ACTOR_ALTERNATE_ID)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (ACTOR_DISPLAY_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session.uid: (AUTHENTICATION_CONTEXT:externalSessionId)::VARCHAR
    severity: (CASE ((CASE WHEN SEVERITY IS NULL THEN 0 WHEN SEVERITY = 'INFO' THEN
      1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN
      2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY IS NULL THEN 0 WHEN SEVERITY = 'INFO' THEN 1
      ELSE 99 END)::NUMBER
    src_endpoint.domain: (SECURITY_CONTEXT:domain)::VARCHAR
    src_endpoint.ip: (CLIENT_IP_ADDRESS)::VARCHAR
    src_endpoint.location.city: (CLIENT_GEOGRAPHICAL_CONTEXT_CITY)::VARCHAR
    src_endpoint.location.coordinates: (ARRAY_CONSTRUCT(CLIENT_GEOGRAPHICAL_CONTEXT_GEOLOCATION:lon,CLIENT_GEOGRAPHICAL_CONTEXT_GEOLOCATION:lat))::ARRAY
    src_endpoint.location.country: (CLIENT_GEOGRAPHICAL_CONTEXT_COUNTRY)::VARCHAR
    src_endpoint.location.isp: (SECURITY_CONTEXT:isp)::VARCHAR
    src_endpoint.location.postal_code: (CLIENT_GEOGRAPHICAL_CONTEXT_POSTAL_CODE)::VARCHAR
    src_endpoint.os.type: (CASE (CASE WHEN CLIENT_USER_AGENT_OS ILIKE 'unknown' OR
      CLIENT_USER_AGENT_OS ILIKE 'Unknown%' OR CLIENT_USER_AGENT_OS IS NULL THEN 0
      WHEN CLIENT_USER_AGENT_OS ILIKE 'Windows%' THEN 100 WHEN CLIENT_USER_AGENT_OS
      IN ('Linux', 'Ubuntu') THEN 200 WHEN CLIENT_USER_AGENT_OS ILIKE 'Android%' THEN
      201 WHEN CLIENT_USER_AGENT_OS ILIKE 'Mac%' THEN 300 WHEN CLIENT_USER_AGENT_OS
      ILIKE 'iOS%ipad%' THEN 302 WHEN CLIENT_USER_AGENT_OS ILIKE 'iOS%' THEN 301 ELSE
      99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN
      'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN
      'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN
      401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    src_endpoint.os.type_id: (CASE WHEN CLIENT_USER_AGENT_OS ILIKE 'unknown' OR CLIENT_USER_AGENT_OS
      ILIKE 'Unknown%' OR CLIENT_USER_AGENT_OS IS NULL THEN 0 WHEN CLIENT_USER_AGENT_OS
      ILIKE 'Windows%' THEN 100 WHEN CLIENT_USER_AGENT_OS IN ('Linux', 'Ubuntu') THEN
      200 WHEN CLIENT_USER_AGENT_OS ILIKE 'Android%' THEN 201 WHEN CLIENT_USER_AGENT_OS
      ILIKE 'Mac%' THEN 300 WHEN CLIENT_USER_AGENT_OS ILIKE 'iOS%ipad%' THEN 302 WHEN
      CLIENT_USER_AGENT_OS ILIKE 'iOS%' THEN 301 ELSE 99 END)::NUMBER
    start_time: (date_part('epoch_milliseconds', (to_varchar(PUBLISHED::TIMESTAMP_LTZ,
      'YYYY-MM-DD"T"HH24:MI:SS.FF3"Z"'))::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (to_varchar(PUBLISHED::TIMESTAMP_LTZ, 'YYYY-MM-DD"T"HH24:MI:SS.FF3"Z"'))::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN OUTCOME_RESULT IS NULL THEN 0 WHEN OUTCOME_RESULT =
      'SUCCESS' THEN 1 WHEN OUTCOME_RESULT = 'FAILURE' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (OUTCOME_REASON)::VARCHAR
    status_id: (CASE WHEN OUTCOME_RESULT IS NULL THEN 0 WHEN OUTCOME_RESULT = 'SUCCESS'
      THEN 1 WHEN OUTCOME_RESULT = 'FAILURE' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', published::TIMESTAMP_LTZ))::NUMBER
    time_dt: (published)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN SEVERITY IS NULL THEN 300200 WHEN SEVERITY = ''INFO''
      THEN 300201 ELSE 300299 END)::NUMBER) WHEN 300200 THEN ''Authentication: Unknown''
      WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN SEVERITY IS NULL THEN 300200 WHEN SEVERITY = 'INFO' THEN
      300201 ELSE 300299 END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (ACTOR_ALTERNATE_ID)::VARCHAR
    user.name: (ACTOR_DISPLAY_NAME)::VARCHAR
    user.type: (CASE ((CASE WHEN ACTOR_TYPE IS NULL THEN 0 WHEN ACTOR_TYPE = 'User'
      THEN 1 WHEN ACTOR_TYPE = 'SystemPrincipal' THEN 3 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System'
      WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN ACTOR_TYPE IS NULL THEN 0 WHEN ACTOR_TYPE = 'User' THEN
      1 WHEN ACTOR_TYPE = 'SystemPrincipal' THEN 3 ELSE 99 END)::NUMBER
    user.uid: (ACTOR_ID)::VARCHAR
  predicate: EVENT_TYPE ILIKE '%user.authentication%' OR EVENT_TYPE ILIKE '%user.mfa.okta_verify%'
    OR EVENT_TYPE IN ('user.session.start' , 'system.push.send_factor_verify_push')
