type: mapping
id: okta_logs_2004_detection_finding_1.1.0
version: '1'
name: Okta Logs to OCSF class Detection Finding
data-types:
- okta-logs
mapping:
  fields:
    action: (CASE (CASE WHEN OUTCOME_RESULT='SUCCESS' THEN 1 WHEN OUTCOME_RESULT='DENY'
      THEN 2 WHEN OUTCOME_RESULT IS NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN OUTCOME_RESULT='SUCCESS' THEN 1 WHEN OUTCOME_RESULT='DENY'
      THEN 2 WHEN OUTCOME_RESULT IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN
      2 THEN 'Update' WHEN 3 THEN 'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (ACTOR_ALTERNATE_ID)::VARCHAR
    actor.user.name: (ACTOR_DISPLAY_NAME)::VARCHAR
    actor.user.type: (CASE (CASE WHEN ACTOR_TYPE='User' THEN 1 WHEN ACTOR_TYPE='Admin'
      THEN 2 WHEN ACTOR_TYPE ILIKE '%System%' THEN 3 WHEN ACTOR_TYPE IS NULL THEN
      0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User' WHEN 2 THEN
      'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (CASE WHEN ACTOR_TYPE='User' THEN 1 WHEN ACTOR_TYPE='Admin'
      THEN 2 WHEN ACTOR_TYPE ILIKE '%System%' THEN 3 WHEN ACTOR_TYPE IS NULL THEN
      0 ELSE 99 END)::NUMBER
    actor.user.uid: (ACTOR_ID)::VARCHAR
    api.request.uid: (DEBUG_CONTEXT:debugData:requestId)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (2::NUMBER) WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: (2)::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud.provider: ('Okta')::VARCHAR
    comment: NULL::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: NULL::NUMBER
    confidence_score: NULL::NUMBER
    count: NULL::NUMBER
    device.instance_uid: (TARGET_APP_INSTANCE_ID)::VARCHAR
    device.ip: (CLIENT_IP_ADDRESS)::VARCHAR
    device.location.city: (CLIENT_GEOGRAPHICAL_CONTEXT_CITY)::VARCHAR
    device.location.country: (CLIENT_GEOGRAPHICAL_CONTEXT_COUNTRY)::VARCHAR
    device.location.postal_code: (CLIENT_GEOGRAPHICAL_CONTEXT_POSTAL_CODE)::VARCHAR
    device.os.name: (CLIENT_USER_AGENT_OS)::VARCHAR
    device.os.type: (CASE (CASE WHEN CLIENT_USER_AGENT_OS ILIKE '%Windows%' THEN 100
      WHEN CLIENT_USER_AGENT_OS ILIKE ANY ('%Ubuntu%', '%Linux%') THEN 200 WHEN CLIENT_USER_AGENT_OS
      ILIKE '%Android%' THEN 201 WHEN CLIENT_USER_AGENT_OS ILIKE '%Mac%' THEN 300
      WHEN CLIENT_USER_AGENT_OS ILIKE '%iOS%' THEN 301 WHEN CLIENT_USER_AGENT_OS IS
      NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows'
      WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android'
      WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN
      'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN CLIENT_USER_AGENT_OS ILIKE '%Windows%' THEN 100
      WHEN CLIENT_USER_AGENT_OS ILIKE ANY ('%Ubuntu%', '%Linux%') THEN 200 WHEN CLIENT_USER_AGENT_OS
      ILIKE '%Android%' THEN 201 WHEN CLIENT_USER_AGENT_OS ILIKE '%Mac%' THEN 300
      WHEN CLIENT_USER_AGENT_OS ILIKE '%iOS%' THEN 301 WHEN CLIENT_USER_AGENT_OS IS
      NULL THEN 0 ELSE 99 END)::NUMBER
    device.os.version: (CLIENT_USER_AGENT_OS)::VARCHAR
    device.type: (CASE (CASE WHEN CLIENT_DEVICE='Computer' THEN 2 WHEN CLIENT_DEVICE='Tablet'
      THEN 4 WHEN CLIENT_DEVICE='Mobile' THEN 5 WHEN CLIENT_DEVICE IS NULL THEN 0
      ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN 10 THEN
      'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop' WHEN
      4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN 'IOT'
      WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN CLIENT_DEVICE='Computer' THEN 2 WHEN CLIENT_DEVICE='Tablet'
      THEN 4 WHEN CLIENT_DEVICE='Mobile' THEN 5 WHEN CLIENT_DEVICE IS NULL THEN 0
      ELSE 99 END)::NUMBER
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: NULL::ARRAY
    finding_info.analytic.desc: (DISPLAY_MESSAGE)::VARCHAR
    finding_info.analytic.name: (EVENT_TYPE)::VARCHAR
    finding_info.analytic.type: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Rule' WHEN 2 THEN 'Behavioral' WHEN 3 THEN 'Statistical' WHEN 4 THEN 'Learning
      (ML/DL)' WHEN 99 THEN 'Other' END)::VARCHAR
    finding_info.analytic.type_id: (0)::NUMBER
    finding_info.desc: (DISPLAY_MESSAGE)::VARCHAR
    finding_info.title: (EVENT_TYPE)::VARCHAR
    finding_info.uid: (UUID)::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: (DISPLAY_MESSAGE)::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('okta-logs')::VARCHAR
    metadata.product.vendor_name: ('okta')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (ACTOR_ALTERNATE_ID)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (ACTOR_DISPLAY_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP_ADDRESS)::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: NULL::ARRAY
    risk_level: NULL::VARCHAR
    risk_level_id: NULL::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE (CASE WHEN SEVERITY='INFO' THEN 1 WHEN SEVERITY='DEBUG' THEN 2
      WHEN SEVERITY='WARN' THEN 3 WHEN SEVERITY='ERROR' THEN 4 WHEN SEVERITY IS NULL
      THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY='INFO' THEN 1 WHEN SEVERITY='DEBUG' THEN 2 WHEN
      SEVERITY='WARN' THEN 3 WHEN SEVERITY='ERROR' THEN 4 WHEN SEVERITY IS NULL THEN
      0 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN OUTCOME_RESULT IS NULL THEN 0 ELSE 99 END::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'New' WHEN 2 THEN 'In Progress' WHEN 3 THEN 'Suppressed'
      WHEN 4 THEN 'Resolved' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (OUTCOME_REASON)::VARCHAR
    status_id: (CASE WHEN OUTCOME_RESULT IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', published::TIMESTAMP_LTZ))::NUMBER
    time_dt: (published)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (200400::NUMBER) WHEN 200400 THEN ''Detection Finding: Unknown''
      WHEN 200401 THEN ''Detection Finding: Create'' WHEN 200402 THEN ''Detection
      Finding: Update'' WHEN 200403 THEN ''Detection Finding: Close'' WHEN 200499
      THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: (200400)::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
  predicate: EVENT_TYPE ilike '%security%'
