type: mapping
id: onelogin_events_3001_account_change_1.1.0
version: '9'
name: Onelogin Events to OCSF class Account Change
data-types:
- onelogin-events
mapping:
  fields:
    activity_id: (CASE WHEN EVENT_TYPE_ID IN (13, 291, 533, 1801) THEN 1 WHEN EVENT_TYPE_ID
      IN (16, 32, 54, 83, 552) THEN 2 WHEN EVENT_TYPE_ID IN (211, 510, 511, 1608)
      THEN 3 WHEN EVENT_TYPE_ID=238 THEN 4 WHEN EVENT_TYPE_ID IN (15, 21, 53, 82,
      551) THEN 5 WHEN EVENT_TYPE_ID IN (17, 55, 84, 207, 530, 1802) THEN 6 WHEN EVENT_TYPE_ID
      IN (1, 4, 147, 149, 513, 2110, 2111) THEN 7 WHEN EVENT_TYPE_ID IN (2, 148, 150,
      514, 2112, 2113) THEN 8 WHEN EVENT_TYPE_ID IN (19, 35, 531, 553) THEN 9 WHEN
      EVENT_TYPE_ID IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_TYPE_ID IN (13, 291, 533, 1801) THEN 1
      WHEN EVENT_TYPE_ID IN (16, 32, 54, 83, 552) THEN 2 WHEN EVENT_TYPE_ID IN (211,
      510, 511, 1608) THEN 3 WHEN EVENT_TYPE_ID=238 THEN 4 WHEN EVENT_TYPE_ID IN (15,
      21, 53, 82, 551) THEN 5 WHEN EVENT_TYPE_ID IN (17, 55, 84, 207, 530, 1802) THEN
      6 WHEN EVENT_TYPE_ID IN (1, 4, 147, 149, 513, 2110, 2111) THEN 7 WHEN EVENT_TYPE_ID
      IN (2, 148, 150, 514, 2112, 2113) THEN 8 WHEN EVENT_TYPE_ID IN (19, 35, 531,
      553) THEN 9 WHEN EVENT_TYPE_ID IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Create' WHEN 10 THEN 'MFA Factor Enable' WHEN 11 THEN
      'MFA Factor Disable' WHEN 2 THEN 'Enable' WHEN 3 THEN 'Password Change' WHEN
      4 THEN 'Password Reset' WHEN 5 THEN 'Disable' WHEN 6 THEN 'Delete' WHEN 7 THEN
      'Attach Policy' WHEN 8 THEN 'Detach Policy' WHEN 9 THEN 'Lock' WHEN 99 THEN
      'Other' END)::VARCHAR
    actor.invoked_by: (ACTOR_SYSTEM)::VARCHAR
    actor.user.name: (ACTOR_USER_NAME)::VARCHAR
    actor.user.uid: (ACTOR_USER_ID)::VARCHAR
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('account_change')::VARCHAR
    class_uid: ('3001')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.name: (OTP_DEVICE_NAME)::VARCHAR
    device.uid: (OTP_DEVICE_ID)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.user_agent: (USER_AGENT)::VARCHAR
    message: (CUSTOM_MESSAGE)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('onelogin-events')::VARCHAR
    metadata.product.vendor_name: ('OneLogin')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (ACTOR_USER_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IPADDR)::VARCHAR
    - name: '''src_endpoint.proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PROXY_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER_NAME)::VARCHAR
    policy.name: (COALESCE(POLICY_NAME, ROLE_NAME))::VARCHAR
    policy.uid: (COALESCE(POLICY_ID, ROLE_ID))::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (IPADDR)::VARCHAR
    src_endpoint.proxy_endpoint.ip: (PROXY_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (ERROR_DESCRIPTION)::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN EVENT_TYPE_ID IN (13, 291, 533, 1801) THEN 300101
      WHEN EVENT_TYPE_ID IN (16, 32, 54, 83, 552) THEN 300102 WHEN EVENT_TYPE_ID IN
      (211, 510, 511, 1608) THEN 300103 WHEN EVENT_TYPE_ID=238 THEN 300104 WHEN EVENT_TYPE_ID
      IN (15, 21, 53, 82, 551) THEN 300105 WHEN EVENT_TYPE_ID IN (17, 55, 84, 207,
      530, 1802) THEN 300106 WHEN EVENT_TYPE_ID IN (1, 4, 147, 149, 513, 2110, 2111)
      THEN 300107 WHEN EVENT_TYPE_ID IN (2, 148, 150, 514, 2112, 2113) THEN 300108
      WHEN EVENT_TYPE_ID IN (19, 35, 531, 553) THEN 300109 WHEN EVENT_TYPE_ID IS NULL
      THEN 300100 ELSE 300199 END)::NUMBER) WHEN 300100 THEN ''Account Change: Unknown''
      WHEN 300101 THEN ''Account Change: Create'' WHEN 300102 THEN ''Account Change:
      Enable'' WHEN 300103 THEN ''Account Change: Password Change'' WHEN 300104 THEN
      ''Account Change: Password Reset'' WHEN 300105 THEN ''Account Change: Disable''
      WHEN 300106 THEN ''Account Change: Delete'' WHEN 300107 THEN ''Account Change:
      Attach Policy'' WHEN 300108 THEN ''Account Change: Detach Policy'' WHEN 300109
      THEN ''Account Change: Lock'' WHEN 300110 THEN ''Account Change: MFA Factor
      Enable'' WHEN 300111 THEN ''Account Change: MFA Factor Disable'' WHEN 300199
      THEN ''Account Change: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN EVENT_TYPE_ID IN (13, 291, 533, 1801) THEN 300101 WHEN EVENT_TYPE_ID
      IN (16, 32, 54, 83, 552) THEN 300102 WHEN EVENT_TYPE_ID IN (211, 510, 511, 1608)
      THEN 300103 WHEN EVENT_TYPE_ID=238 THEN 300104 WHEN EVENT_TYPE_ID IN (15, 21,
      53, 82, 551) THEN 300105 WHEN EVENT_TYPE_ID IN (17, 55, 84, 207, 530, 1802)
      THEN 300106 WHEN EVENT_TYPE_ID IN (1, 4, 147, 149, 513, 2110, 2111) THEN 300107
      WHEN EVENT_TYPE_ID IN (2, 148, 150, 514, 2112, 2113) THEN 300108 WHEN EVENT_TYPE_ID
      IN (19, 35, 531, 553) THEN 300109 WHEN EVENT_TYPE_ID IS NULL THEN 300100 ELSE
      300199 END)::NUMBER
    unmapped: NULL::VARIANT
    user.account.uid: (ACCOUNT_ID)::VARCHAR
    user.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('uid', GROUP_ID, 'name', GROUP_NAME)))::ARRAY
    user.name: (USER_NAME)::VARCHAR
    user.uid: (USER_ID)::VARCHAR
    user_result: NULL::VARIANT
  predicate: EVENT_TYPE_ID IN (1, 4, 147, 149, 513, 2110, 2111, 2, 148, 150, 514,
    2112, 2113, 13, 291, 533, 1801, 17, 55, 84, 207, 530, 1802, 16, 32, 54, 83, 552,
    15, 21, 53, 82, 551, 19, 35, 531, 553, 211, 510, 511, 1608, 238)
