type: mapping
id: onepassword_audit_events_3005_user_access_1.1.0
version: '8'
name: Onepassword Audit Events to OCSF class User Access
data-types:
- onepassword-audit-events
mapping:
  fields:
    activity_id: (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION IN ('grant', 'update',
      'role', 'upguest') THEN 1 WHEN ACTION = 'revoke' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION IN ('grant',
      'update', 'role', 'upguest') THEN 1 WHEN ACTION = 'revoke' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Assign Privileges' WHEN 2 THEN 'Revoke Privileges'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.session.created_time: (date_part('epoch_milliseconds', (SESSION_LOGIN_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.session.created_time_dt: (SESSION_LOGIN_TIME)::TIMESTAMP_LTZ
    actor.session.uid: (SESSION_UUID)::VARCHAR
    actor.user.uid: (ACTOR_UUID)::VARCHAR
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('user_access')::VARCHAR
    class_uid: ('3005')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.ip: (SESSION_IP)::VARCHAR
    device.location.city: (CITY)::VARCHAR
    device.uid: (SESSION_DEVICE_UUID)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (action)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('onepassword-audit-events')::VARCHAR
    metadata.product.vendor_name: ('1Password')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SESSION_IP)::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    privileges: (ARRAY_CONSTRUCT(ACTION))::ARRAY
    raw_data: NULL::VARCHAR
    resource: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300500 + (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION IN (''grant'',
      ''update'', ''role'', ''upguest'') THEN 1 WHEN ACTION = ''revoke'' THEN 2 ELSE
      99 END))::NUMBER) WHEN 300500 THEN ''User Access Management: Unknown'' WHEN
      300501 THEN ''User Access Management: Assign Privileges'' WHEN 300502 THEN ''User
      Access Management: Revoke Privileges'' WHEN 300599 THEN ''User Access Management:
      Other'' END)::VARCHAR'
    type_uid: (300500 + (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION IN ('grant',
      'update', 'role', 'upguest') THEN 1 WHEN ACTION = 'revoke' THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.uid: (AUX_UUID)::VARCHAR
  predicate: OBJECT_TYPE IN ('gm', 'user', 'uva', 'vault') AND ACTION IN ('role',
    'upguest', 'grant', 'revoke', 'update')
