type: mapping
id: onepassword_sign_in_logs_3002_authentication_1.1.0
version: '10'
name: Onepassword Sign In Logs to OCSF class Authentication
data-types:
- onepassword-sign-in-logs
mapping:
  fields:
    activity_id: (1)::NUMBER
    activity_name: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN
      2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket' WHEN 4 THEN 'Service Ticket
      Request' WHEN 5 THEN 'Service Ticket Renew' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: NULL::VARCHAR
    auth_protocol_id: NULL::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.ip: (CLIENT_IP_ADDRESS)::VARCHAR
    device.location.city: (LOCATION_CITY)::VARCHAR
    device.location.coordinates: (ARRAY_CONSTRUCT(LOCATION_LONGITUDE, LOCATION_LATITUDE))::ARRAY
    device.location.country: (LOCATION_COUNTRY)::VARCHAR
    device.location.region: (LOCATION_REGION)::VARCHAR
    device.os.name: (CLIENT_OS_NAME)::VARCHAR
    device.os.type: (CASE ((CASE WHEN CLIENT_OS_NAME IS NULL THEN 0 WHEN CLIENT_OS_NAME
      = 'Windows' THEN 100 WHEN CLIENT_OS_NAME = 'Linux' THEN 200 WHEN CLIENT_OS_NAME
      = 'Android' THEN 201 WHEN CLIENT_OS_NAME = 'MacOSX' THEN 300 WHEN CLIENT_OS_NAME
      = 'iOS' THEN 301 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows'
      WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android'
      WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN
      'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN CLIENT_OS_NAME IS NULL THEN 0 WHEN CLIENT_OS_NAME
      = 'Windows' THEN 100 WHEN CLIENT_OS_NAME = 'Linux' THEN 200 WHEN CLIENT_OS_NAME
      = 'Android' THEN 201 WHEN CLIENT_OS_NAME = 'MacOSX' THEN 300 WHEN CLIENT_OS_NAME
      = 'iOS' THEN 301 ELSE 99 END)::NUMBER
    device.os.version: (CLIENT_OS_VERSION)::VARCHAR
    device.type: (CASE ((CASE WHEN CLIENT_APP_NAME ILIKE '%browser%' THEN 8 WHEN CLIENT_APP_NAME
      ILIKE '%ios%' OR CLIENT_APP_NAME ILIKE '%android%' THEN 5 WHEN CLIENT_APP_NAME
      ILIKE '%windows%' OR CLIENT_APP_NAME ILIKE '%linux%' OR CLIENT_APP_NAME ILIKE
      '%mac%' THEN 3 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server'
      WHEN 10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN CLIENT_APP_NAME ILIKE '%browser%' THEN 8 WHEN CLIENT_APP_NAME
      ILIKE '%ios%' OR CLIENT_APP_NAME ILIKE '%android%' THEN 5 WHEN CLIENT_APP_NAME
      ILIKE '%windows%' OR CLIENT_APP_NAME ILIKE '%linux%' OR CLIENT_APP_NAME ILIKE
      '%mac%' THEN 3 ELSE 99 END)::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process.uid: (UUID)::VARCHAR
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('onepassword-sign-in-logs')::VARCHAR
    metadata.product.vendor_name: ('1Password')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP_ADDRESS)::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (TARGET_USER_EMAIL)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (TARGET_USER_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    service.name: (CLIENT_APP_NAME)::VARCHAR
    service.version: (CLIENT_APP_VERSION)::VARCHAR
    session.uid: (SESSION_UUID)::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint: NULL::VARIANT
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN CATEGORY IS NULL THEN 0 WHEN CATEGORY ILIKE '%success%'
      THEN 1 WHEN CATEGORY ILIKE '%failed%' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (TYPE)::VARCHAR
    status_id: (CASE WHEN CATEGORY IS NULL THEN 0 WHEN CATEGORY ILIKE '%success%'
      THEN 1 WHEN CATEGORY ILIKE '%failed%' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300201)::NUMBER) WHEN 300200 THEN ''Authentication: Unknown''
      WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (300201)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (TARGET_USER_EMAIL)::VARCHAR
    user.name: (TARGET_USER_NAME)::VARCHAR
    user.uid: (TARGET_USER_UUID)::VARCHAR
