type: mapping
id: onepassword_item_usages_logs_6003_api_activity_1.1.0
version: '10'
name: Onepassword Item Usages Logs to OCSF class Api Activity
data-types:
- onepassword-item-usages-logs
mapping:
  fields:
    activity_id: (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%create%' THEN
      1 WHEN ACTION ILIKE '%update%' THEN 3 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%create%'
      THEN 1 WHEN ACTION ILIKE '%update%' THEN 3 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN
      4 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (USER_EMAIL)::VARCHAR
    actor.user.full_name: (USER_NAME)::VARCHAR
    actor.user.uid: (USER_UUID)::VARCHAR
    api.operation: (ACTION)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('onepassword-item-usages-logs')::VARCHAR
    metadata.product.vendor_name: ('1Password')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER_EMAIL)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP_ADDRESS)::VARCHAR
    raw_data: NULL::VARCHAR
    resources: NULL::ARRAY
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (CLIENT_IP_ADDRESS)::VARCHAR
    src_endpoint.location.city: (LOCATION_CITY)::VARCHAR
    src_endpoint.location.coordinates: (ARRAY_CONSTRUCT(LOCATION_LONGITUDE::FLOAT,
      LOCATION_LATITUDE::FLOAT))::ARRAY
    src_endpoint.name: (CLIENT_PLATFORM_NAME)::VARCHAR
    src_endpoint.os.name: (CLIENT_OS_NAME)::VARCHAR
    src_endpoint.os.type: (CASE ((CASE WHEN CLIENT_OS_NAME IS NULL THEN 0 WHEN CLIENT_OS_NAME
      = 'Windows' THEN 100 WHEN CLIENT_OS_NAME = 'Linux' THEN 200 WHEN CLIENT_OS_NAME
      = 'Android' THEN 201 WHEN CLIENT_OS_NAME = 'MacOSX' THEN 300 WHEN CLIENT_OS_NAME
      = 'iOS' THEN 301 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows'
      WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android'
      WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN
      'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    src_endpoint.os.type_id: (CASE WHEN CLIENT_OS_NAME IS NULL THEN 0 WHEN CLIENT_OS_NAME
      = 'Windows' THEN 100 WHEN CLIENT_OS_NAME = 'Linux' THEN 200 WHEN CLIENT_OS_NAME
      = 'Android' THEN 201 WHEN CLIENT_OS_NAME = 'MacOSX' THEN 300 WHEN CLIENT_OS_NAME
      = 'iOS' THEN 301 ELSE 99 END)::NUMBER
    src_endpoint.os.version: (CONCAT(CLIENT_OS_NAME, ' ', CLIENT_OS_VERSION))::VARCHAR
    src_endpoint.svc_name: (CLIENT_APP_NAME)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((600300 + (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE
      ''%create%'' THEN 1 WHEN ACTION ILIKE ''%update%'' THEN 3 ELSE 99 END))::NUMBER)
      WHEN 600300 THEN ''API Activity: Unknown'' WHEN 600301 THEN ''API Activity:
      Create'' WHEN 600302 THEN ''API Activity: Read'' WHEN 600303 THEN ''API Activity:
      Update'' WHEN 600304 THEN ''API Activity: Delete'' WHEN 600399 THEN ''API Activity:
      Other'' END)::VARCHAR'
    type_uid: (600300 + (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE '%create%'
      THEN 1 WHEN ACTION ILIKE '%update%' THEN 3 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
