type: mapping
id: oracle_service_logs_4001_network_activity_1.1.0
version: '14'
name: Oracle Service Logs to OCSF class Network Activity
data-types:
- oracle-service-logs
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION = 'ACCEPT' THEN 1 WHEN ACTION = 'allow' THEN
      1 WHEN ACTION = 'REJECT' THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN
      'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION = 'ACCEPT' THEN 1 WHEN ACTION = 'allow' THEN 1 WHEN
      ACTION = 'REJECT' THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN
      2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.provider: ('Oracle')::VARCHAR
    connection_info.protocol_name: (LOWER(COALESCE(PROTOCOL_NAME, RAW:data:proto)))::VARCHAR
    connection_info.protocol_num: (PROTOCOL)::NUMBER
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (COALESCE(DESTINATION_ADDRESS, RAW:data:dst))::VARCHAR
    dst_endpoint.port: (COALESCE(DESTINATION_PORT, RAW:data:dport))::NUMBER
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (END_TIME)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (END_TIME)::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    firewall_rule.name: (RAW:data:rule)::VARCHAR
    firewall_rule.uid: (RAW:data:rule_uuid)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (EVENT_TYPE)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('oracle-service-logs')::VARCHAR
    metadata.product.vendor_name: ('oracle')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(DESTINATION_ADDRESS, RAW:data:dst))::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(SOURCE_ADDRESS, RAW:data:src))::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((CASE WHEN RAW:data:severity IS NULL THEN 0 WHEN RAW:data:severity
      = 'medium' THEN 3 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN RAW:data:severity IS NULL THEN 0 WHEN RAW:data:severity
      = 'medium' THEN 3 ELSE 99 END)::NUMBER
    src_endpoint.ip: (COALESCE(SOURCE_ADDRESS, RAW:data:src))::VARCHAR
    src_endpoint.port: (COALESCE(SOURCE_PORT, RAW:data:sport))::NUMBER
    start_time: (date_part('epoch_milliseconds', (START_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (START_TIME)::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS = 'OK' THEN 1 WHEN
      STATUS = 'SKIPDATA' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS = 'OK' THEN 1 WHEN STATUS
      = 'SKIPDATA' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes_out: (BYTES_OUT)::NUMBER
    traffic.packets: (PACKETS)::NUMBER
    type_name: '(CASE ((400100)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown''
      WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400100)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
  predicate: contains(EVENT_TYPE ,'com.oraclecloud.networkfirewall') OR contains(EVENT_TYPE
    ,'com.oraclecloud.vcn.flowlogs')
