type: mapping
id: osquery_logs_1007_process_activity_1.1.0
version: '14'
name: Osquery Logs to OCSF class Process Activity
data-types:
- osquery-logs
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN EVENT_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Launch' WHEN 2 THEN 'Terminate' WHEN 3 THEN
      'Open' WHEN 4 THEN 'Inject' WHEN 5 THEN 'Set User ID' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (COALESCE(COMMAND_LINE, COLUMNS:cmdline))::VARCHAR
    actor.process.file.name: (COLUMNS:name)::VARCHAR
    actor.process.file.path: (COALESCE(COLUMNS:path, COLUMNS:child_path))::VARCHAR
    actor.process.name: (COLUMNS:child_process)::VARCHAR
    actor.process.parent_process.file.path: (COLUMNS:parent_path)::VARCHAR
    actor.process.parent_process.name: (COLUMNS:parent_process)::VARCHAR
    actor.process.parent_process.pid: (COLUMNS:parent_pid)::NUMBER
    actor.process.pid: (COALESCE(COLUMNS:pid, COLUMNS:child_pid))::NUMBER
    actor.process.uid: (COLUMNS:uid)::VARCHAR
    actor.process.user.name: (COALESCE(USER, COLUMNS:username))::VARCHAR
    actual_permissions: NULL::NUMBER
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('process_activity')::VARCHAR
    class_uid: ('1007')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    exit_code: NULL::NUMBER
    firewall_rule: NULL::VARIANT
    injection_type: NULL::VARCHAR
    injection_type_id: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('osquery-logs')::VARCHAR
    metadata.product.vendor_name: ('osquery')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    module: NULL::VARIANT
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (COLUMNS:name)::VARCHAR
    - name: '''actor.process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (COLUMNS:child_process)::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (COLUMNS:parent_process)::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(USER, COLUMNS:username))::VARCHAR
    process: NULL::VARIANT
    raw_data: NULL::VARCHAR
    requested_permissions: NULL::NUMBER
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN EVENT_TYPE IS NULL THEN 100700 ELSE 100799 END)::NUMBER)
      WHEN 100700 THEN ''Process Activity: Unknown'' WHEN 100701 THEN ''Process Activity:
      Launch'' WHEN 100702 THEN ''Process Activity: Terminate'' WHEN 100703 THEN ''Process
      Activity: Open'' WHEN 100704 THEN ''Process Activity: Inject'' WHEN 100705 THEN
      ''Process Activity: Set User ID'' WHEN 100799 THEN ''Process Activity: Other''
      END)::VARCHAR'
    type_uid: (CASE WHEN EVENT_TYPE IS NULL THEN 100700 ELSE 100799 END)::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_TYPE ILIKE ANY ('%process%', '%Process%')
