type: mapping
id: osquery_logs_1005_module_activity_1.1.0
version: '2'
name: Osquery Logs to OCSF class Module Activity
data-types:
- osquery-logs
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE ACTION WHEN 'added' THEN 1 WHEN NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE ACTION WHEN 'added' THEN 1 WHEN NULL THEN 0 ELSE 99
      END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Load' WHEN 2 THEN 'Unload'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('module_activity')::VARCHAR
    class_uid: ('1005')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (HOST_IDENTIFIER)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (EVENT_TYPE)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('osquery-logs')::VARCHAR
    metadata.product.vendor_name: ('osquery')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    module.file.name: (COLUMNS:name)::VARCHAR
    module.file.size: (COLUMNS:size)::NUMBER
    module.start_address: (COLUMNS:address)::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOST_IDENTIFIER)::VARCHAR
    - name: '''module.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''module.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (COLUMNS:name)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (COLUMNS:status)::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100500 + (CASE ACTION WHEN ''added'' THEN 1 WHEN NULL THEN
      0 ELSE 99 END))::NUMBER) WHEN 100500 THEN ''Module Activity: Unknown'' WHEN
      100501 THEN ''Module Activity: Load'' WHEN 100502 THEN ''Module Activity: Unload''
      WHEN 100599 THEN ''Module Activity: Other'' END)::VARCHAR'
    type_uid: (100500 + (CASE ACTION WHEN 'added' THEN 1 WHEN NULL THEN 0 ELSE 99
      END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_TYPE='pack_incident_response_kernel_modules'
