type: mapping
id: pan_firewall_traffic_decoded_strata_by_snappy_4001_network_activity_1.1.0
version: '1'
name: Pan Firewall Traffic Decoded Strata By Snappy to OCSF class Network Activity
data-types:
- pan-firewall-traffic-decoded-strata-by-snappy
mapping:
  fields:
    action: (CASE (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION='allow' THEN 1 WHEN
      ACTION='deny' THEN 2 WHEN ACTION='drop' THEN 2 ELSE 99 END::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION='allow' THEN 1 WHEN ACTION='deny'
      THEN 2 WHEN ACTION='drop' THEN 2 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN TYPE IS NULL THEN 0 WHEN TYPE='TRAFFIC' THEN 6 ELSE 99
      END)::NUMBER
    activity_name: (CASE (CASE WHEN TYPE IS NULL THEN 0 WHEN TYPE='TRAFFIC' THEN 6
      ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2 THEN 'Close'
      WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN 6 THEN 'Traffic'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.name: (SOURCE_USER)::VARCHAR
    api: NULL::VARIANT
    app_name: (APPLICATION)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.protocol_name: (PROTOCOL)::VARCHAR
    connection_info.protocol_num: (CASE WHEN PROTOCOL = 'tcp' THEN 6 WHEN PROTOCOL
      = 'udp' THEN 17 WHEN PROTOCOL = 'icmp' THEN 1 END)::NUMBER
    connection_info.session.expiration_reason: (SESSION_END_REASON)::VARCHAR
    connection_info.session.uid: (SESSION_ID)::VARCHAR
    count: NULL::NUMBER
    device.name: (DEVICE_NAME)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.intermediate_ips: (ARRAY_CONSTRUCT(NAT_DESTINATION_IP::VARCHAR))::ARRAY
    dst_endpoint.ip: (DESTINATION_ADDRESS)::VARCHAR
    dst_endpoint.location.desc: (DESTINATION_LOCATION)::VARCHAR
    dst_endpoint.port: (DESTINATION_PORT)::NUMBER
    dst_endpoint.zone: (DESTINATION_ZONE)::VARCHAR
    duration: (ELAPSED_TIME)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.category: (CATEGORY)::VARCHAR
    firewall_rule.name: (RULE_NAME)::VARCHAR
    firewall_rule.uid: (RULE_UUID)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (NULL)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('pan-firewall-traffic-decoded-strata-by-snappy')::VARCHAR
    metadata.product.vendor_name: ('paloalto')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (SOURCE_USER)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.intermediate_ips'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (ARRAY_CONSTRUCT(NAT_DESTINATION_IP::VARCHAR))::ARRAY
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_ADDRESS)::VARCHAR
    - name: '''src_endpoint.intermediate_ips'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (ARRAY_CONSTRUCT(NAT_SOURCE_IP::VARCHAR))::ARRAY
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_ADDRESS)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.intermediate_ips: (ARRAY_CONSTRUCT(NAT_SOURCE_IP::VARCHAR))::ARRAY
    src_endpoint.ip: (SOURCE_ADDRESS)::VARCHAR
    src_endpoint.location.desc: (SOURCE_LOCATION)::VARCHAR
    src_endpoint.port: (SOURCE_PORT)::NUMBER
    start_time: (date_part('epoch_milliseconds', START_TIME::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (START_TIME)::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', generated_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (generated_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes: (BYTES)::NUMBER
    traffic.bytes_in: (BYTES_RECEIVED)::NUMBER
    traffic.bytes_out: (BYTES_SENT)::NUMBER
    traffic.chunks: (SCTP_CHUNKS)::NUMBER
    traffic.chunks_in: (SCTP_CHUNKS_RECEIVED)::NUMBER
    traffic.chunks_out: (SCTP_CHUNKS_SENT)::NUMBER
    traffic.packets: (PACKETS)::NUMBER
    type_name: '(CASE (400100 + (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION=''allow''
      THEN 1 WHEN ACTION=''deny'' THEN 2 WHEN ACTION=''drop'' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 400100 THEN ''Network Activity: Unknown'' WHEN 400101 THEN ''Network Activity:
      Open'' WHEN 400102 THEN ''Network Activity: Close'' WHEN 400103 THEN ''Network
      Activity: Reset'' WHEN 400104 THEN ''Network Activity: Fail'' WHEN 400105 THEN
      ''Network Activity: Refuse'' WHEN 400106 THEN ''Network Activity: Traffic''
      WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400100 + (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION='allow' THEN
      1 WHEN ACTION='deny' THEN 2 WHEN ACTION='drop' THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
