type: mapping
id: pan_edr_raw_logs_1005_module_activity_1.1.0
version: '2'
name: Pan Edr Raw Logs to OCSF class Module Activity
data-types:
- pan-edr-raw-logs
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN EVENT_SUB_TYPE IS NULL THEN 0 WHEN EVENT_SUB_TYPE = 1
      THEN 1 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_SUB_TYPE IS NULL THEN 0 WHEN EVENT_SUB_TYPE
      = 1 THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Load' WHEN
      2 THEN 'Unload' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (OS_ACTOR_PROCESS_COMMAND_LINE)::VARCHAR
    actor.process.file.hashes: (ARRAY_CONSTRUCT( OBJECT_CONSTRUCT_KEEP_NULL('algorithm_id',
      CASE WHEN OS_ACTOR_PROCESS_IMAGE_SHA256 IS NOT NULL THEN 3 WHEN OS_ACTOR_PROCESS_IMAGE_MD5
      IS NOT NULL THEN 1 END::NUMBER, 'algorithm', CASE WHEN OS_ACTOR_PROCESS_IMAGE_SHA256
      IS NOT NULL THEN 'SHA-256' WHEN OS_ACTOR_PROCESS_IMAGE_MD5 IS NOT NULL THEN
      'MD5' END::VARCHAR, 'value', COALESCE(OS_ACTOR_PROCESS_IMAGE_SHA256, OS_ACTOR_PROCESS_IMAGE_MD5)::VARCHAR)))::ARRAY
    actor.process.file.name: (OS_ACTOR_PROCESS_IMAGE_NAME)::VARCHAR
    actor.process.file.path: (OS_ACTOR_PROCESS_IMAGE_PATH)::VARCHAR
    actor.process.pid: (OS_ACTOR_PROCESS_OS_PID)::NUMBER
    actor.process.tid: (OS_ACTOR_THREAD_THREAD_ID)::NUMBER
    actor.process.user.name: (OS_ACTOR_PRIMARY_USERNAME)::VARCHAR
    actor.process.user.uid: (OS_ACTOR_PRIMARY_USER_SID)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('module_activity')::VARCHAR
    class_uid: ('1005')::NUMBER
    cloud.provider: ('paloalto')::VARCHAR
    count: NULL::NUMBER
    device.hostname: (AGENT_HOSTNAME)::VARCHAR
    device.ip: (COALESCE(AGENT_IP_ADDRESSES[0], AGENT_IP_ADDRESSES_V6[0]))::VARCHAR
    device.mac: (AGENT_INTERFACE_MAP_MAC[0])::VARCHAR
    device.os.type: (CASE ((CASE WHEN AGENT_OS_TYPE IS NULL THEN 0 WHEN AGENT_OS_TYPE
      = 1 THEN 100 WHEN AGENT_OS_TYPE = 2 THEN 300 WHEN AGENT_OS_TYPE = 4 THEN 200
      ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101
      THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300
      THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris'
      WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN AGENT_OS_TYPE IS NULL THEN 0 WHEN AGENT_OS_TYPE
      = 1 THEN 100 WHEN AGENT_OS_TYPE = 2 THEN 300 WHEN AGENT_OS_TYPE = 4 THEN 200
      ELSE 99 END)::NUMBER
    device.os.version: (AGENT_OS_SUB_TYPE)::VARCHAR
    device.type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN
      10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (0)::NUMBER
    device.uid: (AGENT_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('pan-edr-raw-logs')::VARCHAR
    metadata.product.vendor_name: ('paloalto')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    module.base_address: (RAW:action_module_base_address)::VARCHAR
    module.file.company_name: (PARSE_JSON(RAW:action_module_file_info):company)::VARCHAR
    module.file.desc: (PARSE_JSON(RAW:action_module_file_info):description)::VARCHAR
    module.file.hashes: (ARRAY_CONSTRUCT( OBJECT_CONSTRUCT_KEEP_NULL('algorithm_id',
      CASE WHEN RAW:action_module_sha256 IS NOT NULL THEN 3 WHEN RAW:action_module_md5
      IS NOT NULL THEN 1 END::NUMBER, 'algorithm', CASE WHEN RAW:action_module_sha256
      IS NOT NULL THEN 'SHA-256' WHEN RAW:action_module_md5 IS NOT NULL THEN 'MD5'
      END::VARCHAR, 'value', COALESCE(RAW:action_module_sha256, RAW:action_module_md5)::VARCHAR)))::ARRAY
    module.file.name: (PARSE_JSON(RAW:action_module_file_info):original_name)::VARCHAR
    module.file.path: (RAW:action_module_path)::VARCHAR
    module.file.product.name: (PARSE_JSON(RAW:action_module_file_info):product_name)::VARCHAR
    module.file.product.version: (PARSE_JSON(RAW:action_module_file_info):product_version)::VARCHAR
    module.file.version: (PARSE_JSON(RAW:action_module_file_info):file_version)::VARCHAR
    module.load_type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Standard'
      WHEN 2 THEN 'Non Standard' WHEN 3 THEN 'ShellCode' WHEN 4 THEN 'Mapped' WHEN
      5 THEN 'NonStandard Backed' WHEN 99 THEN 'Other' END)::VARCHAR
    module.load_type_id: (0)::NUMBER
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (OS_ACTOR_PROCESS_IMAGE_NAME)::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (OS_ACTOR_PRIMARY_USERNAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (AGENT_HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(AGENT_IP_ADDRESSES[0], AGENT_IP_ADDRESSES_V6[0]))::VARCHAR
    - name: '''device.mac'''
      type: '''MAC Address'''
      type_id: 3
      reputation: null::VARIANT
      value: (AGENT_INTERFACE_MAP_MAC[0])::VARCHAR
    - name: '''module.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''module.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (PARSE_JSON(RAW:action_module_file_info):original_name)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100500 + (CASE WHEN EVENT_SUB_TYPE IS NULL THEN 0 WHEN EVENT_SUB_TYPE
      = 1 THEN 1 ELSE 99 END))::NUMBER) WHEN 100500 THEN ''Module Activity: Unknown''
      WHEN 100501 THEN ''Module Activity: Load'' WHEN 100502 THEN ''Module Activity:
      Unload'' WHEN 100599 THEN ''Module Activity: Other'' END)::VARCHAR'
    type_uid: (100500 + (CASE WHEN EVENT_SUB_TYPE IS NULL THEN 0 WHEN EVENT_SUB_TYPE
      = 1 THEN 1 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_TYPE = 6
