type: mapping
id: pan_edr_raw_logs_1001_file_activity_1.1.0
version: '16'
name: Pan Edr Raw Logs to OCSF class File Activity
data-types:
- pan-edr-raw-logs
mapping:
  fields:
    access_mask: NULL::NUMBER
    action: (CASE ((0:NUMBER)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed'
      WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0:NUMBER)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create'
      WHEN 10 THEN 'Encrypt' WHEN 11 THEN 'Decrypt' WHEN 12 THEN 'Mount' WHEN 13 THEN
      'Unmount' WHEN 14 THEN 'Open' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4
      THEN 'Delete' WHEN 5 THEN 'Rename' WHEN 6 THEN 'Set Attributes' WHEN 7 THEN
      'Set Security' WHEN 8 THEN 'Get Attributes' WHEN 9 THEN 'Get Security' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (OS_ACTOR_PROCESS_COMMAND_LINE)::VARCHAR
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      CASE (case when OS_ACTOR_PROCESS_IMAGE_SHA256 is null and OS_ACTOR_PROCESS_IMAGE_MD5
      is null then 1 when OS_ACTOR_PROCESS_IMAGE_SHA256 is not null then 3 when OS_ACTOR_PROCESS_IMAGE_MD5
      is not null then 1 else 0 end::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'MD5'
      WHEN 2 THEN 'SHA-1' WHEN 3 THEN 'SHA-256' WHEN 4 THEN 'SHA-512' WHEN 5 THEN
      'CTPH' WHEN 6 THEN 'TLSH' WHEN 7 THEN 'quickXorHash' WHEN 99 THEN 'Other' END,
      'algorithm_id', case when OS_ACTOR_PROCESS_IMAGE_SHA256 is null and OS_ACTOR_PROCESS_IMAGE_MD5
      is null then 1 when OS_ACTOR_PROCESS_IMAGE_SHA256 is not null then 3 when OS_ACTOR_PROCESS_IMAGE_MD5
      is not null then 1 else 0 end::NUMBER, 'value', COALESCE(OS_ACTOR_PROCESS_IMAGE_SHA256,
      OS_ACTOR_PROCESS_IMAGE_MD5)::VARCHAR)))::ARRAY
    actor.process.file.name: (OS_ACTOR_PROCESS_IMAGE_NAME)::VARCHAR
    actor.process.file.path: (OS_ACTOR_PROCESS_IMAGE_PATH)::VARCHAR
    actor.process.pid: (OS_ACTOR_PROCESS_OS_PID)::NUMBER
    actor.process.tid: (OS_ACTOR_THREAD_THREAD_ID)::NUMBER
    actor.process.user.name: (OS_ACTOR_PRIMARY_USERNAME)::VARCHAR
    actor.process.user.uid: (OS_ACTOR_PRIMARY_USER_SID)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: NULL::VARCHAR
    category_uid: NULL::NUMBER
    class_name: ('file_activity')::VARCHAR
    class_uid: ('1001')::NUMBER
    cloud: NULL::VARIANT
    component: NULL::VARCHAR
    connection_uid: NULL::VARCHAR
    count: NULL::NUMBER
    create_mask: NULL::VARCHAR
    device.hostname: (AGENT_HOSTNAME)::VARCHAR
    device.ip: (COALESCE(AGENT_IP_ADDRESSES[0], AGENT_IP_ADDRESSES_V6[0]))::VARCHAR
    device.mac: (AGENT_INTERFACE_MAP_MAC[0])::VARCHAR
    device.os.type: (CASE ((case when AGENT_OS_TYPE = 1 then 100 when AGENT_OS_TYPE
      = 2 then 300 when AGENT_OS_TYPE = 4 then 200 else 0 end)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN
      'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN
      302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN
      'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (case when AGENT_OS_TYPE = 1 then 100 when AGENT_OS_TYPE =
      2 then 300 when AGENT_OS_TYPE = 4 then 200 else 0 end)::NUMBER
    device.os.version: (AGENT_OS_SUB_TYPE)::VARCHAR
    device.subnet: (COALESCE(raw:agent_interface_map[0]:ipv4_subnet_mask, raw:agent_interface_map[0]:ipv6_subnet_mask))::VARCHAR
    device.uid: (AGENT_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    file.accessed_time: (date_part('epoch_milliseconds', (ACTION_FILE_ACCESS_TIME)::TIMESTAMP_LTZ))::NUMBER
    file.accessed_time_dt: (ACTION_FILE_ACCESS_TIME)::TIMESTAMP_LTZ
    file.created_time: (date_part('epoch_milliseconds', (ACTION_FILE_CREATE_TIME)::TIMESTAMP_LTZ))::NUMBER
    file.created_time_dt: (ACTION_FILE_CREATE_TIME)::TIMESTAMP_LTZ
    file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm', CASE (case
      when ACTION_FILE_SHA256 is null and ACTION_FILE_MD5 is null then 1 when ACTION_FILE_SHA256
      is not null then 3 when ACTION_FILE_MD5 is not null then 1 else 0 end::NUMBER
      ::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'MD5' WHEN 2 THEN 'SHA-1' WHEN 3
      THEN 'SHA-256' WHEN 4 THEN 'SHA-512' WHEN 5 THEN 'CTPH' WHEN 6 THEN 'TLSH' WHEN
      7 THEN 'quickXorHash' WHEN 99 THEN 'Other' END, 'algorithm_id', case when ACTION_FILE_SHA256
      is null and ACTION_FILE_MD5 is null then 1 when ACTION_FILE_SHA256 is not null
      then 3 when ACTION_FILE_MD5 is not null then 1 else 0 end::NUMBER ::NUMBER)))::ARRAY
    file.modified_time: (date_part('epoch_milliseconds', (ACTION_FILE_MOD_TIME)::TIMESTAMP_LTZ))::NUMBER
    file.modified_time_dt: (ACTION_FILE_MOD_TIME)::TIMESTAMP_LTZ
    file.name: (ACTION_FILE_NAME)::VARCHAR
    file.owner.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', ACTION_FILE_GROUP_NAME::VARCHAR,
      'uid', ACTION_FILE_GROUP::VARCHAR)))::ARRAY
    file.owner.name: (ACTION_FILE_OWNER_NAME)::VARCHAR
    file.owner.uid: (ACTION_FILE_OWNER)::VARCHAR
    file.path: (ACTION_FILE_PATH)::VARCHAR
    file.size: (ACTION_FILE_SIZE)::NUMBER
    file.type: (CASE ((case when ACTION_FILE_DEVICE_TYPE = 0 then 0 when ACTION_FILE_DEVICE_TYPE
      = 1 then 6 else 0 end)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Regular File'
      WHEN 2 THEN 'Folder' WHEN 3 THEN 'Character Device' WHEN 4 THEN 'Block Device'
      WHEN 5 THEN 'Local Socket' WHEN 6 THEN 'Named Pipe' WHEN 7 THEN 'Symbolic Link'
      WHEN 99 THEN 'Other' END)::VARCHAR
    file.type_id: (case when ACTION_FILE_DEVICE_TYPE = 0 then 0 when ACTION_FILE_DEVICE_TYPE
      = 1 then 6 else 0 end)::NUMBER
    file_diff: NULL::VARCHAR
    file_result: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('pan-edr-raw-logs')::VARCHAR
    metadata.product.vendor_name: ('paloalto')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (OS_ACTOR_PROCESS_IMAGE_NAME)::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (OS_ACTOR_PRIMARY_USERNAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (AGENT_HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(AGENT_IP_ADDRESSES[0], AGENT_IP_ADDRESSES_V6[0]))::VARCHAR
    - name: '''device.mac'''
      type: '''MAC Address'''
      type_id: 3
      reputation: null::VARIANT
      value: (AGENT_INTERFACE_MAP_MAC[0])::VARCHAR
    - name: '''file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (ACTION_FILE_NAME)::VARCHAR
    - name: '''file.owner'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''file.owner.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (ACTION_FILE_OWNER_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100100)::NUMBER) WHEN 100100 THEN ''File System Activity:
      Unknown'' WHEN 100101 THEN ''File System Activity: Create'' WHEN 100102 THEN
      ''File System Activity: Read'' WHEN 100103 THEN ''File System Activity: Update''
      WHEN 100104 THEN ''File System Activity: Delete'' WHEN 100105 THEN ''File System
      Activity: Rename'' WHEN 100106 THEN ''File System Activity: Set Attributes''
      WHEN 100107 THEN ''File System Activity: Set Security'' WHEN 100108 THEN ''File
      System Activity: Get Attributes'' WHEN 100109 THEN ''File System Activity: Get
      Security'' WHEN 100110 THEN ''File System Activity: Encrypt'' WHEN 100111 THEN
      ''File System Activity: Decrypt'' WHEN 100112 THEN ''File System Activity: Mount''
      WHEN 100113 THEN ''File System Activity: Unmount'' WHEN 100114 THEN ''File System
      Activity: Open'' WHEN 100199 THEN ''File System Activity: Other'' END)::VARCHAR'
    type_uid: (100100)::NUMBER
    unmapped: NULL::VARIANT
  predicate: event_type = 3
