type: mapping
id: pan_firewall_globalprotect_decoded_strata_by_snappy_3002_authentication_1.1.0
version: '1'
name: Pan Firewall Globalprotect Decoded Strata By Snappy to OCSF class Authentication
data-types:
- pan-firewall-globalprotect-decoded-strata-by-snappy
mapping:
  fields:
    activity_id: (CASE WHEN STAGE='login' THEN 1 WHEN STAGE='logout' THEN 2 WHEN STAGE
      IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN STAGE='login' THEN 1 WHEN STAGE='logout' THEN
      2 WHEN STAGE IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Logon' WHEN 2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket' WHEN
      4 THEN 'Service Ticket Request' WHEN 5 THEN 'Service Ticket Renew' WHEN 99 THEN
      'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: (CASE ((CASE WHEN AUTHENTICATION_METHOD='saml' THEN 5 WHEN AUTHENTICATION_METHOD
      IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'NTLM'
      WHEN 10 THEN 'RADIUS' WHEN 2 THEN 'Kerberos' WHEN 3 THEN 'Digest' WHEN 4 THEN
      'OpenID' WHEN 5 THEN 'SAML' WHEN 6 THEN 'OAUTH 2.0' WHEN 7 THEN 'PAP' WHEN 8
      THEN 'CHAP' WHEN 9 THEN 'EAP' WHEN 99 THEN 'Other' END)::VARCHAR
    auth_protocol_id: (CASE WHEN AUTHENTICATION_METHOD='saml' THEN 5 WHEN AUTHENTICATION_METHOD
      IS NULL THEN 0 ELSE 99 END)::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hw_info.serial_number: (MACHINE_SERIAL_NUMBER)::VARCHAR
    device.name: (MACHINE_NAME)::VARCHAR
    device.os.name: (CLIENT_OS)::VARCHAR
    device.os.type: (CASE ((CASE WHEN CLIENT_OS IS NULL THEN 0 WHEN CLIENT_OS = 'Windows'
      THEN 100 WHEN CLIENT_OS = 'Linux' THEN 200 WHEN CLIENT_OS = 'Mac' THEN 300 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN
      'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN
      'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN
      401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN CLIENT_OS IS NULL THEN 0 WHEN CLIENT_OS = 'Windows'
      THEN 100 WHEN CLIENT_OS = 'Linux' THEN 200 WHEN CLIENT_OS = 'Mac' THEN 300 ELSE
      99 END)::NUMBER
    device.os.version: (CLIENT_OS_VERSION)::VARCHAR
    dst_endpoint: NULL::VARIANT
    duration: (LOGIN_DURATION)::NUMBER
    end_time: (date_part('epoch_milliseconds', RECEIVE_TIME::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (RECEIVE_TIME)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: (DESCRIPTION)::VARCHAR
    metadata.event_code: (NULL)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('pan-firewall-globalprotect-decoded-strata-by-snappy')::VARCHAR
    metadata.product.vendor_name: ('paloalto')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(PUBLIC_IP, PRIVATE_IP))::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (SOURCE_USER)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session.expiration_reason: (COALESCE(ERROR, REASON))::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (COALESCE(PUBLIC_IP, PRIVATE_IP))::VARCHAR
    src_endpoint.location.region: (SOURCE_REGION)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS = 'success' THEN 1
      WHEN STATUS = 'failure' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS = 'success' THEN 1 WHEN
      STATUS = 'failure' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', generated_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (generated_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300200 + (CASE WHEN STAGE=''login'' THEN 1 WHEN STAGE=''logout''
      THEN 2 WHEN STAGE IS NULL THEN 0 ELSE 99 END))::NUMBER) WHEN 300200 THEN ''Authentication:
      Unknown'' WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (300200 + (CASE WHEN STAGE='login' THEN 1 WHEN STAGE='logout' THEN 2
      WHEN STAGE IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (SOURCE_USER)::VARCHAR
  predicate: STAGE ILIKE ANY ('%logout%','%login%')
