type: mapping
id: sailpoint_identitynow_audit_reports_events_3001_account_change_1.1.0
version: '9'
name: Sailpoint Identitynow Audit Reports Events to OCSF class Account Change
data-types:
- sailpoint-identitynow-audit-reports-events
mapping:
  fields:
    activity_id: (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE ANY ('%create%',
      '%Add%') THEN 1 WHEN ACTION ILIKE '%Activate%' THEN 2 WHEN ACTION ILIKE ANY
      ('%PasswordChange%', '%USER_PASSWORD_UPDATE%') THEN 3 WHEN ACTION ILIKE '%Disable%'
      THEN 5 WHEN ACTION ILIKE ANY ('%Delete%', '%remove%') THEN 6 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE ANY ('%create%',
      '%Add%') THEN 1 WHEN ACTION ILIKE '%Activate%' THEN 2 WHEN ACTION ILIKE ANY
      ('%PasswordChange%', '%USER_PASSWORD_UPDATE%') THEN 3 WHEN ACTION ILIKE '%Disable%'
      THEN 5 WHEN ACTION ILIKE ANY ('%Delete%', '%remove%') THEN 6 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 10 THEN 'MFA Factor Enable'
      WHEN 11 THEN 'MFA Factor Disable' WHEN 2 THEN 'Enable' WHEN 3 THEN 'Password
      Change' WHEN 4 THEN 'Password Reset' WHEN 5 THEN 'Disable' WHEN 6 THEN 'Delete'
      WHEN 7 THEN 'Attach Policy' WHEN 8 THEN 'Detach Policy' WHEN 9 THEN 'Lock' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor.invoked_by: (ATTRIBUTE_INTERFACE)::VARCHAR
    actor.session.uid: (RAW:details)::VARCHAR
    actor.user.name: (ACTOR_NAME)::VARCHAR
    api.operation: (OPERATION)::VARCHAR
    api.response.error_message: (RAW:attributes:errors)::VARCHAR
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('account_change')::VARCHAR
    class_uid: ('3001')::NUMBER
    cloud.org.name: (ORG)::VARCHAR
    cloud.provider: (ATTRIBUTE_CLOUD_APP_NAME)::VARCHAR
    count: NULL::NUMBER
    device: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('sailpoint-identitynow-audit-reports-events')::VARCHAR
    metadata.product.vendor_name: ('sailpoint')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (ACTOR_NAME)::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (RAW:attributes:hostName)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RAW:ipAddress)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (TARGET_NAME)::VARCHAR
    policy: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.hostname: (RAW:attributes:hostName)::VARCHAR
    src_endpoint.ip: (RAW:ipAddress)::VARCHAR
    src_endpoint.name: (ATTRIBUTE_SOURCE_NAME)::VARCHAR
    src_endpoint.uid: (ATTRIBUTE_SOURCE_ID)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS = 'PASSED' THEN 1
      WHEN STATUS = 'FAILED' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (COALESCE(NAME, TECHNICAL_NAME))::VARCHAR
    status_id: (CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS = 'PASSED' THEN 1 WHEN
      STATUS = 'FAILED' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', created::TIMESTAMP_LTZ))::NUMBER
    time_dt: (created)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300100 + (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE
      ANY (''%create%'', ''%Add%'') THEN 1 WHEN ACTION ILIKE ''%Activate%'' THEN 2
      WHEN ACTION ILIKE ANY (''%PasswordChange%'', ''%USER_PASSWORD_UPDATE%'') THEN
      3 WHEN ACTION ILIKE ''%Disable%'' THEN 5 WHEN ACTION ILIKE ANY (''%Delete%'',
      ''%remove%'') THEN 6 ELSE 99 END))::NUMBER) WHEN 300100 THEN ''Account Change:
      Unknown'' WHEN 300101 THEN ''Account Change: Create'' WHEN 300102 THEN ''Account
      Change: Enable'' WHEN 300103 THEN ''Account Change: Password Change'' WHEN 300104
      THEN ''Account Change: Password Reset'' WHEN 300105 THEN ''Account Change: Disable''
      WHEN 300106 THEN ''Account Change: Delete'' WHEN 300107 THEN ''Account Change:
      Attach Policy'' WHEN 300108 THEN ''Account Change: Detach Policy'' WHEN 300109
      THEN ''Account Change: Lock'' WHEN 300110 THEN ''Account Change: MFA Factor
      Enable'' WHEN 300111 THEN ''Account Change: MFA Factor Disable'' WHEN 300199
      THEN ''Account Change: Other'' END)::VARCHAR'
    type_uid: (300100 + (CASE WHEN ACTION IS NULL THEN 0 WHEN ACTION ILIKE ANY ('%create%',
      '%Add%') THEN 1 WHEN ACTION ILIKE '%Activate%' THEN 2 WHEN ACTION ILIKE ANY
      ('%PasswordChange%', '%USER_PASSWORD_UPDATE%') THEN 3 WHEN ACTION ILIKE '%Disable%'
      THEN 5 WHEN ACTION ILIKE ANY ('%Delete%', '%remove%') THEN 6 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.account.name: (ATTRIBUTE_ACCOUNT_NAME)::VARCHAR
    user.account.uid: (ATTRIBUTE_ACCOUNT_UUID)::VARCHAR
    user.name: (TARGET_NAME)::VARCHAR
    user_result: NULL::VARIANT
  predicate: ACTION ILIKE ANY ('%user%','%account%','%role%','%password%')
