type: mapping
id: sentinelone_raw_events_v2_1004_memory_activity_1.1.0
version: '3'
name: Sentinelone Raw Events V2 to OCSF class Memory Activity
data-types:
- sentinelone-raw-events-v2
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN EVENT_TYPE = 'Remote Thread Creation' THEN 1 WHEN EVENT_TYPE
      IN ('Process Modification', 'Duplicate Process Handle', 'Duplicate Thread Handle')
      THEN 2 WHEN EVENT_TYPE = 'Open Remote Process Handle' THEN 7 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_TYPE = 'Remote Thread Creation' THEN 1
      WHEN EVENT_TYPE IN ('Process Modification', 'Duplicate Process Handle', 'Duplicate
      Thread Handle') THEN 2 WHEN EVENT_TYPE = 'Open Remote Process Handle' THEN 7
      ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allocate Page' WHEN
      2 THEN 'Modify Page' WHEN 3 THEN 'Delete Page' WHEN 4 THEN 'Buffer Overflow'
      WHEN 5 THEN 'Disable DEP' WHEN 6 THEN 'Enable DEP' WHEN 7 THEN 'Read' WHEN 8
      THEN 'Write' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (SRC_PROCESS_CMDLINE)::VARCHAR
    actor.process.created_time: (date_part('epoch_milliseconds', (SRC_PROCESS_START_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.created_time_dt: (SRC_PROCESS_START_TIME)::TIMESTAMP_LTZ
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('value',
      SRC_PROCESS_IMAGE_SHA256, 'algorithm_id', IFF(SRC_PROCESS_IMAGE_SHA256 IS NULL,
      NULL, 3), 'algorithm', IFF(SRC_PROCESS_IMAGE_SHA256 IS NULL, NULL, 'SHA-256'))))::ARRAY
    actor.process.file.path: (SRC_PROCESS_IMAGE_PATH)::VARCHAR
    actor.process.name: (SRC_PROCESS_NAME)::VARCHAR
    actor.process.parent_process.cmd_line: (SRC_PROCESS_PARENT_CMDLINE)::VARCHAR
    actor.process.parent_process.created_time: (date_part('epoch_milliseconds', (SRC_PROCESS_PARENT_START_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.parent_process.created_time_dt: (SRC_PROCESS_PARENT_START_TIME)::TIMESTAMP_LTZ
    actor.process.parent_process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('value',
      SRC_PROCESS_PARENT_IMAGE_SHA256, 'algorithm_id', IFF(SRC_PROCESS_PARENT_IMAGE_SHA256
      IS NULL, NULL, 3), 'algorithm', IFF(SRC_PROCESS_PARENT_IMAGE_SHA256 IS NULL,
      NULL, 'SHA-256'))))::ARRAY
    actor.process.parent_process.name: (SRC_PROCESS_PARENT_NAME)::VARCHAR
    actor.process.parent_process.pid: (SRC_PROCESS_PARENT_PID)::NUMBER
    actor.process.parent_process.uid: (SRC_PROCESS_PARENT_UID)::VARCHAR
    actor.process.pid: (SRC_PROCESS_PID)::NUMBER
    actor.process.uid: (SRC_PROCESS_UID)::VARCHAR
    actor.process.user.name: (SRC_PROCESS_USER_NAME)::VARCHAR
    actual_permissions: NULL::NUMBER
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    base_address: NULL::VARCHAR
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('memory_activity')::VARCHAR
    class_uid: ('1004')::NUMBER
    cloud.account.uid: (RAW['account.id'])::VARCHAR
    count: NULL::NUMBER
    device.name: (COMPUTER_NAME)::VARCHAR
    device.os.name: (OS_NAME)::VARCHAR
    device.os.type: (CASE ((CASE WHEN OS_FAMILY IS NULL THEN 0 WHEN OS_FAMILY = 'windows'
      THEN 100 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows'
      WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android'
      WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN
      'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN OS_FAMILY IS NULL THEN 0 WHEN OS_FAMILY = 'windows'
      THEN 100 ELSE 99 END)::NUMBER
    device.uid: (AGENT_UUID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('sentinelone-raw-events-v2')::VARCHAR
    metadata.product.vendor_name: ('sentinelone')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (SRC_PROCESS_NAME)::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (SRC_PROCESS_PARENT_NAME)::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (SRC_PROCESS_USER_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (TGT_PROCESS_NAME)::VARCHAR
    process.cmd_line: (TGT_PROCESS_CMDLINE)::VARCHAR
    process.created_time: (date_part('epoch_milliseconds', (TGT_PROCESS_START_TIME)::TIMESTAMP_LTZ))::NUMBER
    process.created_time_dt: (TGT_PROCESS_START_TIME)::TIMESTAMP_LTZ
    process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('value', TGT_PROCESS_IMAGE_SHA256,
      'algorithm_id', IFF(TGT_PROCESS_IMAGE_SHA256 IS NULL, NULL, 3), 'algorithm',
      IFF(TGT_PROCESS_IMAGE_SHA256 IS NULL, NULL, 'SHA-256'))))::ARRAY
    process.name: (TGT_PROCESS_NAME)::VARCHAR
    process.pid: (TGT_PROCESS_PID)::NUMBER
    process.uid: (TGT_PROCESS_UID)::VARCHAR
    raw_data: NULL::VARCHAR
    requested_permissions: NULL::NUMBER
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    size: NULL::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100400 + (CASE WHEN EVENT_TYPE = ''Remote Thread Creation''
      THEN 1 WHEN EVENT_TYPE IN (''Process Modification'', ''Duplicate Process Handle'',
      ''Duplicate Thread Handle'') THEN 2 WHEN EVENT_TYPE = ''Open Remote Process
      Handle'' THEN 7 ELSE 99 END))::NUMBER) WHEN 100400 THEN ''Memory Activity: Unknown''
      WHEN 100401 THEN ''Memory Activity: Allocate Page'' WHEN 100402 THEN ''Memory
      Activity: Modify Page'' WHEN 100403 THEN ''Memory Activity: Delete Page'' WHEN
      100404 THEN ''Memory Activity: Buffer Overflow'' WHEN 100405 THEN ''Memory Activity:
      Disable DEP'' WHEN 100406 THEN ''Memory Activity: Enable DEP'' WHEN 100407 THEN
      ''Memory Activity: Read'' WHEN 100408 THEN ''Memory Activity: Write'' WHEN 100499
      THEN ''Memory Activity: Other'' END)::VARCHAR'
    type_uid: (100400 + (CASE WHEN EVENT_TYPE = 'Remote Thread Creation' THEN 1 WHEN
      EVENT_TYPE IN ('Process Modification', 'Duplicate Process Handle', 'Duplicate
      Thread Handle') THEN 2 WHEN EVENT_TYPE = 'Open Remote Process Handle' THEN 7
      ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_TYPE IN ('Process Modification', 'Duplicate Process Handle', 'Duplicate
    Thread Handle', 'Open Remote Process Handle', 'Remote Thread Creation', 'Module
    Load')
