type: mapping
id: sentinelone_raw_events_v2_201003_win_resource_activity_1.1.0
version: '1'
name: Sentinelone Raw Events V2 to OCSF class Win/resource Activity
data-types:
- sentinelone-raw-events-v2
mapping:
  fields:
    action: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN
      'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Access' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (SRC_PROCESS_CMDLINE)::VARCHAR
    actor.process.created_time: (date_part('epoch_milliseconds', SRC_PROCESS_START_TIME::TIMESTAMP_LTZ))::NUMBER
    actor.process.created_time_dt: (SRC_PROCESS_START_TIME)::TIMESTAMP_LTZ
    actor.process.file.created_time: (date_part('epoch_milliseconds', RAW:tgt.file.creationTime::TIMESTAMP_LTZ))::NUMBER
    actor.process.file.created_time_dt: (RAW:tgt.file.creationTime)::TIMESTAMP_LTZ
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'MD5','algorithm_id', 1, 'value', RAW:"src.process.image.md5"),OBJECT_CONSTRUCT_KEEP_NULL('algorithm','SHA-256',
      'algorithm_id', 3, 'value', SRC_PROCESS_IMAGE_SHA256),OBJECT_CONSTRUCT_KEEP_NULL('algorithm','SHA-1',
      'algorithm_id', 2, 'value', RAW:"src.process.image.sha1")))::ARRAY
    actor.process.file.parent_folder: (RAW:tgt.file.location)::VARCHAR
    actor.process.file.path: (SRC_PROCESS_IMAGE_PATH)::VARCHAR
    actor.process.integrity: (CASE (CASE RAW:"src.process.integrityLevel" WHEN 'SYSTEM'
      THEN 5 WHEN 'MEDIUM' THEN 3 WHEN 'INTEGRITY_LEVEL_UNKNOWN' THEN 0 WHEN 'LOW'
      THEN 2 WHEN 'HIGH' THEN 4  ELSE 99 END) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Untrusted'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'System'
      WHEN 6 THEN 'Protected' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.integrity_id: (CASE RAW:"src.process.integrityLevel" WHEN 'SYSTEM'
      THEN 5 WHEN 'MEDIUM' THEN 3 WHEN 'INTEGRITY_LEVEL_UNKNOWN' THEN 0 WHEN 'LOW'
      THEN 2 WHEN 'HIGH' THEN 4  ELSE 99 END)::NUMBER
    actor.process.name: (SRC_PROCESS_NAME)::VARCHAR
    actor.process.parent_process.cmd_line: (SRC_PROCESS_PARENT_CMDLINE)::VARCHAR
    actor.process.parent_process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'MD5','algorithm_id', 1, 'value', RAW:"src.process.parent.image.md5"),OBJECT_CONSTRUCT_KEEP_NULL('algorithm','SHA-256',
      'algorithm_id', 3, 'value', SRC_PROCESS_PARENT_IMAGE_SHA256),OBJECT_CONSTRUCT_KEEP_NULL('algorithm','SHA-1',
      'algorithm_id', 2, 'value', RAW:"src.process.parent.image.sha1")))::ARRAY
    actor.process.parent_process.file.path: (RAW:src.process.parent.image.path)::VARCHAR
    actor.process.parent_process.integrity: (CASE (CASE RAW:"src.process.parent.integrityLevel"
      WHEN 'SYSTEM' THEN 5 WHEN 'MEDIUM' THEN 3 WHEN 'INTEGRITY_LEVEL_UNKNOWN' THEN
      0 WHEN 'LOW' THEN 2 WHEN 'HIGH' THEN 4  ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Untrusted' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High'
      WHEN 5 THEN 'System' WHEN 6 THEN 'Protected' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.parent_process.integrity_id: (CASE RAW:"src.process.parent.integrityLevel"
      WHEN 'SYSTEM' THEN 5 WHEN 'MEDIUM' THEN 3 WHEN 'INTEGRITY_LEVEL_UNKNOWN' THEN
      0 WHEN 'LOW' THEN 2 WHEN 'HIGH' THEN 4  ELSE 99 END)::NUMBER
    actor.process.parent_process.name: (SRC_PROCESS_PARENT_NAME)::VARCHAR
    actor.process.parent_process.pid: (SRC_PROCESS_PARENT_PID)::NUMBER
    actor.process.parent_process.uid: (SRC_PROCESS_PARENT_UID)::VARCHAR
    actor.process.pid: (SRC_PROCESS_PID)::NUMBER
    actor.process.uid: (SRC_PROCESS_UID)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (1::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('win/resource_activity')::VARCHAR
    class_uid: ('201003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.os.name: (OS_NAME)::VARCHAR
    device.os.type: (CASE (CASE OS_FAMILY WHEN 'linux' THEN 200 WHEN 'windows' THEN
      100 WHEN 'osx' THEN 300 WHEN NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux'
      WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN
      'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN
      99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE OS_FAMILY WHEN 'linux' THEN 200 WHEN 'windows' THEN 100
      WHEN 'osx' THEN 300 WHEN NULL THEN 0 ELSE 99 END)::NUMBER
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('sentinelone-raw-events-v2')::VARCHAR
    metadata.product.vendor_name: ('sentinelone')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (SRC_PROCESS_NAME)::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (SRC_PROCESS_PARENT_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    raw_data: NULL::VARCHAR
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    start_time: (date_part('epoch_milliseconds', TIMESTAMP::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (TIMESTAMP)::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (20100300::NUMBER) WHEN 20100300 THEN ''Windows Resource Activity:
      Unknown'' WHEN 20100301 THEN ''Windows Resource Activity: Access'' WHEN 20100399
      THEN ''Windows Resource Activity: Other'' END)::VARCHAR'
    type_uid: (20100300)::NUMBER
    unmapped: NULL::VARIANT
    win_resource.type: (CASE (CASE WHEN EVENT_TYPE ILIKE '%process%' THEN 20 WHEN
      EVENT_TYPE ILIKE '%key%' THEN 25 WHEN EVENT_TYPE ILIKE '%file%' THEN 7 WHEN
      EVENT_TYPE ILIKE '%thread%' THEN 9 WHEN EVENT_TYPE ILIKE '%driver%' THEN 15
      ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Directory' WHEN 10 THEN
      'Section' WHEN 11 THEN 'WindowStation' WHEN 12 THEN 'DebugObject' WHEN 13 THEN
      'FilterCommunicationPort' WHEN 14 THEN 'EventPair' WHEN 15 THEN 'Driver' WHEN
      16 THEN 'IoCompletion' WHEN 17 THEN 'Controller' WHEN 18 THEN 'SymbolicLink'
      WHEN 19 THEN 'WmiGuid' WHEN 2 THEN 'Event' WHEN 20 THEN 'Process' WHEN 21 THEN
      'Profile' WHEN 22 THEN 'Desktop' WHEN 23 THEN 'KeyedEvent' WHEN 24 THEN 'Adapter'
      WHEN 25 THEN 'Key' WHEN 26 THEN 'WaitablePort' WHEN 27 THEN 'Callback' WHEN
      28 THEN 'Semaphore' WHEN 29 THEN 'Job' WHEN 3 THEN 'Timer' WHEN 30 THEN 'Port'
      WHEN 31 THEN 'FilterConnectionPort' WHEN 32 THEN 'ALPC Port' WHEN 33 THEN 'SAM_ALIAS'
      WHEN 34 THEN 'SAM_GROUP' WHEN 35 THEN 'SAM_USER' WHEN 36 THEN 'SAM_DOMAIN' WHEN
      37 THEN 'SAM_SERVER' WHEN 4 THEN 'Device' WHEN 5 THEN 'Mutant' WHEN 6 THEN 'Type'
      WHEN 7 THEN 'File' WHEN 8 THEN 'Token' WHEN 9 THEN 'Thread' WHEN 99 THEN 'Other'
      END)::VARCHAR
    win_resource.type_id: (CASE WHEN EVENT_TYPE ILIKE '%process%' THEN 20 WHEN EVENT_TYPE
      ILIKE '%key%' THEN 25 WHEN EVENT_TYPE ILIKE '%file%' THEN 7 WHEN EVENT_TYPE
      ILIKE '%thread%' THEN 9 WHEN EVENT_TYPE ILIKE '%driver%' THEN 15 ELSE 99 END)::NUMBER
  predicate: event_type ilike ANY ('%file%', '%key%', '%process%','%thread%', '%driver%')
