type: mapping
id: sentinelone_raw_events_v2_1005_module_activity_1.1.0
version: '2'
name: Sentinelone Raw Events V2 to OCSF class Module Activity
data-types:
- sentinelone-raw-events-v2
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN EVENT_TYPE IS NULL THEN 0 WHEN EVENT_TYPE IN ('Module
      Load', 'Driver Load') THEN 1 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_TYPE IS NULL THEN 0 WHEN EVENT_TYPE IN
      ('Module Load', 'Driver Load') THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Load' WHEN 2 THEN 'Unload' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (SRC_PROCESS_CMDLINE)::VARCHAR
    actor.process.created_time: (date_part('epoch_milliseconds', (SRC_PROCESS_START_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.created_time_dt: (SRC_PROCESS_START_TIME)::TIMESTAMP_LTZ
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('value',
      SRC_PROCESS_IMAGE_SHA256, 'algorithm_id', IFF(SRC_PROCESS_IMAGE_SHA256 IS NULL,
      NULL, 3), 'algorithm', IFF(SRC_PROCESS_IMAGE_SHA256 IS NULL, NULL, 'SHA-256'))))::ARRAY
    actor.process.file.path: (SRC_PROCESS_IMAGE_PATH)::VARCHAR
    actor.process.name: (SRC_PROCESS_NAME)::VARCHAR
    actor.process.parent_process.cmd_line: (SRC_PROCESS_PARENT_CMDLINE)::VARCHAR
    actor.process.parent_process.created_time: (date_part('epoch_milliseconds', (SRC_PROCESS_PARENT_START_TIME)::TIMESTAMP_LTZ))::NUMBER
    actor.process.parent_process.created_time_dt: (SRC_PROCESS_PARENT_START_TIME)::TIMESTAMP_LTZ
    actor.process.parent_process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('value',
      SRC_PROCESS_PARENT_IMAGE_SHA256, 'algorithm_id', IFF(SRC_PROCESS_PARENT_IMAGE_SHA256
      IS NULL, NULL, 3), 'algorithm', IFF(SRC_PROCESS_PARENT_IMAGE_SHA256 IS NULL,
      NULL, 'SHA-256'))))::ARRAY
    actor.process.parent_process.name: (SRC_PROCESS_PARENT_NAME)::VARCHAR
    actor.process.parent_process.pid: (SRC_PROCESS_PARENT_PID)::NUMBER
    actor.process.parent_process.uid: (SRC_PROCESS_PARENT_UID)::VARCHAR
    actor.process.pid: (SRC_PROCESS_PID)::NUMBER
    actor.process.uid: (SRC_PROCESS_UID)::VARCHAR
    actor.process.user.name: (SRC_PROCESS_USER_NAME)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('module_activity')::VARCHAR
    class_uid: ('1005')::NUMBER
    cloud.provider: ('Sentinelone')::VARCHAR
    count: NULL::NUMBER
    device.name: (COMPUTER_NAME)::VARCHAR
    device.os.name: (OS_NAME)::VARCHAR
    device.os.type: (CASE ((CASE WHEN OS_FAMILY IS NULL THEN 0 WHEN OS_FAMILY = 'windows'
      THEN 100 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows'
      WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android'
      WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN
      'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN OS_FAMILY IS NULL THEN 0 WHEN OS_FAMILY = 'windows'
      THEN 100 ELSE 99 END)::NUMBER
    device.type: (CASE ((CASE WHEN RAW:"endpoint.type" IS NULL THEN 0 WHEN RAW:"endpoint.type"
      ILIKE '%laptop%' THEN 3 WHEN RAW:"endpoint.type" ILIKE '%server%' THEN 1 WHEN
      RAW:"endpoint.type" ILIKE '%desktop%' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Server' WHEN 10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN
      2 THEN 'Desktop' WHEN 3 THEN 'Laptop' WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile'
      WHEN 6 THEN 'Virtual' WHEN 7 THEN 'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall'
      WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN RAW:"endpoint.type" IS NULL THEN 0 WHEN RAW:"endpoint.type"
      ILIKE '%laptop%' THEN 3 WHEN RAW:"endpoint.type" ILIKE '%server%' THEN 1 WHEN
      RAW:"endpoint.type" ILIKE '%desktop%' THEN 2 ELSE 99 END)::NUMBER
    device.uid: (AGENT_UUID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (EVENT_TYPE)::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('sentinelone-raw-events-v2')::VARCHAR
    metadata.product.vendor_name: ('sentinelone')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    module.file.desc: (RAW:"tgt.file.description")::VARCHAR
    module.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm_id',
      CASE WHEN TGT_FILE_SHA256 IS NOT NULL THEN 3 WHEN RAW:"tgt.file.sha1" IS NOT
      NULL THEN 2 WHEN RAW:"tgt.file.md5" IS NOT NULL THEN 1 END::NUMBER, 'algorithm',
      CASE WHEN TGT_FILE_SHA256 IS NOT NULL THEN 'SHA-256' WHEN RAW:"tgt.file.sha1"
      IS NOT NULL THEN 'SHA-1' WHEN RAW:"tgt.file.md5" IS NOT NULL THEN 'MD5' END::VARCHAR,
      'value', COALESCE(TGT_FILE_SHA256, RAW:"tgt.file.sha1", RAW:"tgt.file.md5")::VARCHAR)))::ARRAY
    module.file.name: (RAW:"tgt.file.internalName")::VARCHAR
    module.file.path: (RAW:"tgt.file.path")::VARCHAR
    module.file.size: (RAW:"tgt.file.size")::NUMBER
    module.file.type: (CASE ((IFF(RAW:"tgt.file.type" IS NULL, 0, 99))::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Regular File' WHEN 2 THEN 'Folder' WHEN 3 THEN
      'Character Device' WHEN 4 THEN 'Block Device' WHEN 5 THEN 'Local Socket' WHEN
      6 THEN 'Named Pipe' WHEN 7 THEN 'Symbolic Link' WHEN 99 THEN 'Other' END)::VARCHAR
    module.file.type_id: (IFF(RAW:"tgt.file.type" IS NULL, 0, 99))::NUMBER
    module.file.uid: (RAW:"tgt.file.id")::VARCHAR
    module.load_type: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Standard'
      WHEN 2 THEN 'Non Standard' WHEN 3 THEN 'ShellCode' WHEN 4 THEN 'Mapped' WHEN
      5 THEN 'NonStandard Backed' WHEN 99 THEN 'Other' END)::VARCHAR
    module.load_type_id: (0)::NUMBER
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (SRC_PROCESS_NAME)::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (SRC_PROCESS_PARENT_NAME)::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (SRC_PROCESS_USER_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''module.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''module.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (RAW:"tgt.file.internalName")::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100500 + (CASE WHEN EVENT_TYPE IS NULL THEN 0 WHEN EVENT_TYPE
      IN (''Module Load'', ''Driver Load'') THEN 1 ELSE 99 END))::NUMBER) WHEN 100500
      THEN ''Module Activity: Unknown'' WHEN 100501 THEN ''Module Activity: Load''
      WHEN 100502 THEN ''Module Activity: Unload'' WHEN 100599 THEN ''Module Activity:
      Other'' END)::VARCHAR'
    type_uid: (100500 + (CASE WHEN EVENT_TYPE IS NULL THEN 0 WHEN EVENT_TYPE IN ('Module
      Load', 'Driver Load') THEN 1 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_TYPE IN ('Module Load', 'Driver Load')
