type: mapping
id: sentinelone_raw_events_v2_4003_dns_activity_1.1.0
version: '9'
name: Sentinelone Raw Events V2 to OCSF class Dns Activity
data-types:
- sentinelone-raw-events-v2
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (1)::NUMBER
    activity_name: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Query' WHEN
      2 THEN 'Response' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (SRC_PROCESS_CMDLINE)::VARCHAR
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('value',
      SRC_PROCESS_IMAGE_SHA256,  'algorithm_id', IFF(SRC_PROCESS_IMAGE_SHA256 IS NULL,
      NULL, 3))))::ARRAY
    actor.process.file.path: (SRC_PROCESS_IMAGE_PATH)::VARCHAR
    actor.process.name: (SRC_PROCESS_NAME)::VARCHAR
    actor.process.parent_process.cmd_line: (SRC_PROCESS_PARENT_CMDLINE)::VARCHAR
    actor.process.parent_process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('value',
      SRC_PROCESS_PARENT_IMAGE_SHA256,  'algorithm_id', IFF(SRC_PROCESS_PARENT_IMAGE_SHA256
      IS NULL, NULL, 3))))::ARRAY
    actor.process.parent_process.name: (SRC_PROCESS_PARENT_NAME)::VARCHAR
    actor.process.parent_process.pid: (SRC_PROCESS_PARENT_PID)::NUMBER
    actor.process.parent_process.uid: (SRC_PROCESS_PARENT_UID)::VARCHAR
    actor.process.pid: (SRC_PROCESS_PID)::NUMBER
    actor.process.uid: (SRC_PROCESS_UID)::VARCHAR
    actor.process.user.name: (SRC_PROCESS_USER_NAME)::VARCHAR
    actor.user.full_name: (LOGIN_USER_NAME)::VARCHAR
    actor.user.uid: (LOGIN_USER_SID)::VARCHAR
    answers: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('type', IFF(DNS_RESPONSE
      ILIKE 'type%', DNS_RESPONSE, NULL))))::ARRAY
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: NULL::VARCHAR
    category_uid: NULL::NUMBER
    class_name: ('dns_activity')::VARCHAR
    class_uid: ('4003')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((2)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.direction_id: (2)::NUMBER
    count: NULL::NUMBER
    device.hostname: (COMPUTER_NAME)::VARCHAR
    device.os.name: (OS_NAME)::VARCHAR
    device.os.type: (CASE ((CASE WHEN OS_FAMILY IS NULL THEN 0 WHEN OS_FAMILY = 'linux'
      THEN 200 WHEN OS_FAMILY = 'windows' THEN 100 WHEN OS_FAMILY = 'osx' THEN 300
      ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101
      THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300
      THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris'
      WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN OS_FAMILY IS NULL THEN 0 WHEN OS_FAMILY = 'linux'
      THEN 200 WHEN OS_FAMILY = 'windows' THEN 100 WHEN OS_FAMILY = 'osx' THEN 300
      ELSE 99 END)::NUMBER
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (DST_IP_ADDRESS)::VARCHAR
    dst_endpoint.port: (DST_PORT_NUMBER)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('sentinelone-raw-events-v2')::VARCHAR
    metadata.product.vendor_name: ('sentinelone')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (SRC_PROCESS_NAME)::VARCHAR
    - name: '''actor.process.parent_process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.parent_process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (SRC_PROCESS_PARENT_NAME)::VARCHAR
    - name: '''actor.process.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (SRC_PROCESS_USER_NAME)::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (COMPUTER_NAME)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DST_IP_ADDRESS)::VARCHAR
    - name: '''query.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DNS_REQUEST)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SRC_IP_ADDRESS)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    query.hostname: (DNS_REQUEST)::VARCHAR
    query_time: NULL::NUMBER
    query_time_dt: NULL::TIMESTAMP_LTZ
    raw_data: NULL::VARCHAR
    rcode: NULL::VARCHAR
    rcode_id: NULL::NUMBER
    response_time: NULL::NUMBER
    response_time_dt: NULL::TIMESTAMP_LTZ
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (SRC_IP_ADDRESS)::VARCHAR
    src_endpoint.port: (SRC_PORT_NUMBER)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400306)::NUMBER) WHEN 400300 THEN ''DNS Activity: Unknown''
      WHEN 400301 THEN ''DNS Activity: Query'' WHEN 400302 THEN ''DNS Activity: Response''
      WHEN 400306 THEN ''DNS Activity: Traffic'' WHEN 400399 THEN ''DNS Activity:
      Other'' END)::VARCHAR'
    type_uid: (400306)::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_TYPE IN ('DNS Resolved', 'DNS Unresolved')
