type: mapping
id: sentinelone_threat_2004_detection_finding_1.1.0
version: '1'
name: Sentinelone Threat to OCSF class Detection Finding
data-types:
- sentinelone-threat
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create'
      WHEN 2 THEN 'Update' WHEN 3 THEN 'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.cmd_line: (MALICIOUS_PROCESS_ARGUMENTS)::VARCHAR
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'SHA-1', 'algorithm_id', 2, 'value', FILE_SHA1), OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'SHA-256', 'algorithm_id', 3, 'value', FILE_SHA256)))::ARRAY
    actor.process.file.path: (FILE_PATH)::VARCHAR
    actor.user.name: (COALESCE(AGENT_LAST_LOGGED_IN_USERNAME, PROCESS_USER))::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((2)::NUMBER) WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: (2)::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud.provider: ('SentinelOne')::VARCHAR
    comment: NULL::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: (CASE WHEN CONFIDENCE_LEVEL IS NULL THEN 0 WHEN CONFIDENCE_LEVEL
      ILIKE 'malicious' THEN 3 ELSE 99 END)::NUMBER
    confidence_score: NULL::NUMBER
    count: NULL::NUMBER
    device.domain: (AGENT_DOMAIN)::VARCHAR
    device.ip: (AGENT_IPS[0])::VARCHAR
    device.name: (AGENT_COMPUTER_NAME)::VARCHAR
    device.os.name: (AGENT_OS_NAME)::VARCHAR
    device.os.type: (CASE ((CASE WHEN AGENT_OS_TYPE IS NULL THEN 0 WHEN AGENT_OS_TYPE
      ILIKE '%windows%' THEN 100 WHEN AGENT_OS_TYPE ILIKE '%linux%' THEN 200 WHEN
      AGENT_OS_TYPE ILIKE '%mac%' THEN 300 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 100 THEN 'Windows' WHEN 101 THEN 'Windows Mobile' WHEN 200 THEN 'Linux'
      WHEN 201 THEN 'Android' WHEN 300 THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN
      'iPadOS' WHEN 400 THEN 'Solaris' WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN
      99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN AGENT_OS_TYPE IS NULL THEN 0 WHEN AGENT_OS_TYPE
      ILIKE '%windows%' THEN 100 WHEN AGENT_OS_TYPE ILIKE '%linux%' THEN 200 WHEN
      AGENT_OS_TYPE ILIKE '%mac%' THEN 300 ELSE 99 END)::NUMBER
    device.uid: (AGENT_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: NULL::ARRAY
    finding_info.analytic.desc: (RAW:threatInfo:analystVerdictDescription)::VARCHAR
    finding_info.analytic.name: (RAW:threatInfo:analystVerdict)::VARCHAR
    finding_info.created_time: (date_part('epoch_milliseconds', (CREATED_AT)::TIMESTAMP_LTZ))::NUMBER
    finding_info.created_time_dt: (CREATED_AT)::TIMESTAMP_LTZ
    finding_info.first_seen_time: (date_part('epoch_milliseconds', (IDENTIFIED_AT)::TIMESTAMP_LTZ))::NUMBER
    finding_info.first_seen_time_dt: (IDENTIFIED_AT)::TIMESTAMP_LTZ
    finding_info.modified_time: (date_part('epoch_milliseconds', (UPDATED_AT)::TIMESTAMP_LTZ))::NUMBER
    finding_info.modified_time_dt: (UPDATED_AT)::TIMESTAMP_LTZ
    finding_info.title: (THREAT_NAME)::VARCHAR
    finding_info.types: (ARRAY_CONSTRUCT(CLASSIFICATION))::ARRAY
    finding_info.uid: (THREAT_ID)::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: (RAW:description)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('sentinelone-threat')::VARCHAR
    metadata.product.vendor_name: ('sentinelone')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(AGENT_LAST_LOGGED_IN_USERNAME, PROCESS_USER))::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (AGENT_IPS[0])::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: NULL::ARRAY
    risk_level: NULL::VARCHAR
    risk_level_id: NULL::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN INCIDENT_STATUS IS NULL THEN 0 WHEN INCIDENT_STATUS =
      'New' THEN 1 WHEN INCIDENT_STATUS = 'In progress' THEN 2 WHEN INCIDENT_STATUS
      = 'Suppressed' THEN 3 WHEN INCIDENT_STATUS = 'Resolved' THEN 4 ELSE 99 END::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'New' WHEN 2 THEN 'In Progress' WHEN 3 THEN
      'Suppressed' WHEN 4 THEN 'Resolved' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN INCIDENT_STATUS IS NULL THEN 0 WHEN INCIDENT_STATUS = 'New'
      THEN 1 WHEN INCIDENT_STATUS = 'In progress' THEN 2 WHEN INCIDENT_STATUS = 'Suppressed'
      THEN 3 WHEN INCIDENT_STATUS = 'Resolved' THEN 4 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', updated_at::TIMESTAMP_LTZ))::NUMBER
    time_dt: (updated_at)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((200400)::NUMBER) WHEN 200400 THEN ''Detection Finding: Unknown''
      WHEN 200401 THEN ''Detection Finding: Create'' WHEN 200402 THEN ''Detection
      Finding: Update'' WHEN 200403 THEN ''Detection Finding: Close'' WHEN 200499
      THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: (200400)::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
