type: mapping
id: seraphic_events_4002_http_activity_1.1.0
version: '9'
name: Seraphic Events to OCSF class Http Activity
data-types:
- seraphic-events
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Connect'
      WHEN 2 THEN 'Delete' WHEN 3 THEN 'Get' WHEN 4 THEN 'Head' WHEN 5 THEN 'Options'
      WHEN 6 THEN 'Post' WHEN 7 THEN 'Put' WHEN 8 THEN 'Trace' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.user.email_addr: (IFF(USERNAME ILIKE '%@%.%', USERNAME, NULL))::VARCHAR
    actor.user.name: (IFF(USERNAME ILIKE '%@%.%', NULL, USERNAME))::VARCHAR
    api: NULL::VARIANT
    app_name: (APPLICATION)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('http_activity')::VARCHAR
    class_uid: ('4002')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.direction_id: (1)::NUMBER
    count: NULL::NUMBER
    device.hostname: (HOSTNAME)::VARCHAR
    device.ip: (IP)::VARCHAR
    device.name: (COMPUTER_NAME)::VARCHAR
    device.os.name: (OS_NAME)::VARCHAR
    device.os.type: (CASE ((CASE WHEN OS_NAME = 'Windows' THEN 100 WHEN OS_NAME =
      'macOS' THEN 300 WHEN OS_NAME = 'Android' THEN 201 WHEN OS_NAME IS NULL THEN
      0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101
      THEN 'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300
      THEN 'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris'
      WHEN 401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN OS_NAME = 'Windows' THEN 100 WHEN OS_NAME = 'macOS'
      THEN 300 WHEN OS_NAME = 'Android' THEN 201 WHEN OS_NAME IS NULL THEN 0 ELSE
      99 END)::NUMBER
    device.os.version: (OS_VERSION)::VARCHAR
    device.uid: (SID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    http_cookies: NULL::ARRAY
    http_request.url.hostname: (PAYLOAD_JSON_URL_HOST)::VARCHAR
    http_request.url.path: (PAYLOAD_JSON_URL_PATH)::VARCHAR
    http_request.url.port: (PAYLOAD_JSON_URL_PORT)::NUMBER
    http_request.url.query_string: (split_part(URL,'?',2))::VARCHAR
    http_request.url.scheme: (SPLIT_PART(PAYLOAD_JSON_URL_PROTOCOL,':',1))::VARCHAR
    http_request.url.url_string: (URL)::VARCHAR
    http_request.user_agent: (PAYLOAD_IMPLANT_DATA_USER_AGENT)::VARCHAR
    http_request.x_forwarded_for: (PAYLOAD_IMPLANT_DATA_IPS)::ARRAY
    http_response.message: (PAYLOAD_JSON_TAB_DETAILS_TITLE)::VARCHAR
    http_status: NULL::NUMBER
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('seraphic-events')::VARCHAR
    metadata.product.vendor_name: ('seraphic')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (IFF(USERNAME ILIKE '%@%.%', USERNAME, NULL))::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (IFF(USERNAME ILIKE '%@%.%', NULL, USERNAME))::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IP)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (PAYLOAD_JSON_URL_HOST)::VARCHAR
    - name: '''http_request.url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (URL)::VARCHAR
    - name: '''http_request.x_forwarded_for'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (PAYLOAD_IMPLANT_DATA_IPS)::ARRAY
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint: NULL::VARIANT
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN PAYLOAD_JSON_TAB_DETAILS_STATUS = 'complete' THEN 1
      WHEN PAYLOAD_JSON_TAB_DETAILS_STATUS IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other'
      END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN PAYLOAD_JSON_TAB_DETAILS_STATUS = 'complete' THEN 1 WHEN
      PAYLOAD_JSON_TAB_DETAILS_STATUS IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', client_ts::TIMESTAMP_LTZ))::NUMBER
    time_dt: (client_ts)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((400200)::NUMBER) WHEN 400200 THEN ''HTTP Activity: Unknown''
      WHEN 400201 THEN ''HTTP Activity: Connect'' WHEN 400202 THEN ''HTTP Activity:
      Delete'' WHEN 400203 THEN ''HTTP Activity: Get'' WHEN 400204 THEN ''HTTP Activity:
      Head'' WHEN 400205 THEN ''HTTP Activity: Options'' WHEN 400206 THEN ''HTTP Activity:
      Post'' WHEN 400207 THEN ''HTTP Activity: Put'' WHEN 400208 THEN ''HTTP Activity:
      Trace'' WHEN 400299 THEN ''HTTP Activity: Other'' END)::VARCHAR'
    type_uid: (400200)::NUMBER
    unmapped: NULL::VARIANT
