type: mapping
id: snowflake_login_history_3002_authentication_1.1.0
version: '10'
name: Snowflake Login History to OCSF class Authentication
data-types:
- snowflake-login-history
mapping:
  fields:
    activity_id: (CASE WHEN IS_SUCCESS IS NULL THEN 0 WHEN IS_SUCCESS = 'YES' THEN
      1 WHEN IS_SUCCESS = 'NO' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN IS_SUCCESS IS NULL THEN 0 WHEN IS_SUCCESS = 'YES'
      THEN 1 WHEN IS_SUCCESS = 'NO' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Logon' WHEN 2 THEN 'Logoff' WHEN 3 THEN 'Authentication Ticket'
      WHEN 4 THEN 'Service Ticket Request' WHEN 5 THEN 'Service Ticket Renew' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: (CASE ((CASE WHEN FIRST_AUTHENTICATION_FACTOR IS NULL THEN 0 WHEN
      FIRST_AUTHENTICATION_FACTOR ILIKE '%SAML%' THEN 5 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'NTLM' WHEN 10 THEN 'RADIUS' WHEN 2 THEN 'Kerberos'
      WHEN 3 THEN 'Digest' WHEN 4 THEN 'OpenID' WHEN 5 THEN 'SAML' WHEN 6 THEN 'OAUTH
      2.0' WHEN 7 THEN 'PAP' WHEN 8 THEN 'CHAP' WHEN 9 THEN 'EAP' WHEN 99 THEN 'Other'
      END)::VARCHAR
    auth_protocol_id: (CASE WHEN FIRST_AUTHENTICATION_FACTOR IS NULL THEN 0 WHEN FIRST_AUTHENTICATION_FACTOR
      ILIKE '%SAML%' THEN 5 ELSE 99 END)::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.ip: (CLIENT_IP)::VARCHAR
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: (CASE WHEN SECOND_AUTHENTICATION_FACTOR IS NULL THEN FALSE ELSE TRUE END)::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('snowflake-login-history')::VARCHAR
    metadata.product.vendor_name: ('snowflake')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint: NULL::VARIANT
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN IS_SUCCESS IS NULL THEN 0 WHEN IS_SUCCESS = 'YES' THEN
      1 WHEN IS_SUCCESS = 'NO' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: (ERROR_CODE)::VARCHAR
    status_detail: (ERROR_MESSAGE)::VARCHAR
    status_id: (CASE WHEN IS_SUCCESS IS NULL THEN 0 WHEN IS_SUCCESS = 'YES' THEN 1
      WHEN IS_SUCCESS = 'NO' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300200 + (CASE WHEN IS_SUCCESS IS NULL THEN 0 WHEN IS_SUCCESS
      = ''YES'' THEN 1 WHEN IS_SUCCESS = ''NO'' THEN 2 ELSE 99 END))::NUMBER) WHEN
      300200 THEN ''Authentication: Unknown'' WHEN 300201 THEN ''Authentication: Logon''
      WHEN 300202 THEN ''Authentication: Logoff'' WHEN 300203 THEN ''Authentication:
      Authentication Ticket'' WHEN 300204 THEN ''Authentication: Service Ticket Request''
      WHEN 300205 THEN ''Authentication: Service Ticket Renew'' WHEN 300299 THEN ''Authentication:
      Other'' END)::VARCHAR'
    type_uid: (300200 + (CASE WHEN IS_SUCCESS IS NULL THEN 0 WHEN IS_SUCCESS = 'YES'
      THEN 1 WHEN IS_SUCCESS = 'NO' THEN 2 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.name: (USER_NAME)::VARCHAR
