type: mapping
id: solarwinds_orion_logs_3002_authentication_1.1.0
version: '10'
name: Solarwinds Orion Logs to OCSF class Authentication
data-types:
- solarwinds-orion-logs
mapping:
  fields:
    activity_id: (CASE WHEN INFO IS NULL THEN 0 WHEN INFO ILIKE '%logged in%' THEN
      1 WHEN INFO ILIKE '%logged out%' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN INFO IS NULL THEN 0 WHEN INFO ILIKE '%logged
      in%' THEN 1 WHEN INFO ILIKE '%logged out%' THEN 2 ELSE 99 END)::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN 2 THEN 'Logoff' WHEN 3 THEN 'Authentication
      Ticket' WHEN 4 THEN 'Service Ticket Request' WHEN 5 THEN 'Service Ticket Renew'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: NULL::VARCHAR
    auth_protocol_id: NULL::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (REGEXP_SUBSTR(RAW, '\\s(\\w+-\\w+-\\w+)\\s', 1, 1, 'e', 1))::VARCHAR
    device.ip: (IP_ADDRESS)::VARCHAR
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process.name: (REGEXP_SUBSTR(RAW, '%([a-zA-Z]+):', 1, 1, 'e', 1))::VARCHAR
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: (INFO)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('solarwinds-orion-logs')::VARCHAR
    metadata.product.vendor_name: ('solarwinds')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (REGEXP_SUBSTR(RAW, '\\s(\\w+-\\w+-\\w+)\\s', 1, 1, 'e', 1))::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (IP_ADDRESS)::VARCHAR
    - name: '''logon_process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (REGEXP_SUBSTR(RAW, '%([a-zA-Z]+):', 1, 1, 'e', 1))::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (EMAIL)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint: NULL::VARIANT
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN INFO IS NULL THEN 300200 WHEN INFO ILIKE ''%logged
      in%'' THEN 300201 WHEN INFO ILIKE ''%logged out%'' THEN 300202 ELSE 300299 END)::NUMBER)
      WHEN 300200 THEN ''Authentication: Unknown'' WHEN 300201 THEN ''Authentication:
      Logon'' WHEN 300202 THEN ''Authentication: Logoff'' WHEN 300203 THEN ''Authentication:
      Authentication Ticket'' WHEN 300204 THEN ''Authentication: Service Ticket Request''
      WHEN 300205 THEN ''Authentication: Service Ticket Renew'' WHEN 300299 THEN ''Authentication:
      Other'' END)::VARCHAR'
    type_uid: (CASE WHEN INFO IS NULL THEN 300200 WHEN INFO ILIKE '%logged in%' THEN
      300201 WHEN INFO ILIKE '%logged out%' THEN 300202 ELSE 300299 END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (EMAIL)::VARCHAR
    user.name: (USER)::VARCHAR
    user.type: (CASE ((IFF(USER = 'admin', 2, 1))::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other'
      END)::VARCHAR
    user.type_id: (IFF(USER = 'admin', 2, 1))::NUMBER
  predicate: INFO ILIKE '%user % logged%'
