type: mapping
id: sophos_central_events_4001_network_activity_1.1.0
version: '9'
name: Sophos Central Events to OCSF class Network Activity
data-types:
- sophos-central-events
mapping:
  fields:
    action: (CASE ((CASE WHEN TYPE ILIKE '%::Allowed' THEN 1 WHEN TYPE ILIKE '%::Blocked'
      THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN
      2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN TYPE ILIKE '%::Allowed' THEN 1 WHEN TYPE ILIKE '%::Blocked'
      THEN 2 ELSE 99 END)::NUMBER
    activity_id: (6)::NUMBER
    activity_name: (CASE ((6)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN
      2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device.type: (CASE ((CASE WHEN ENDPOINT_TYPE = 'server' THEN 1 WHEN ENDPOINT_TYPE
      = 'computer' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Server' WHEN 10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN
      3 THEN 'Laptop' WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual'
      WHEN 7 THEN 'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN
      'Other' END)::VARCHAR
    device.type_id: (CASE WHEN ENDPOINT_TYPE = 'server' THEN 1 WHEN ENDPOINT_TYPE
      = 'computer' THEN 2 ELSE 99 END)::NUMBER
    disposition: (CASE ((CASE WHEN TYPE ILIKE '%::Allowed' THEN 1 WHEN TYPE ILIKE
      '%::Blocked' THEN 2 WHEN TYPE ILIKE '%::Detected' THEN 15 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 10 THEN 'Exonerated' WHEN 11
      THEN 'Corrected' WHEN 12 THEN 'Partially Corrected' WHEN 13 THEN 'Uncorrected'
      WHEN 14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN 16 THEN 'No Action' WHEN
      17 THEN 'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN 'Alert' WHEN 2 THEN 'Blocked'
      WHEN 20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN 22 THEN 'Captcha' WHEN 23 THEN
      'Challenge' WHEN 24 THEN 'Access Revoked' WHEN 25 THEN 'Rejected' WHEN 26 THEN
      'Unauthorized' WHEN 27 THEN 'Error' WHEN 3 THEN 'Quarantined' WHEN 4 THEN 'Isolated'
      WHEN 5 THEN 'Deleted' WHEN 6 THEN 'Dropped' WHEN 7 THEN 'Custom Action' WHEN
      8 THEN 'Approved' WHEN 9 THEN 'Restored' WHEN 99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN TYPE ILIKE '%::Allowed' THEN 1 WHEN TYPE ILIKE '%::Blocked'
      THEN 2 WHEN TYPE ILIKE '%::Detected' THEN 15 ELSE 99 END)::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (NAME)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.logged_time: (date_part('epoch_milliseconds', (CREATED_AT)::TIMESTAMP_LTZ))::NUMBER
    metadata.logged_time_dt: (CREATED_AT)::TIMESTAMP_LTZ
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('sophos-central-events')::VARCHAR
    metadata.product.vendor_name: ('sophos')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(SOURCE_IP, SOURCE_INFO:ip))::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((CASE WHEN SEVERITY = 'low' THEN 2 WHEN SEVERITY = 'medium' THEN
      3 WHEN SEVERITY = 'high' THEN 4 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN
      'High' WHEN 5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY = 'low' THEN 2 WHEN SEVERITY = 'medium' THEN
      3 WHEN SEVERITY = 'high' THEN 4 ELSE 99 END)::NUMBER
    src_endpoint.ip: (COALESCE(SOURCE_IP, SOURCE_INFO:ip))::VARCHAR
    src_endpoint.location.region: (LOCATION)::VARCHAR
    src_endpoint.name: (SOURCE)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((CASE WHEN TYPE ILIKE ''%::Allowed'' THEN 400101 WHEN TYPE
      ILIKE ''%::Blocked'' THEN 400105 ELSE 400199 END)::NUMBER) WHEN 400100 THEN
      ''Network Activity: Unknown'' WHEN 400101 THEN ''Network Activity: Open'' WHEN
      400102 THEN ''Network Activity: Close'' WHEN 400103 THEN ''Network Activity:
      Reset'' WHEN 400104 THEN ''Network Activity: Fail'' WHEN 400105 THEN ''Network
      Activity: Refuse'' WHEN 400106 THEN ''Network Activity: Traffic'' WHEN 400199
      THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN TYPE ILIKE '%::Allowed' THEN 400101 WHEN TYPE ILIKE '%::Blocked'
      THEN 400105 ELSE 400199 END)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
  predicate: TYPE ILIKE ANY ('%::Detected', '%::Allowed', '%::Blocked')
