type: mapping
id: strongdm_query_logs_4002_http_activity_1.1.0
version: '1'
name: Strongdm Query Logs to OCSF class Http Activity
data-types:
- strongdm-query-logs
mapping:
  fields:
    action: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN
      'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN GET(RAW, 'requestMethod') ILIKE 'delete' THEN 1 WHEN GET(RAW,
      'requestMethod') ILIKE 'get' THEN 3 WHEN GET(RAW, 'requestMethod') ILIKE 'head'
      THEN 4 WHEN GET(RAW, 'requestMethod') ILIKE 'post' THEN 6 WHEN GET(RAW, 'requestMethod')
      ILIKE 'put' THEN 7 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN GET(RAW, 'requestMethod') ILIKE 'delete' THEN
      1 WHEN GET(RAW, 'requestMethod') ILIKE 'get' THEN 3 WHEN GET(RAW, 'requestMethod')
      ILIKE 'head' THEN 4 WHEN GET(RAW, 'requestMethod') ILIKE 'post' THEN 6 WHEN
      GET(RAW, 'requestMethod') ILIKE 'put' THEN 7 ELSE 99 END::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Connect' WHEN 2 THEN 'Delete' WHEN 3 THEN 'Get' WHEN
      4 THEN 'Head' WHEN 5 THEN 'Options' WHEN 6 THEN 'Post' WHEN 7 THEN 'Put' WHEN
      8 THEN 'Trace' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.name: (USER_NAME)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    actor.user.uid_alt: (GET(RAW, 'uuid'))::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('http_activity')::VARCHAR
    class_uid: ('4002')::NUMBER
    cloud: NULL::VARIANT
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (CLIENT_IP)::VARCHAR
    duration: (DURATION_MS)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    http_cookies: NULL::ARRAY
    http_request.http_method: (UPPER(GET(RAW, 'requestMethod')))::VARCHAR
    http_request.url.path: (SPLIT_PART(GET(RAW, 'requestURI'), '?', 1))::VARCHAR
    http_request.url.query_string: (SPLIT_PART(GET(RAW, 'requestURI'), '?', 2))::VARCHAR
    http_response: NULL::VARIANT
    http_status: NULL::NUMBER
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('strongdm-query-logs')::VARCHAR
    metadata.product.vendor_name: ('strongdm')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER_NAME)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE (CASE WHEN GET(RAW, ''requestMethod'') ILIKE ''delete'' THEN
      400201 WHEN GET(RAW, ''requestMethod'') ILIKE ''get'' THEN 400203 WHEN GET(RAW,
      ''requestMethod'') ILIKE ''head'' THEN 400204 WHEN GET(RAW, ''requestMethod'')
      ILIKE ''post'' THEN 400206 WHEN GET(RAW, ''requestMethod'') ILIKE ''put'' THEN
      400207 ELSE 400299 END::NUMBER) WHEN 400200 THEN ''HTTP Activity: Unknown''
      WHEN 400201 THEN ''HTTP Activity: Connect'' WHEN 400202 THEN ''HTTP Activity:
      Delete'' WHEN 400203 THEN ''HTTP Activity: Get'' WHEN 400204 THEN ''HTTP Activity:
      Head'' WHEN 400205 THEN ''HTTP Activity: Options'' WHEN 400206 THEN ''HTTP Activity:
      Post'' WHEN 400207 THEN ''HTTP Activity: Put'' WHEN 400208 THEN ''HTTP Activity:
      Trace'' WHEN 400299 THEN ''HTTP Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN GET(RAW, 'requestMethod') ILIKE 'delete' THEN 400201 WHEN
      GET(RAW, 'requestMethod') ILIKE 'get' THEN 400203 WHEN GET(RAW, 'requestMethod')
      ILIKE 'head' THEN 400204 WHEN GET(RAW, 'requestMethod') ILIKE 'post' THEN 400206
      WHEN GET(RAW, 'requestMethod') ILIKE 'put' THEN 400207 ELSE 400299 END)::NUMBER
    unmapped: NULL::VARIANT
  predicate: GET(RAW, 'requestMethod') IS NOT NULL
