type: mapping
id: surf_alerts_logs_2004_detection_finding_1.1.0
version: '1'
name: Surf Alerts Logs to OCSF class Detection Finding
data-types:
- surf-alerts-logs
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create'
      WHEN 2 THEN 'Update' WHEN 3 THEN 'Close' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (CLIENT_LOGIN)::VARCHAR
    actor.user.full_name: (CLIENT_FIRST_NAME || ' ' || CLIENT_LAST_NAME)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((2)::NUMBER) WHEN 2 THEN 'Findings' END)::VARCHAR
    category_uid: (2)::NUMBER
    class_name: ('detection_finding')::VARCHAR
    class_uid: ('2004')::NUMBER
    cloud.org.uid: (COMPANY_ID)::VARCHAR
    comment: NULL::VARCHAR
    confidence: NULL::VARCHAR
    confidence_id: NULL::NUMBER
    confidence_score: NULL::NUMBER
    count: NULL::NUMBER
    device.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('uid', GROUP_ID)))::ARRAY
    device.ip: (COALESCE(SOURCE_EXTERNAL_IP, SOURCE_IP_V4, SOURCE_IP_V6))::VARCHAR
    device.location.country: (COUNTRY)::VARCHAR
    device.os.name: (OPERATING_SYSTEM)::VARCHAR
    device.os.type: (CASE ((CASE WHEN OPERATING_SYSTEM IS NULL THEN 0 WHEN OPERATING_SYSTEM
      ILIKE '%windows%' THEN 100 WHEN OPERATING_SYSTEM ILIKE '%mac%' THEN 300 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 100 THEN 'Windows' WHEN 101 THEN
      'Windows Mobile' WHEN 200 THEN 'Linux' WHEN 201 THEN 'Android' WHEN 300 THEN
      'macOS' WHEN 301 THEN 'iOS' WHEN 302 THEN 'iPadOS' WHEN 400 THEN 'Solaris' WHEN
      401 THEN 'AIX' WHEN 402 THEN 'HP-UX' WHEN 99 THEN 'Other' END)::VARCHAR
    device.os.type_id: (CASE WHEN OPERATING_SYSTEM IS NULL THEN 0 WHEN OPERATING_SYSTEM
      ILIKE '%windows%' THEN 100 WHEN OPERATING_SYSTEM ILIKE '%mac%' THEN 300 ELSE
      99 END)::NUMBER
    device.type: (CASE ((CASE WHEN DEVICE_TYPE IS NULL THEN 0 WHEN DEVICE_TYPE ='desktop'
      THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Server' WHEN
      10 THEN 'Switch' WHEN 11 THEN 'Hub' WHEN 2 THEN 'Desktop' WHEN 3 THEN 'Laptop'
      WHEN 4 THEN 'Tablet' WHEN 5 THEN 'Mobile' WHEN 6 THEN 'Virtual' WHEN 7 THEN
      'IOT' WHEN 8 THEN 'Browser' WHEN 9 THEN 'Firewall' WHEN 99 THEN 'Other' END)::VARCHAR
    device.type_id: (CASE WHEN DEVICE_TYPE IS NULL THEN 0 WHEN DEVICE_TYPE ='desktop'
      THEN 2 ELSE 99 END)::NUMBER
    device.uid: (CLIENT_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    evidences: NULL::ARRAY
    finding_info.created_time: (date_part('epoch_milliseconds', (CREATED_AT)::TIMESTAMP_LTZ))::NUMBER
    finding_info.created_time_dt: (CREATED_AT)::TIMESTAMP_LTZ
    finding_info.modified_time: (date_part('epoch_milliseconds', (UPDATED_AT)::TIMESTAMP_LTZ))::NUMBER
    finding_info.modified_time_dt: (UPDATED_AT)::TIMESTAMP_LTZ
    finding_info.src_url: (RESTRICTED_RESOURCE)::VARCHAR
    finding_info.title: (CLASSIFICATION_NAME)::VARCHAR
    finding_info.types: (ARRAY_CONSTRUCT(POLICY))::ARRAY
    finding_info.uid: (ID)::VARCHAR
    firewall_rule: NULL::VARIANT
    impact: NULL::VARCHAR
    impact_id: NULL::NUMBER
    impact_score: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('surf-alerts-logs')::VARCHAR
    metadata.product.vendor_name: ('surf')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (CLIENT_LOGIN)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(SOURCE_EXTERNAL_IP, SOURCE_IP_V4, SOURCE_IP_V6))::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''finding_info.src_url'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (RESTRICTED_RESOURCE)::VARCHAR
    raw_data: NULL::VARCHAR
    remediation: NULL::VARIANT
    resources: NULL::ARRAY
    risk_level: NULL::VARCHAR
    risk_level_id: NULL::NUMBER
    risk_score: NULL::NUMBER
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS = 'New' THEN 1 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'New' WHEN 2 THEN 'In Progress'
      WHEN 3 THEN 'Suppressed' WHEN 4 THEN 'Resolved' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN STATUS IS NULL THEN 0 WHEN STATUS = 'New' THEN 1 ELSE 99
      END)::NUMBER
    time: (date_part('epoch_milliseconds', created_at::TIMESTAMP_LTZ))::NUMBER
    time_dt: (created_at)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((200400)::NUMBER) WHEN 200400 THEN ''Detection Finding: Unknown''
      WHEN 200401 THEN ''Detection Finding: Create'' WHEN 200402 THEN ''Detection
      Finding: Update'' WHEN 200403 THEN ''Detection Finding: Close'' WHEN 200499
      THEN ''Detection Finding: Other'' END)::VARCHAR'
    type_uid: (200400)::NUMBER
    unmapped: NULL::VARIANT
    vulnerabilities: NULL::ARRAY
