type: mapping
id: symantec_cloud_secure_web_gateway_audit_logs_3002_authentication_1.1.0
version: '10'
name: Symantec Cloud Secure Web Gateway Audit Logs to OCSF class Authentication
data-types:
- symantec-cloud-secure-web-gateway-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN OPERATION_TYPE='Login' THEN 1 WHEN OPERATION_TYPE='Logout'
      THEN 2 WHEN OPERATION_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION_TYPE='Login' THEN 1 WHEN OPERATION_TYPE='Logout'
      THEN 2 WHEN OPERATION_TYPE IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Logon' WHEN 2 THEN 'Logoff' WHEN 3 THEN 'Authentication
      Ticket' WHEN 4 THEN 'Service Ticket Request' WHEN 5 THEN 'Service Ticket Renew'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: NULL::VARCHAR
    auth_protocol_id: NULL::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device: NULL::VARIANT
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: (OBJECT_DATA)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('symantec-cloud-secure-web-gateway-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('symantec')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (EXTRACTED_FIELDS:logged_in_ip)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (EXTRACTED_FIELDS:user_email)::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER_FULL_NAME)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session: NULL::VARIANT
    severity: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (1)::NUMBER
    src_endpoint.ip: (EXTRACTED_FIELDS:logged_in_ip)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', created_on::TIMESTAMP_LTZ))::NUMBER
    time_dt: (created_on)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN OPERATION_TYPE=''Login'' THEN 300201 WHEN OPERATION_TYPE=''Logout''
      THEN 300202 WHEN OPERATION_TYPE IS NULL THEN 300200 ELSE 300299 END)::NUMBER)
      WHEN 300200 THEN ''Authentication: Unknown'' WHEN 300201 THEN ''Authentication:
      Logon'' WHEN 300202 THEN ''Authentication: Logoff'' WHEN 300203 THEN ''Authentication:
      Authentication Ticket'' WHEN 300204 THEN ''Authentication: Service Ticket Request''
      WHEN 300205 THEN ''Authentication: Service Ticket Renew'' WHEN 300299 THEN ''Authentication:
      Other'' END)::VARCHAR'
    type_uid: (CASE WHEN OPERATION_TYPE='Login' THEN 300201 WHEN OPERATION_TYPE='Logout'
      THEN 300202 WHEN OPERATION_TYPE IS NULL THEN 300200 ELSE 300299 END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (EXTRACTED_FIELDS:user_email)::VARCHAR
    user.name: (USER_FULL_NAME)::VARCHAR
  predicate: OPERATION_TYPE IN ('Logout', 'Login')
