type: mapping
id: sysdig_next_gen_activity_file_accesses_1001_file_activity_1.1.0
version: '1'
name: Sysdig Next Gen Activity File Accesses to OCSF class File Activity
data-types:
- sysdig-next-gen-activity-file-accesses
mapping:
  fields:
    access_mask: NULL::NUMBER
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN PERMISSIONS IS NULL THEN 0 WHEN PERMISSIONS = 'r' THEN
      2 WHEN PERMISSIONS = 'w' THEN 3 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN PERMISSIONS IS NULL THEN 0 WHEN PERMISSIONS =
      'r' THEN 2 WHEN PERMISSIONS = 'w' THEN 3 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Create' WHEN 10 THEN 'Encrypt' WHEN 11 THEN 'Decrypt' WHEN 12 THEN
      'Mount' WHEN 13 THEN 'Unmount' WHEN 14 THEN 'Open' WHEN 2 THEN 'Read' WHEN 3
      THEN 'Update' WHEN 4 THEN 'Delete' WHEN 5 THEN 'Rename' WHEN 6 THEN 'Set Attributes'
      WHEN 7 THEN 'Set Security' WHEN 8 THEN 'Get Attributes' WHEN 9 THEN 'Get Security'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.container.uid: (CONTAINER_ID)::VARCHAR
    actor.process.pid: (PID)::NUMBER
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('file_activity')::VARCHAR
    class_uid: ('1001')::NUMBER
    cloud: NULL::VARIANT
    component: NULL::VARCHAR
    connection_uid: NULL::VARCHAR
    count: NULL::NUMBER
    create_mask: NULL::VARCHAR
    device.hostname: (HOSTNAME)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    file.name: (FILENAME)::VARCHAR
    file.path: (DIRECTORY)::VARCHAR
    file_diff: NULL::VARCHAR
    file_result: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('sysdig-next-gen-activity-file-accesses')::VARCHAR
    metadata.product.vendor_name: ('sysdig-next-gen')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.container'''
      type: '''Container'''
      type_id: 27
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (FILENAME)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100100 + (CASE WHEN PERMISSIONS IS NULL THEN 0 WHEN PERMISSIONS
      = ''r'' THEN 2 WHEN PERMISSIONS = ''w'' THEN 3 ELSE 99 END))::NUMBER) WHEN 100100
      THEN ''File System Activity: Unknown'' WHEN 100101 THEN ''File System Activity:
      Create'' WHEN 100102 THEN ''File System Activity: Read'' WHEN 100103 THEN ''File
      System Activity: Update'' WHEN 100104 THEN ''File System Activity: Delete''
      WHEN 100105 THEN ''File System Activity: Rename'' WHEN 100106 THEN ''File System
      Activity: Set Attributes'' WHEN 100107 THEN ''File System Activity: Set Security''
      WHEN 100108 THEN ''File System Activity: Get Attributes'' WHEN 100109 THEN ''File
      System Activity: Get Security'' WHEN 100110 THEN ''File System Activity: Encrypt''
      WHEN 100111 THEN ''File System Activity: Decrypt'' WHEN 100112 THEN ''File System
      Activity: Mount'' WHEN 100113 THEN ''File System Activity: Unmount'' WHEN 100114
      THEN ''File System Activity: Open'' WHEN 100199 THEN ''File System Activity:
      Other'' END)::VARCHAR'
    type_uid: (100100 + (CASE WHEN PERMISSIONS IS NULL THEN 0 WHEN PERMISSIONS = 'r'
      THEN 2 WHEN PERMISSIONS = 'w' THEN 3 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: TYPE = 'fileaccess'
