type: mapping
id: sysdig_next_gen_activity_kubernetes_1007_process_activity_1.1.0
version: '1'
name: Sysdig Next Gen Activity Kubernetes to OCSF class Process Activity
data-types:
- sysdig-next-gen-activity-kubernetes
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Launch'
      WHEN 2 THEN 'Terminate' WHEN 3 THEN 'Open' WHEN 4 THEN 'Inject' WHEN 5 THEN
      'Set User ID' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', USER_GROUPS[0],
      'desc', ARRAY_TO_STRING(USER_GROUPS, '; '))))::ARRAY
    actor.user.name: (USER_NAME)::VARCHAR
    actual_permissions: NULL::NUMBER
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('process_activity')::VARCHAR
    class_uid: ('1007')::NUMBER
    cloud.provider: ('Sysdig')::VARCHAR
    count: NULL::NUMBER
    device.hostname: (HOSTNAME)::VARCHAR
    device.ip: (SOURCE_ADDRESSES[0])::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    exit_code: NULL::NUMBER
    firewall_rule: NULL::VARIANT
    injection_type: NULL::VARCHAR
    injection_type_id: NULL::NUMBER
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('sysdig-next-gen-activity-kubernetes')::VARCHAR
    metadata.product.vendor_name: ('sysdig-next-gen')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    module: NULL::VARIANT
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_ADDRESSES[0])::VARCHAR
    - name: '''process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''process.container'''
      type: '''Container'''
      type_id: 27
      reputation: null::VARIANT
      value: null::VARCHAR
    process.cmd_line: (ARGS_COMMAND)::VARCHAR
    process.container.name: (ARGS_CONTAINER)::VARCHAR
    process.container.uid: (CONTAINER_ID)::VARCHAR
    raw_data: NULL::VARCHAR
    requested_permissions: NULL::NUMBER
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100700)::NUMBER) WHEN 100700 THEN ''Process Activity: Unknown''
      WHEN 100701 THEN ''Process Activity: Launch'' WHEN 100702 THEN ''Process Activity:
      Terminate'' WHEN 100703 THEN ''Process Activity: Open'' WHEN 100704 THEN ''Process
      Activity: Inject'' WHEN 100705 THEN ''Process Activity: Set User ID'' WHEN 100799
      THEN ''Process Activity: Other'' END)::VARCHAR'
    type_uid: (100700)::NUMBER
    unmapped: NULL::VARIANT
