type: mapping
id: teleport_audit_events_3005_user_access_1.1.0
version: '8'
name: Teleport Audit Events to OCSF class User Access
data-types:
- teleport-audit-events
mapping:
  fields:
    activity_id: (CASE WHEN EVENT ILIKE ANY ('%create%', '%update%') THEN 1 WHEN EVENT
      ILIKE '%delete%' THEN 2 WHEN EVENT IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT ILIKE ANY ('%create%', '%update%') THEN
      1 WHEN EVENT ILIKE '%delete%' THEN 2 WHEN EVENT IS NULL THEN 0 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Assign Privileges' WHEN 2 THEN 'Revoke Privileges'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('user_access')::VARCHAR
    class_uid: ('3005')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.ip: (split_part(ADDR_REMOTE,':',1))::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('teleport-audit-events')::VARCHAR
    metadata.product.vendor_name: ('Teleport')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (split_part(ADDR_REMOTE,':',1))::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (IFF(RAW:user ILIKE '%@%', RAW:user, NULL))::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (IFF(RAW:user NOT ILIKE '%@%', RAW:user, NULL))::VARCHAR
    privileges: (COALESCE(RAW:roles, ARRAY_CONSTRUCT(NAME)))::ARRAY
    raw_data: NULL::VARCHAR
    resource: NULL::VARIANT
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (RAW:state)::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', header_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (header_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN EVENT ILIKE ANY (''%create%'', ''%update%'') THEN
      300501 WHEN EVENT ILIKE ''%delete%'' THEN 300502 WHEN EVENT IS NULL THEN 300500
      ELSE 300599 END)::NUMBER) WHEN 300500 THEN ''User Access Management: Unknown''
      WHEN 300501 THEN ''User Access Management: Assign Privileges'' WHEN 300502 THEN
      ''User Access Management: Revoke Privileges'' WHEN 300599 THEN ''User Access
      Management: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN EVENT ILIKE ANY ('%create%', '%update%') THEN 300501 WHEN
      EVENT ILIKE '%delete%' THEN 300502 WHEN EVENT IS NULL THEN 300500 ELSE 300599
      END)::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (IFF(RAW:user ILIKE '%@%', RAW:user, NULL))::VARCHAR
    user.name: (IFF(RAW:user NOT ILIKE '%@%', RAW:user, NULL))::VARCHAR
  predicate: EVENT ILIKE ANY ('%role%', '%access_list%', 'access_request.create',
    'access_request.review', 'access_request.delete', '%privilege_token%')
