type: mapping
id: thycotic_secret_server_6003_api_activity_1.1.0
version: '9'
name: Thycotic Secret Server to OCSF class Api Activity
data-types:
- thycotic-secret-server
mapping:
  fields:
    activity_id: (CASE WHEN NAME IS NULL THEN 0 WHEN NAME ILIKE '%create%' THEN 1
      WHEN NAME ILIKE '%view%' OR NAME ILIKE '%read%' THEN 2 WHEN NAME ILIKE '%change%'
      OR NAME ILIKE '%update%' OR NAME ILIKE '%edit%' OR NAME ILIKE '%modified%' THEN
      3 WHEN NAME ILIKE '%delete%' OR NAME ILIKE '%remove%' THEN 4 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN NAME IS NULL THEN 0 WHEN NAME ILIKE '%create%'
      THEN 1 WHEN NAME ILIKE '%view%' OR NAME ILIKE '%read%' THEN 2 WHEN NAME ILIKE
      '%change%' OR NAME ILIKE '%update%' OR NAME ILIKE '%edit%' OR NAME ILIKE '%modified%'
      THEN 3 WHEN NAME ILIKE '%delete%' OR NAME ILIKE '%remove%' THEN 4 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update'
      WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.file.name: (RAW:fname)::VARCHAR
    actor.process.file.type: (CASE ((CASE WHEN FILE_TYPE IS NULL THEN 0 WHEN FILE_TYPE
      = 'Folder' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Regular
      File' WHEN 2 THEN 'Folder' WHEN 3 THEN 'Character Device' WHEN 4 THEN 'Block
      Device' WHEN 5 THEN 'Local Socket' WHEN 6 THEN 'Named Pipe' WHEN 7 THEN 'Symbolic
      Link' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.file.type_id: (CASE WHEN FILE_TYPE IS NULL THEN 0 WHEN FILE_TYPE
      = 'Folder' THEN 2 ELSE 99 END)::NUMBER
    actor.process.file.uid: (FILE_ID)::VARCHAR
    actor.user.email_addr: (IFF(SOURCE_USER_NAME ILIKE '%@%', SPLIT_PART(SOURCE_USER_NAME,
      '\\', 2), IFF(DESTINATION_USER_NAME ILIKE '%@%', SPLIT_PART(DESTINATION_USER_NAME,
      '\\', 2), NULL)))::VARCHAR
    actor.user.full_name: (RAW:suser_Display_Name)::VARCHAR
    actor.user.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('name', IFF(RAW:Group_or_User
      ILIKE '%group%', RAW:Group_or_User, NULL))))::ARRAY
    actor.user.name: (IFF(SOURCE_USER_NAME ILIKE '%@%', IFF(DESTINATION_USER_NAME
      ILIKE '%@%', NULL, DESTINATION_USER_NAME), SOURCE_USER_NAME))::VARCHAR
    actor.user.uid: (COALESCE(SOURCE_USER_ID, DESTINATION_USER_ID))::VARCHAR
    api.operation: (NAME)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint.uid: (RAW:duid)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: (RAW:msg)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('thycotic-secret-server')::VARCHAR
    metadata.product.vendor_name: ('thycotic')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (RAW:fname)::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (IFF(SOURCE_USER_NAME ILIKE '%@%', SPLIT_PART(SOURCE_USER_NAME, '\\',
        2), IFF(DESTINATION_USER_NAME ILIKE '%@%', SPLIT_PART(DESTINATION_USER_NAME,
        '\\', 2), NULL)))::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (IFF(SOURCE_USER_NAME ILIKE '%@%', IFF(DESTINATION_USER_NAME ILIKE '%@%',
        NULL, DESTINATION_USER_NAME), SOURCE_USER_NAME))::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOST)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    resources: NULL::ARRAY
    severity: (CASE ((CASE WHEN SEVERITY IS NULL THEN 0 WHEN SEVERITY <= 6 THEN SEVERITY
      ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN
      2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY IS NULL THEN 0 WHEN SEVERITY <= 6 THEN SEVERITY
      ELSE 99 END)::NUMBER
    src_endpoint.hostname: (HOST)::VARCHAR
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.port: (PORT)::NUMBER
    src_endpoint.uid: (RAW:suid)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN RAW:Message IS NULL THEN 0 WHEN RAW:Message ILIKE '%success%'
      THEN 1 WHEN RAW:Message ILIKE '%failed%' THEN 2 ELSE 99 END)::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other'
      END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (RAW:Message)::VARCHAR
    status_id: (CASE WHEN RAW:Message IS NULL THEN 0 WHEN RAW:Message ILIKE '%success%'
      THEN 1 WHEN RAW:Message ILIKE '%failed%' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN NAME IS NULL THEN 600300 WHEN NAME ILIKE ''%create%''
      THEN 600301 WHEN NAME ILIKE ''%view%'' OR NAME ILIKE ''%read%'' THEN 600302
      WHEN NAME ILIKE ''%change%'' OR NAME ILIKE ''%update%'' OR NAME ILIKE ''%edit%''
      OR NAME ILIKE ''%modified%'' THEN 600303 WHEN NAME ILIKE ''%delete%'' OR NAME
      ILIKE ''%remove%'' THEN 600304 ELSE 600399 END)::NUMBER) WHEN 600300 THEN ''API
      Activity: Unknown'' WHEN 600301 THEN ''API Activity: Create'' WHEN 600302 THEN
      ''API Activity: Read'' WHEN 600303 THEN ''API Activity: Update'' WHEN 600304
      THEN ''API Activity: Delete'' WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN NAME IS NULL THEN 600300 WHEN NAME ILIKE '%create%' THEN
      600301 WHEN NAME ILIKE '%view%' OR NAME ILIKE '%read%' THEN 600302 WHEN NAME
      ILIKE '%change%' OR NAME ILIKE '%update%' OR NAME ILIKE '%edit%' OR NAME ILIKE
      '%modified%' THEN 600303 WHEN NAME ILIKE '%delete%' OR NAME ILIKE '%remove%'
      THEN 600304 ELSE 600399 END)::NUMBER
    unmapped: NULL::VARIANT
