type: mapping
id: thycotic_secret_server_3001_account_change_1.1.0
version: '9'
name: Thycotic Secret Server to OCSF class Account Change
data-types:
- thycotic-secret-server
mapping:
  fields:
    activity_id: (CASE WHEN NAME IS NULL THEN 0 WHEN NAME IN ('USER - CREATE', 'ROLE
      - CREATE') THEN 1 WHEN NAME ILIKE '%Enable%' THEN 2 WHEN NAME ILIKE ANY ('%PASSWORD
      CHANGE%', '%PASSWORDCHANGE%', '%PASSWORD_CHANGE%') THEN 3 WHEN NAME ILIKE '%Disable%'
      THEN 5 WHEN NAME ILIKE '%LOCKOUT%' THEN 9 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN NAME IS NULL THEN 0 WHEN NAME IN ('USER - CREATE',
      'ROLE - CREATE') THEN 1 WHEN NAME ILIKE '%Enable%' THEN 2 WHEN NAME ILIKE ANY
      ('%PASSWORD CHANGE%', '%PASSWORDCHANGE%', '%PASSWORD_CHANGE%') THEN 3 WHEN NAME
      ILIKE '%Disable%' THEN 5 WHEN NAME ILIKE '%LOCKOUT%' THEN 9 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 10 THEN 'MFA Factor Enable'
      WHEN 11 THEN 'MFA Factor Disable' WHEN 2 THEN 'Enable' WHEN 3 THEN 'Password
      Change' WHEN 4 THEN 'Password Reset' WHEN 5 THEN 'Disable' WHEN 6 THEN 'Delete'
      WHEN 7 THEN 'Attach Policy' WHEN 8 THEN 'Detach Policy' WHEN 9 THEN 'Lock' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor.process.file.name: (RAW:fname)::VARCHAR
    actor.process.file.type: (CASE ((IFF(FILE_TYPE IS NULL, 0, 99))::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Regular File' WHEN 2 THEN 'Folder' WHEN 3 THEN
      'Character Device' WHEN 4 THEN 'Block Device' WHEN 5 THEN 'Local Socket' WHEN
      6 THEN 'Named Pipe' WHEN 7 THEN 'Symbolic Link' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.file.type_id: (IFF(FILE_TYPE IS NULL, 0, 99))::NUMBER
    actor.process.file.uid: (FILE_ID)::VARCHAR
    api: NULL::VARIANT
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    class_name: ('account_change')::VARCHAR
    class_uid: ('3001')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (HOST)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: (RAW:msg)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('thycotic-secret-server')::VARCHAR
    metadata.product.vendor_name: ('thycotic')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (RAW:fname)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOST)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (COALESCE(IFF(SOURCE_USER_NAME ILIKE '%@%', SOURCE_USER_NAME, NULL),
        IFF(DESTINATION_USER_NAME ILIKE '%@%', DESTINATION_USER_NAME, NULL)))::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(IFF(SOURCE_USER_NAME NOT ILIKE '%@%', SOURCE_USER_NAME, NULL),
        IFF(DESTINATION_USER_NAME NOT ILIKE '%@%', DESTINATION_USER_NAME, NULL)))::VARCHAR
    policy: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((CASE WHEN SEVERITY IS NULL THEN 0 WHEN SEVERITY <= 6 THEN SEVERITY
      ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN
      2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN SEVERITY IS NULL THEN 0 WHEN SEVERITY <= 6 THEN SEVERITY
      ELSE 99 END)::NUMBER
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.port: (PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((300100 + (CASE WHEN NAME IS NULL THEN 0 WHEN NAME IN (''USER
      - CREATE'', ''ROLE - CREATE'') THEN 1 WHEN NAME ILIKE ''%Enable%'' THEN 2 WHEN
      NAME ILIKE ANY (''%PASSWORD CHANGE%'', ''%PASSWORDCHANGE%'', ''%PASSWORD_CHANGE%'')
      THEN 3 WHEN NAME ILIKE ''%Disable%'' THEN 5 WHEN NAME ILIKE ''%LOCKOUT%'' THEN
      9 ELSE 99 END))::NUMBER) WHEN 300100 THEN ''Account Change: Unknown'' WHEN 300101
      THEN ''Account Change: Create'' WHEN 300102 THEN ''Account Change: Enable''
      WHEN 300103 THEN ''Account Change: Password Change'' WHEN 300104 THEN ''Account
      Change: Password Reset'' WHEN 300105 THEN ''Account Change: Disable'' WHEN 300106
      THEN ''Account Change: Delete'' WHEN 300107 THEN ''Account Change: Attach Policy''
      WHEN 300108 THEN ''Account Change: Detach Policy'' WHEN 300109 THEN ''Account
      Change: Lock'' WHEN 300110 THEN ''Account Change: MFA Factor Enable'' WHEN 300111
      THEN ''Account Change: MFA Factor Disable'' WHEN 300199 THEN ''Account Change:
      Other'' END)::VARCHAR'
    type_uid: (300100 + (CASE WHEN NAME IS NULL THEN 0 WHEN NAME IN ('USER - CREATE',
      'ROLE - CREATE') THEN 1 WHEN NAME ILIKE '%Enable%' THEN 2 WHEN NAME ILIKE ANY
      ('%PASSWORD CHANGE%', '%PASSWORDCHANGE%', '%PASSWORD_CHANGE%') THEN 3 WHEN NAME
      ILIKE '%Disable%' THEN 5 WHEN NAME ILIKE '%LOCKOUT%' THEN 9 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    user.email_addr: (COALESCE(IFF(SOURCE_USER_NAME ILIKE '%@%', SOURCE_USER_NAME,
      NULL), IFF(DESTINATION_USER_NAME ILIKE '%@%', DESTINATION_USER_NAME, NULL)))::VARCHAR
    user.full_name: (RAW:suser_display_name)::VARCHAR
    user.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('name', IFF(RAW:Group_or_User ILIKE
      '%group%', RAW:Group_or_User, NULL))))::ARRAY
    user.name: (COALESCE(IFF(SOURCE_USER_NAME NOT ILIKE '%@%', SOURCE_USER_NAME, NULL),
      IFF(DESTINATION_USER_NAME NOT ILIKE '%@%', DESTINATION_USER_NAME, NULL)))::VARCHAR
    user.uid: (COALESCE(SOURCE_USER_ID, DESTINATION_USER_ID))::VARCHAR
    user_result: NULL::VARIANT
  predicate: NAME ILIKE ANY ('%user%', '%role%', '%password%', '%admin%')
