type: mapping
id: tines_audit_logs_6003_api_activity_1.1.0
version: '9'
name: Tines Audit Logs to OCSF class Api Activity
data-types:
- tines-audit-logs
mapping:
  fields:
    activity_id: (CASE WHEN OPERATION_NAME IS NULL THEN 0 WHEN OPERATION_NAME ILIKE
      '%creation%' THEN 1 WHEN OPERATION_NAME ILIKE '%read%' THEN 2 WHEN OPERATION_NAME
      ILIKE '%change%' OR OPERATION_NAME ILIKE '%update%' OR OPERATION_NAME ILIKE
      '%edit%' THEN 3 WHEN OPERATION_NAME ILIKE '%destruction%' OR OPERATION_NAME
      ILIKE '%removal%' OR OPERATION_NAME ILIKE '%deletion%' THEN 4 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN OPERATION_NAME IS NULL THEN 0 WHEN OPERATION_NAME
      ILIKE '%creation%' THEN 1 WHEN OPERATION_NAME ILIKE '%read%' THEN 2 WHEN OPERATION_NAME
      ILIKE '%change%' OR OPERATION_NAME ILIKE '%update%' OR OPERATION_NAME ILIKE
      '%edit%' THEN 3 WHEN OPERATION_NAME ILIKE '%destruction%' OR OPERATION_NAME
      ILIKE '%removal%' OR OPERATION_NAME ILIKE '%deletion%' THEN 4 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update'
      WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (USER_EMAIL)::VARCHAR
    actor.user.name: (USERNAME)::VARCHAR
    actor.user.org.uid: (TENANT_ID)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    api.operation: (OPERATION_NAME)::VARCHAR
    api.request.data: (OPERATION_INPUTS)::VARIANT
    api.response.data: (RAW:outputs)::VARIANT
    api.response.message: (RAW:outputs:outputs:team_case:description)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.user_agent: (REQUEST_USER_AGENT)::VARCHAR
    message: (OPERATION_DESCRIPTION)::VARCHAR
    metadata.event_code: (operation_name)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('tines-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('tines')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER_EMAIL)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USERNAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (REQUEST_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    resources: NULL::ARRAY
    severity: (CASE ((CASE WHEN RAW:outputs:outputs:team_case:severity IS NULL THEN
      0 WHEN RAW:outputs:outputs:team_case:severity = 'info' THEN 1 WHEN RAW:outputs:outputs:team_case:severity
      = 'low' THEN 2 WHEN RAW:outputs:outputs:team_case:severity = 'medium' THEN 3
      WHEN RAW:outputs:outputs:team_case:severity = 'high' THEN 4 WHEN RAW:outputs:outputs:team_case:severity
      = 'critical' THEN 5 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN
      5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN RAW:outputs:outputs:team_case:severity IS NULL THEN 0
      WHEN RAW:outputs:outputs:team_case:severity = 'info' THEN 1 WHEN RAW:outputs:outputs:team_case:severity
      = 'low' THEN 2 WHEN RAW:outputs:outputs:team_case:severity = 'medium' THEN 3
      WHEN RAW:outputs:outputs:team_case:severity = 'high' THEN 4 WHEN RAW:outputs:outputs:team_case:severity
      = 'critical' THEN 5 ELSE 99 END)::NUMBER
    src_endpoint.ip: (REQUEST_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', updated_at::TIMESTAMP_LTZ))::NUMBER
    time_dt: (updated_at)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN OPERATION_NAME IS NULL THEN 600300 WHEN OPERATION_NAME
      ILIKE ''%creation%'' THEN 600301 WHEN OPERATION_NAME ILIKE ''%read%'' THEN 600302
      WHEN OPERATION_NAME ILIKE ''%change%'' OR OPERATION_NAME ILIKE ''%update%''
      OR OPERATION_NAME ILIKE ''%edit%'' THEN 600303 WHEN OPERATION_NAME ILIKE ''%destruction%''
      OR OPERATION_NAME ILIKE ''%removal%'' OR OPERATION_NAME ILIKE ''%deletion%''
      THEN 600304 ELSE 600399 END)::NUMBER) WHEN 600300 THEN ''API Activity: Unknown''
      WHEN 600301 THEN ''API Activity: Create'' WHEN 600302 THEN ''API Activity: Read''
      WHEN 600303 THEN ''API Activity: Update'' WHEN 600304 THEN ''API Activity: Delete''
      WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN OPERATION_NAME IS NULL THEN 600300 WHEN OPERATION_NAME ILIKE
      '%creation%' THEN 600301 WHEN OPERATION_NAME ILIKE '%read%' THEN 600302 WHEN
      OPERATION_NAME ILIKE '%change%' OR OPERATION_NAME ILIKE '%update%' OR OPERATION_NAME
      ILIKE '%edit%' THEN 600303 WHEN OPERATION_NAME ILIKE '%destruction%' OR OPERATION_NAME
      ILIKE '%removal%' OR OPERATION_NAME ILIKE '%deletion%' THEN 600304 ELSE 600399
      END)::NUMBER
    unmapped: NULL::VARIANT
