type: mapping
id: twingate_network_logs_4001_network_activity_1.1.0
version: '1'
name: Twingate Network Logs to OCSF class Network Activity
data-types:
- twingate-network-logs
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN EVENT_STATUS = 'established_connection' THEN 1 WHEN EVENT_STATUS
      = 'closed_connection' THEN 2 WHEN EVENT_STATUS = 'failed_to_connect' THEN 4
      ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN EVENT_STATUS = 'established_connection' THEN
      1 WHEN EVENT_STATUS = 'closed_connection' THEN 2 WHEN EVENT_STATUS = 'failed_to_connect'
      THEN 4 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2
      THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (USER_EMAIL)::VARCHAR
    actor.user.uid: (USER_ID)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.provider: ('Twingate Network')::VARCHAR
    connection_info.protocol_name: (CONNECTION_PROTOCOL)::VARCHAR
    connection_info.protocol_num: (CASE WHEN CONNECTION_PROTOCOL = 'tcp' THEN 6 WHEN
      CONNECTION_PROTOCOL = 'udp' THEN 17 ELSE 99 END)::NUMBER
    connection_info.uid: (REMOTE_NETWORK_ID)::VARCHAR
    count: NULL::NUMBER
    device.uid: (DEVICE_ID)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.domain: (RESOURCE_APPLIED_RULE)::VARCHAR
    dst_endpoint.hostname: (RESOURCE_ADDRESS)::VARCHAR
    dst_endpoint.ip: (RESOURCE_IP)::VARCHAR
    dst_endpoint.port: (RESOURCE_PORT)::NUMBER
    dst_endpoint.uid: (RESOURCE_ID)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer.name: (CONNECTOR_NAME)::VARCHAR
    load_balancer.uid: (CONNECTOR_ID)::VARCHAR
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('twingate-network-logs')::VARCHAR
    metadata.product.vendor_name: ('twingate')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER_EMAIL)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (RESOURCE_ADDRESS)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RESOURCE_IP)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CONNECTION_CLIENT_IP)::VARCHAR
    - name: '''src_endpoint.proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (relays[0]:ip)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (CONNECTION_CLIENT_IP)::VARCHAR
    src_endpoint.location.coordinates: (ARRAY_CONSTRUCT_COMPACT(LOCATION_LAT, LOCATION_LON))::ARRAY
    src_endpoint.proxy_endpoint.ip: (relays[0]:ip)::VARCHAR
    src_endpoint.proxy_endpoint.name: (relays[0]:name)::VARCHAR
    src_endpoint.proxy_endpoint.port: (relays[0]:port)::NUMBER
    start_time: (date_part('epoch_milliseconds', (EVENT_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (EVENT_TIME)::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN EVENT_STATUS IN ('established_connection', 'closed_connection')
      THEN 1 WHEN EVENT_STATUS = 'failed_to_connect' THEN 2 ELSE 99 END::NUMBER) WHEN
      0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other'
      END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (EVENT_STATUS)::VARCHAR
    status_id: (CASE WHEN EVENT_STATUS IN ('established_connection', 'closed_connection')
      THEN 1 WHEN EVENT_STATUS = 'failed_to_connect' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes: (CONNECTION_BYTES_RECEIVED + CONNECTION_BYTES_TRANSFERRED)::NUMBER
    traffic.bytes_in: (CONNECTION_BYTES_RECEIVED)::NUMBER
    traffic.bytes_out: (CONNECTION_BYTES_TRANSFERRED)::NUMBER
    type_name: '(CASE ((400100 + (CASE WHEN EVENT_STATUS = ''established_connection''
      THEN 1 WHEN EVENT_STATUS = ''closed_connection'' THEN 2 WHEN EVENT_STATUS =
      ''failed_to_connect'' THEN 4 ELSE 99 END))::NUMBER) WHEN 400100 THEN ''Network
      Activity: Unknown'' WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102
      THEN ''Network Activity: Close'' WHEN 400103 THEN ''Network Activity: Reset''
      WHEN 400104 THEN ''Network Activity: Fail'' WHEN 400105 THEN ''Network Activity:
      Refuse'' WHEN 400106 THEN ''Network Activity: Traffic'' WHEN 400199 THEN ''Network
      Activity: Other'' END)::VARCHAR'
    type_uid: (400100 + (CASE WHEN EVENT_STATUS = 'established_connection' THEN 1
      WHEN EVENT_STATUS = 'closed_connection' THEN 2 WHEN EVENT_STATUS = 'failed_to_connect'
      THEN 4 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
