type: mapping
id: universal_wel_201003_win_resource_activity_1.1.0
version: '2'
name: Universal Wel to OCSF class Win/resource Activity
data-types:
- universal-wel
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (1)::NUMBER
    activity_name: (CASE ((1)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Access'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.file.name: (SPLIT_PART(COALESCE(RAW:ProcessName,RAW:ObjectName),
      '\\', -1))::VARCHAR
    actor.process.file.path: (COALESCE(RAW:ProcessName,RAW:ObjectName))::VARCHAR
    actor.process.name: (MESSAGE_DETAILS:process_information:process_name)::VARCHAR
    actor.process.pid: (TRY_TO_NUMBER(SUBSTR(MESSAGE_DETAILS:process_information:process_id::varchar,
      POSITION('x', MESSAGE_DETAILS:process_information:process_id::varchar) + 1),
      16))::NUMBER
    actor.user.account.name: (MESSAGE_DETAILS:subject:account_name)::VARCHAR
    actor.user.domain: (MESSAGE_DETAILS:subject:account_domain)::VARCHAR
    actor.user.uid: (MESSAGE_DETAILS:subject:security_id)::VARCHAR
    actor.user.uid_alt: (MESSAGE_DETAILS:subject:logon_id)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('win/resource_activity')::VARCHAR
    class_uid: ('201003')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (MACHINE_NAME)::VARCHAR
    device.ip: (MESSAGE_DETAILS:network_information:source_address)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (MESSAGE_DETAILS:message_title)::VARCHAR
    metadata.event_code: (event_id)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('universal-wel')::VARCHAR
    metadata.product.vendor_name: ('windows-event-log')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (SPLIT_PART(COALESCE(RAW:ProcessName,RAW:ObjectName), '\\', -1))::VARCHAR
    - name: '''actor.process.name'''
      type: '''Process Name'''
      type_id: 9
      reputation: null::VARIANT
      value: (MESSAGE_DETAILS:process_information:process_name)::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (MACHINE_NAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (MESSAGE_DETAILS:network_information:source_address)::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((CASE WHEN RAW:Severity = 'INFO' THEN 1 WHEN RAW:Severity IS
      NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN RAW:Severity = 'INFO' THEN 1 WHEN RAW:Severity IS NULL
      THEN 0 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN AUDIT_SUCCESS = 'TRUE' THEN 1 WHEN AUDIT_SUCCESS = 'FALSE'
      THEN 2 WHEN AUDIT_SUCCESS IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN AUDIT_SUCCESS = 'TRUE' THEN 1 WHEN AUDIT_SUCCESS = 'FALSE'
      THEN 2 WHEN AUDIT_SUCCESS IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((20100301)::NUMBER) WHEN 20100300 THEN ''Windows Resource Activity:
      Unknown'' WHEN 20100301 THEN ''Windows Resource Activity: Access'' WHEN 20100399
      THEN ''Windows Resource Activity: Other'' END)::VARCHAR'
    type_uid: (20100301)::NUMBER
    unmapped: NULL::VARIANT
    win_resource.details: (IFF(COALESCE(RAW:ResourceAttributes, MESSAGE_DETAILS:object:resource_attributes)
      = '-', NULL, COALESCE(RAW:ResourceAttributes, MESSAGE_DETAILS:object:resource_attributes)))::VARCHAR
    win_resource.name: (COALESCE(RAW:ObjectName, MESSAGE_DETAILS:object:object_name))::VARCHAR
    win_resource.svc_name: (COALESCE(RAW:ObjectServer, MESSAGE_DETAILS:object:object_server))::VARCHAR
    win_resource.type: (CASE ((CASE WHEN RAW:ObjectType = 'File' THEN 7 WHEN RAW:ObjectType
      = 'Key' THEN 25 WHEN RAW:ObjectType = 'Directory' THEN 1 WHEN RAW:ObjectType
      = 'Process' THEN 20 WHEN RAW:ObjectType = 'Unknown' OR RAW:ObjectType IS NULL
      THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Directory' WHEN
      10 THEN 'Section' WHEN 11 THEN 'WindowStation' WHEN 12 THEN 'DebugObject' WHEN
      13 THEN 'FilterCommunicationPort' WHEN 14 THEN 'EventPair' WHEN 15 THEN 'Driver'
      WHEN 16 THEN 'IoCompletion' WHEN 17 THEN 'Controller' WHEN 18 THEN 'SymbolicLink'
      WHEN 19 THEN 'WmiGuid' WHEN 2 THEN 'Event' WHEN 20 THEN 'Process' WHEN 21 THEN
      'Profile' WHEN 22 THEN 'Desktop' WHEN 23 THEN 'KeyedEvent' WHEN 24 THEN 'Adapter'
      WHEN 25 THEN 'Key' WHEN 26 THEN 'WaitablePort' WHEN 27 THEN 'Callback' WHEN
      28 THEN 'Semaphore' WHEN 29 THEN 'Job' WHEN 3 THEN 'Timer' WHEN 30 THEN 'Port'
      WHEN 31 THEN 'FilterConnectionPort' WHEN 32 THEN 'ALPC Port' WHEN 33 THEN 'SAM_ALIAS'
      WHEN 34 THEN 'SAM_GROUP' WHEN 35 THEN 'SAM_USER' WHEN 36 THEN 'SAM_DOMAIN' WHEN
      37 THEN 'SAM_SERVER' WHEN 4 THEN 'Device' WHEN 5 THEN 'Mutant' WHEN 6 THEN 'Type'
      WHEN 7 THEN 'File' WHEN 8 THEN 'Token' WHEN 9 THEN 'Thread' WHEN 99 THEN 'Other'
      END)::VARCHAR
    win_resource.type_id: (CASE WHEN RAW:ObjectType = 'File' THEN 7 WHEN RAW:ObjectType
      = 'Key' THEN 25 WHEN RAW:ObjectType = 'Directory' THEN 1 WHEN RAW:ObjectType
      = 'Process' THEN 20 WHEN RAW:ObjectType = 'Unknown' OR RAW:ObjectType IS NULL
      THEN 0 ELSE 99 END)::NUMBER
    win_resource.uid: (COALESCE(RAW:RAW:HandleId, MESSAGE_DETAILS:object:handle_id))::VARCHAR
  predicate: RAW:Category IN ('Handle Manipulation', 'Registry', 'Kernel Object',
    'File Share', 'File System', 'Other Object Access Events', 'PowerShell Named Pipe
    IPC', 'Directory Service Access')
