type: mapping
id: universal_wel_1001_file_activity_1.1.0
version: '10'
name: Universal Wel to OCSF class File Activity
data-types:
- universal-wel
mapping:
  fields:
    access_mask: NULL::NUMBER
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create'
      WHEN 10 THEN 'Encrypt' WHEN 11 THEN 'Decrypt' WHEN 12 THEN 'Mount' WHEN 13 THEN
      'Unmount' WHEN 14 THEN 'Open' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4
      THEN 'Delete' WHEN 5 THEN 'Rename' WHEN 6 THEN 'Set Attributes' WHEN 7 THEN
      'Set Security' WHEN 8 THEN 'Get Attributes' WHEN 9 THEN 'Get Security' WHEN
      99 THEN 'Other' END)::VARCHAR
    actor.process.pid: (TO_NUMBER(split_part(MESSAGE_DETAILS:process_information:process_id,'x',2),'XXXX'))::NUMBER
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('file_activity')::VARCHAR
    class_uid: ('1001')::NUMBER
    cloud: NULL::VARIANT
    component: NULL::VARCHAR
    connection_uid: NULL::VARCHAR
    count: NULL::NUMBER
    create_mask: NULL::VARCHAR
    device.ip: (RAW:MessageSourceAddress)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    file.path: (MESSAGE_DETAILS:process_information:process_name)::VARCHAR
    file_diff: NULL::VARCHAR
    file_result: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (RAW:message)::VARCHAR
    metadata.event_code: (event_id)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('universal-wel')::VARCHAR
    metadata.product.vendor_name: ('windows-event-log')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RAW:MessageSourceAddress)::VARCHAR
    - name: '''file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    raw_data: NULL::VARCHAR
    severity: (CASE ((CASE WHEN RAW:Severity = 'INFO' THEN 1 WHEN RAW:Severity IS
      NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN RAW:Severity = 'INFO' THEN 1 WHEN RAW:Severity IS NULL
      THEN 0 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN AUDIT_SUCCESS = TRUE THEN 1 WHEN AUDIT_SUCCESS = FALSE
      THEN 2 WHEN AUDIT_SUCCESS IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN AUDIT_SUCCESS = TRUE THEN 1 WHEN AUDIT_SUCCESS = FALSE THEN
      2 WHEN AUDIT_SUCCESS IS NULL THEN 0 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((100100)::NUMBER) WHEN 100100 THEN ''File System Activity:
      Unknown'' WHEN 100101 THEN ''File System Activity: Create'' WHEN 100102 THEN
      ''File System Activity: Read'' WHEN 100103 THEN ''File System Activity: Update''
      WHEN 100104 THEN ''File System Activity: Delete'' WHEN 100105 THEN ''File System
      Activity: Rename'' WHEN 100106 THEN ''File System Activity: Set Attributes''
      WHEN 100107 THEN ''File System Activity: Set Security'' WHEN 100108 THEN ''File
      System Activity: Get Attributes'' WHEN 100109 THEN ''File System Activity: Get
      Security'' WHEN 100110 THEN ''File System Activity: Encrypt'' WHEN 100111 THEN
      ''File System Activity: Decrypt'' WHEN 100112 THEN ''File System Activity: Mount''
      WHEN 100113 THEN ''File System Activity: Unmount'' WHEN 100114 THEN ''File System
      Activity: Open'' WHEN 100199 THEN ''File System Activity: Other'' END)::VARCHAR'
    type_uid: (100100)::NUMBER
    unmapped: NULL::VARIANT
  predicate: RAW:Category = 'File System'
