type: mapping
id: universal_wel_201002_win_registry_value_activity_1.1.0
version: '14'
name: Universal Wel to OCSF class Win/registry Value Activity
data-types:
- universal-wel
mapping:
  fields:
    action: (CASE ((CASE WHEN AUDIT_SUCCESS IS NULL THEN 0 WHEN AUDIT_SUCCESS = true
      THEN 1 WHEN AUDIT_SUCCESS = false THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN AUDIT_SUCCESS IS NULL THEN 0 WHEN AUDIT_SUCCESS = true THEN
      1 WHEN AUDIT_SUCCESS = false THEN 2 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN MESSAGE_DETAILS:object:operation_type IS NULL THEN 0 WHEN
      MESSAGE_DETAILS:object:operation_type ILIKE '%modified%' THEN 3 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN MESSAGE_DETAILS:object:operation_type IS NULL
      THEN 0 WHEN MESSAGE_DETAILS:object:operation_type ILIKE '%modified%' THEN 3
      ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Get' WHEN 2 THEN 'Set'
      WHEN 3 THEN 'Modify' WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.process.file.path: (MESSAGE_DETAILS:process_information:process_name)::VARCHAR
    actor.process.pid: (RAW:ExecutionProcessID)::NUMBER
    actor.process.tid: (RAW:ExecutionThreadID)::NUMBER
    actor.process.uid: (MESSAGE_DETAILS:process_information:process_id)::VARCHAR
    actor.user.account.name: (MESSAGE_DETAILS:subject:account_name)::VARCHAR
    actor.user.domain: (MESSAGE_DETAILS:subject:account_domain)::VARCHAR
    api: NULL::VARIANT
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((1)::NUMBER) WHEN 1 THEN 'System Activity' END)::VARCHAR
    category_uid: (1)::NUMBER
    class_name: ('win/registry_value_activity')::VARCHAR
    class_uid: ('201002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (MACHINE_NAME)::VARCHAR
    device.ip: (RAW:MessageSourceAddress)::VARCHAR
    disposition: (CASE ((99)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed'
      WHEN 10 THEN 'Exonerated' WHEN 11 THEN 'Corrected' WHEN 12 THEN 'Partially Corrected'
      WHEN 13 THEN 'Uncorrected' WHEN 14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN
      16 THEN 'No Action' WHEN 17 THEN 'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN
      'Alert' WHEN 2 THEN 'Blocked' WHEN 20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN
      22 THEN 'Captcha' WHEN 23 THEN 'Challenge' WHEN 24 THEN 'Access Revoked' WHEN
      25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized' WHEN 27 THEN 'Error' WHEN 3 THEN
      'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5 THEN 'Deleted' WHEN 6 THEN 'Dropped'
      WHEN 7 THEN 'Custom Action' WHEN 8 THEN 'Approved' WHEN 9 THEN 'Restored' WHEN
      99 THEN 'Other' END)::VARCHAR
    disposition_id: (99)::NUMBER
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (RAW:EventReceivedTime)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (RAW:EventReceivedTime)::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    malware: NULL::ARRAY
    message: (RAW:Message)::VARCHAR
    metadata.event_code: (event_id)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('universal-wel')::VARCHAR
    metadata.product.vendor_name: ('windows-event-log')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','security_control','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (MACHINE_NAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RAW:MessageSourceAddress)::VARCHAR
    prev_reg_value.type: (CASE ((CASE WHEN MESSAGE_DETAILS:change_information:old_value_type
      IS NULL THEN 0 WHEN MESSAGE_DETAILS:change_information:old_value_type = 'REG_SZ'
      THEN 10 WHEN MESSAGE_DETAILS:change_information:old_value_type = 'REG_DWORD'
      THEN 2 WHEN MESSAGE_DETAILS:change_information:old_value_type = 'REG_BINARY'
      THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'REG_BINARY'
      WHEN 10 THEN 'REG_SZ' WHEN 2 THEN 'REG_DWORD' WHEN 3 THEN 'REG_DWORD_BIG_ENDIAN'
      WHEN 4 THEN 'REG_EXPAND_SZ' WHEN 5 THEN 'REG_LINK' WHEN 6 THEN 'REG_MULTI_SZ'
      WHEN 7 THEN 'REG_NONE' WHEN 8 THEN 'REG_QWORD' WHEN 9 THEN 'REG_QWORD_LITTLE_ENDIAN'
      WHEN 99 THEN 'Other' END)::VARCHAR
    prev_reg_value.type_id: (CASE WHEN MESSAGE_DETAILS:change_information:old_value_type
      IS NULL THEN 0 WHEN MESSAGE_DETAILS:change_information:old_value_type = 'REG_SZ'
      THEN 10 WHEN MESSAGE_DETAILS:change_information:old_value_type = 'REG_DWORD'
      THEN 2 WHEN MESSAGE_DETAILS:change_information:old_value_type = 'REG_BINARY'
      THEN 1 ELSE 99 END)::NUMBER
    raw_data: NULL::VARCHAR
    reg_value.name: (MESSAGE_DETAILS:object:object_value_name)::VARCHAR
    reg_value.path: (MESSAGE_DETAILS:object:object_name)::VARCHAR
    reg_value.type: (CASE ((CASE WHEN MESSAGE_DETAILS:change_information:new_value_type
      IS NULL THEN 0 WHEN MESSAGE_DETAILS:change_information:new_value_type = 'REG_SZ'
      THEN 10 WHEN MESSAGE_DETAILS:change_information:new_value_type = 'REG_DWORD'
      THEN 2 WHEN MESSAGE_DETAILS:change_information:new_value_type = 'REG_BINARY'
      THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'REG_BINARY'
      WHEN 10 THEN 'REG_SZ' WHEN 2 THEN 'REG_DWORD' WHEN 3 THEN 'REG_DWORD_BIG_ENDIAN'
      WHEN 4 THEN 'REG_EXPAND_SZ' WHEN 5 THEN 'REG_LINK' WHEN 6 THEN 'REG_MULTI_SZ'
      WHEN 7 THEN 'REG_NONE' WHEN 8 THEN 'REG_QWORD' WHEN 9 THEN 'REG_QWORD_LITTLE_ENDIAN'
      WHEN 99 THEN 'Other' END)::VARCHAR
    reg_value.type_id: (CASE WHEN MESSAGE_DETAILS:change_information:new_value_type
      IS NULL THEN 0 WHEN MESSAGE_DETAILS:change_information:new_value_type = 'REG_SZ'
      THEN 10 WHEN MESSAGE_DETAILS:change_information:new_value_type = 'REG_DWORD'
      THEN 2 WHEN MESSAGE_DETAILS:change_information:new_value_type = 'REG_BINARY'
      THEN 1 ELSE 99 END)::NUMBER
    severity: (CASE ((CASE WHEN RAW:Severity IS NULL THEN 0 WHEN RAW:Severity = 'INFO'
      THEN 1 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (CASE WHEN RAW:Severity IS NULL THEN 0 WHEN RAW:Severity = 'INFO'
      THEN 1 ELSE 99 END)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN AUDIT_SUCCESS IS NULL THEN 0 WHEN AUDIT_SUCCESS = true
      THEN 1 WHEN AUDIT_SUCCESS = false THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: (CASE WHEN AUDIT_SUCCESS IS NULL THEN 0 WHEN AUDIT_SUCCESS = true THEN
      1 WHEN AUDIT_SUCCESS = false THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((20100200 + (CASE WHEN MESSAGE_DETAILS:object:operation_type
      IS NULL THEN 0 WHEN MESSAGE_DETAILS:object:operation_type ILIKE ''%modified%''
      THEN 3 ELSE 99 END))::NUMBER) WHEN 20100200 THEN ''Registry Value Activity:
      Unknown'' WHEN 20100201 THEN ''Registry Value Activity: Get'' WHEN 20100202
      THEN ''Registry Value Activity: Set'' WHEN 20100203 THEN ''Registry Value Activity:
      Modify'' WHEN 20100204 THEN ''Registry Value Activity: Delete'' WHEN 20100299
      THEN ''Registry Value Activity: Other'' END)::VARCHAR'
    type_uid: (20100200 + (CASE WHEN MESSAGE_DETAILS:object:operation_type IS NULL
      THEN 0 WHEN MESSAGE_DETAILS:object:operation_type ILIKE '%modified%' THEN 3
      ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: (RAW:Category = 'Registry' OR RAW:EventCategory::VARCHAR = '12801') AND
    EVENT_ID = 4657
