type: mapping
id: vectra_ndr_4001_network_activity_1.1.0
version: '12'
name: Vectra Ndr to OCSF class Network Activity
data-types:
- vectra-ndr
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN
      2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN
      6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.account.name: (ACCOUNT_NAME)::VARCHAR
    actor.user.account.uid: (ACCOUNT_ID)::VARCHAR
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('tactic', CASE EVENT_CATEGORY WHEN
      'COMMAND & CONTROL' THEN OBJECT_CONSTRUCT('name', 'Command and Control', 'src_url',
      'https://attack.mitre.org/versions/v15/tactics/TA0011/', 'uid', 'TA0011') WHEN
      'BOTNET ACTIVITY' THEN OBJECT_CONSTRUCT('name', 'Resource Development', 'src_url',
      'https://attack.mitre.org/versions/v15/tactics/TA0042/', 'uid', 'TA0042') WHEN
      'LATERAL MOVEMENT' THEN OBJECT_CONSTRUCT('name', 'Lateral Movement', 'src_url',
      'https://attack.mitre.org/versions/v15/tactics/TA0008/', 'uid', 'TA0008') WHEN
      'RECONNAISSANCE' THEN OBJECT_CONSTRUCT('name', 'Reconnaissance', 'src_url',
      'https://attack.mitre.org/versions/v15/tactics/TA0043/', 'uid', 'TA0043') WHEN
      'EXFILTRATION' THEN OBJECT_CONSTRUCT('name', 'Exfiltration', 'src_url', 'https://attack.mitre.org/versions/v15/tactics/TA0010/',
      'uid', 'TA0010') ELSE OBJECT_CONSTRUCT() END)))::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.protocol_name: (IFF(DETECTION_PROTOCOL IN ('icmp', 'tcp', 'udp',
      'rdp'), DETECTION_PROTOCOL, NULL))::VARCHAR
    connection_info.protocol_num: (CASE WHEN DETECTION_PROTOCOL = 'icmp' THEN 1 WHEN
      DETECTION_PROTOCOL = 'tcp' THEN 6 WHEN DETECTION_PROTOCOL = 'udp' THEN 17 WHEN
      DETECTION_PROTOCOL = 'rdp' THEN 27 ELSE NULL END)::NUMBER
    count: (GET(RAW, 'cnt'))::NUMBER
    device.risk_score: (THREAT)::NUMBER
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.hostname: (DESTINATION_DOMAIN_NAME)::VARCHAR
    dst_endpoint.ip: (DESTINATION_IP)::VARCHAR
    dst_endpoint.port: (DETECTION_DESTINATION_PORT)::NUMBER
    dst_endpoint.uid: (DESTINATION_HOST_ID)::VARCHAR
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (END_TIME)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (END_TIME)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (MESSAGE)::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('vectra-ndr')::VARCHAR
    metadata.product.vendor_name: ('vectra')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DESTINATION_DOMAIN_NAME)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP)::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SOURCE_HOST_NAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    - name: '''url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (PARSE_URL(VECTRA_URL):host)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((IFF(GET(RAW, 'severity') IS NULL, 0, IFF(SPLIT_PART(GET(RAW,
      'severity'), '.', 1) > 6, 99, SPLIT_PART(GET(RAW, 'severity'), '.', 1))))::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN
      'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN
      99 THEN 'Other' END)::VARCHAR
    severity_id: (IFF(GET(RAW, 'severity') IS NULL, 0, IFF(SPLIT_PART(GET(RAW, 'severity'),
      '.', 1) > 6, 99, SPLIT_PART(GET(RAW, 'severity'), '.', 1))))::NUMBER
    src_endpoint.hostname: (SOURCE_HOST_NAME)::VARCHAR
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    src_endpoint.uid: (SOURCE_HOST_ID)::VARCHAR
    start_time: (date_part('epoch_milliseconds', (START_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (START_TIME)::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', start_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (start_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes: (GET(RAW, 'in')::NUMBER + GET(RAW, 'out'))::NUMBER
    traffic.bytes_in: (GET(RAW, 'in'))::NUMBER
    traffic.bytes_out: (GET(RAW, 'out'))::NUMBER
    type_name: '(CASE ((400100)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown''
      WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity:
      Close'' WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network
      Activity: Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN
      ''Network Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400100)::NUMBER
    unmapped: NULL::VARIANT
    url.hostname: (PARSE_URL(VECTRA_URL):host)::VARCHAR
    url.path: (PARSE_URL(VECTRA_URL):path)::VARCHAR
    url.query_string: (PARSE_URL(VECTRA_URL):query)::VARCHAR
    url.scheme: (PARSE_URL(VECTRA_URL):scheme)::VARCHAR
  predicate: SOURCE_IP is not NULL AND EVENT_TYPE not in ('hsc', 'asc', 'lockdown',
    'host lockdown', 'campaigns', 'audit', 'health')
