type: mapping
id: vectra_audit_logs_6003_api_activity_1.1.0
version: '1'
name: Vectra Audit Logs to OCSF class Api Activity
data-types:
- vectra-audit-logs
mapping:
  fields:
    activity_id: (CASE EVENT_ACTION WHEN NULL THEN 0 WHEN 'created' THEN 1 WHEN 'updated'
      THEN 3 WHEN 'deleted' THEN 4 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE EVENT_ACTION WHEN NULL THEN 0 WHEN 'created' THEN 1
      WHEN 'updated' THEN 3 WHEN 'deleted' THEN 4 ELSE 99 END::NUMBER) WHEN 0 THEN
      'Unknown' WHEN 1 THEN 'Create' WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN
      4 THEN 'Delete' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.name: (COALESCE(USERNAME, EVENT_DATA:user:username))::VARCHAR
    actor.user.type: (CASE (CASE WHEN USER_ROLE = NULL THEN 0 WHEN USER_ROLE ILIKE
      '%Admin' THEN 2 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'User'
      WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.type_id: (CASE WHEN USER_ROLE = NULL THEN 0 WHEN USER_ROLE ILIKE '%Admin'
      THEN 2 ELSE 99 END)::NUMBER
    actor.user.uid: (USER_ID)::VARCHAR
    api.operation: (EVENT_ACTION)::VARCHAR
    api.request.uid: (API_CLIENT_ID)::VARCHAR
    api.response.data: (EVENT_DATA)::VARIANT
    api.response.message: (MESSAGE)::VARCHAR
    category_name: (CASE (6::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud.provider: ('Vectra')::VARCHAR
    count: NULL::NUMBER
    dst_endpoint: NULL::VARIANT
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request: NULL::VARIANT
    message: (MESSAGE)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('vectra-audit-logs')::VARCHAR
    metadata.product.vendor_name: ('vectra')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (COALESCE(USERNAME, EVENT_DATA:user:username))::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    raw_data: NULL::VARCHAR
    resources: NULL::ARRAY
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE (CASE WHEN RESULT_STATUS = 'success' THEN 1 ELSE 99 END::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (RESULT_STATUS)::VARCHAR
    status_id: (CASE WHEN RESULT_STATUS = 'success' THEN 1 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE (600300 + (CASE EVENT_ACTION WHEN NULL THEN 0 WHEN ''created''
      THEN 1 WHEN ''updated'' THEN 3 WHEN ''deleted'' THEN 4 ELSE 99 END)::NUMBER)
      WHEN 600300 THEN ''API Activity: Unknown'' WHEN 600301 THEN ''API Activity:
      Create'' WHEN 600302 THEN ''API Activity: Read'' WHEN 600303 THEN ''API Activity:
      Update'' WHEN 600304 THEN ''API Activity: Delete'' WHEN 600399 THEN ''API Activity:
      Other'' END)::VARCHAR'
    type_uid: (600300 + (CASE EVENT_ACTION WHEN NULL THEN 0 WHEN 'created' THEN 1
      WHEN 'updated' THEN 3 WHEN 'deleted' THEN 4 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: EVENT_ACTION IN ('created', 'deleted', 'updated')
