type: mapping
id: vectra_ndr_3002_authentication_1.1.0
version: '10'
name: Vectra Ndr to OCSF class Authentication
data-types:
- vectra-ndr
mapping:
  fields:
    activity_id: (CASE WHEN MESSAGE IS NULL THEN 0 WHEN MESSAGE  = 'log in' OR MESSAGE
      ILIKE '%logon%' THEN 1 WHEN MESSAGE ILIKE '%log out%' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN MESSAGE IS NULL THEN 0 WHEN MESSAGE  = 'log in'
      OR MESSAGE ILIKE '%logon%' THEN 1 WHEN MESSAGE ILIKE '%log out%' THEN 2 ELSE
      99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Logon' WHEN 2 THEN 'Logoff'
      WHEN 3 THEN 'Authentication Ticket' WHEN 4 THEN 'Service Ticket Request' WHEN
      5 THEN 'Service Ticket Renew' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    auth_protocol: NULL::VARCHAR
    auth_protocol_id: NULL::NUMBER
    category_name: (CASE ((3)::NUMBER) WHEN 3 THEN 'Identity & Access Management'
      END)::VARCHAR
    category_uid: (3)::NUMBER
    certificate: NULL::VARIANT
    class_name: ('authentication')::VARCHAR
    class_uid: ('3002')::NUMBER
    cloud: NULL::VARIANT
    count: NULL::NUMBER
    device.hostname: (GET(RAW, 'dvchost'))::VARCHAR
    device.ip: (GET(RAW, 'dvc'))::VARCHAR
    dst_endpoint.ip: (DESTINATION_IP)::VARCHAR
    dst_endpoint.port: (DETECTION_DESTINATION_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: (date_part('epoch_milliseconds', (END_TIME)::TIMESTAMP_LTZ))::NUMBER
    end_time_dt: (END_TIME)::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.url.url_string: (VECTRA_URL)::VARCHAR
    is_cleartext: NULL::BOOLEAN
    is_mfa: NULL::BOOLEAN
    is_new_logon: NULL::BOOLEAN
    is_remote: NULL::BOOLEAN
    logon_process: NULL::VARIANT
    logon_type: NULL::VARCHAR
    logon_type_id: NULL::NUMBER
    message: NULL::VARCHAR
    metadata.event_code: (event_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('vectra-ndr')::VARCHAR
    metadata.product.vendor_name: ('vectra')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (GET(RAW, 'dvchost'))::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (GET(RAW, 'dvc'))::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (DESTINATION_IP)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (VECTRA_URL)::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SOURCE_HOST_NAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SOURCE_IP)::VARCHAR
    - name: '''user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (ACTION_INITIATING_USER)::VARCHAR
    raw_data: NULL::VARCHAR
    service: NULL::VARIANT
    session: NULL::VARIANT
    severity: (CASE ((IFF(RAW:severity IS NULL, 0, RAW:severity))::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Informational' WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium'
      WHEN 4 THEN 'High' WHEN 5 THEN 'Critical' WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other'
      END)::VARCHAR
    severity_id: (IFF(RAW:severity IS NULL, 0, RAW:severity))::NUMBER
    src_endpoint.hostname: (SOURCE_HOST_NAME)::VARCHAR
    src_endpoint.ip: (SOURCE_IP)::VARCHAR
    start_time: (date_part('epoch_milliseconds', (START_TIME)::TIMESTAMP_LTZ))::NUMBER
    start_time_dt: (START_TIME)::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN AUDIT_ACTION_RESULT IS NULL THEN 0 WHEN AUDIT_ACTION_RESULT
      = 'success' THEN 1 WHEN AUDIT_ACTION_RESULT = 'failure' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (MESSAGE)::VARCHAR
    status_id: (CASE WHEN AUDIT_ACTION_RESULT IS NULL THEN 0 WHEN AUDIT_ACTION_RESULT
      = 'success' THEN 1 WHEN AUDIT_ACTION_RESULT = 'failure' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', start_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (start_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((CASE WHEN MESSAGE IS NULL THEN 300200 WHEN MESSAGE  = ''log
      in'' OR MESSAGE ILIKE ''%logon%'' THEN 300201 WHEN MESSAGE ILIKE ''%log out%''
      THEN 300202 ELSE 300299 END)::NUMBER) WHEN 300200 THEN ''Authentication: Unknown''
      WHEN 300201 THEN ''Authentication: Logon'' WHEN 300202 THEN ''Authentication:
      Logoff'' WHEN 300203 THEN ''Authentication: Authentication Ticket'' WHEN 300204
      THEN ''Authentication: Service Ticket Request'' WHEN 300205 THEN ''Authentication:
      Service Ticket Renew'' WHEN 300299 THEN ''Authentication: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN MESSAGE IS NULL THEN 300200 WHEN MESSAGE  = 'log in' OR MESSAGE
      ILIKE '%logon%' THEN 300201 WHEN MESSAGE ILIKE '%log out%' THEN 300202 ELSE
      300299 END)::NUMBER
    unmapped: NULL::VARIANT
    user.name: (ACTION_INITIATING_USER)::VARCHAR
    user.type: (CASE ((CASE WHEN AUDIT_INITIATE_ROLE IS NULL THEN 0 WHEN AUDIT_INITIATE_ROLE
      IN ('Security Analyst', 'r-vectra-poweruser') THEN 1 WHEN AUDIT_INITIATE_ROLE
      = 'Super Admin' THEN 2 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'User' WHEN 2 THEN 'Admin' WHEN 3 THEN 'System' WHEN 99 THEN 'Other' END)::VARCHAR
    user.type_id: (CASE WHEN AUDIT_INITIATE_ROLE IS NULL THEN 0 WHEN AUDIT_INITIATE_ROLE
      IN ('Security Analyst', 'r-vectra-poweruser') THEN 1 WHEN AUDIT_INITIATE_ROLE
      = 'Super Admin' THEN 2 ELSE 99 END)::NUMBER
  predicate: MESSAGE  = 'log in' OR MESSAGE ILIKE '%logon%' OR MESSAGE ILIKE '%log
    out%'
