type: mapping
id: very_good_security_events_6003_api_activity_1.1.0
version: '9'
name: Very Good Security Events to OCSF class Api Activity
data-types:
- very-good-security-events
mapping:
  fields:
    activity_id: (0)::NUMBER
    activity_name: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Create'
      WHEN 2 THEN 'Read' WHEN 3 THEN 'Update' WHEN 4 THEN 'Delete' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.process.file.hashes: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('algorithm',
      'SHA-256', 'algorithm_id', 3, 'value', FINGERPRINT)))::ARRAY
    actor.user.groups: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', GROUPING)))::ARRAY
    actor.user.org.uid: (ORG_ID)::VARCHAR
    api.response.error: (UPSTREAM_ERROR)::VARCHAR
    api.response.message: (SUMMARY)::VARCHAR
    category_name: (CASE ((6)::NUMBER) WHEN 6 THEN 'Application Activity' END)::VARCHAR
    category_uid: (6)::NUMBER
    class_name: ('api_activity')::VARCHAR
    class_uid: ('6003')::NUMBER
    cloud.org.uid: (TENANT)::VARCHAR
    count: (OCCURRENCE)::NUMBER
    dst_endpoint.hostname: (SPLIT_PART(UPSTREAM_HOST, ':', 1))::VARCHAR
    dst_endpoint.port: (SPLIT_PART(UPSTREAM_HOST, ':', 2))::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    http_request.url.hostname: (SPLIT_PART(UPSTREAM_HOST, ':', 1))::VARCHAR
    http_request.url.port: (SPLIT_PART(UPSTREAM_HOST, ':', 2))::NUMBER
    http_request.url.scheme: (APPLICATION_PROTOCOL)::VARCHAR
    message: (DESCRIPTION)::VARCHAR
    metadata.event_code: (event)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('very-good-security-events')::VARCHAR
    metadata.product.vendor_name: ('very_good_security')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.process'''
      type: '''Process'''
      type_id: 25
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.process.file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SPLIT_PART(UPSTREAM_HOST, ':', 1))::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SPLIT_PART(UPSTREAM_HOST, ':', 1))::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (SPLIT_PART(UPSTREAM_HOST, ':', 1))::VARCHAR
    raw_data: NULL::VARCHAR
    resources: NULL::ARRAY
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.hostname: (SPLIT_PART(UPSTREAM_HOST, ':', 1))::VARCHAR
    src_endpoint.port: (SPLIT_PART(UPSTREAM_HOST, ':', 2))::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((CASE WHEN EVENT IS NULL THEN 0 WHEN EVENT ILIKE '%success%' THEN
      1 WHEN EVENT ILIKE '%failed%' OR EVENT ILIKE '%error%' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN 2 THEN 'Failure' WHEN 99 THEN
      'Other' END)::VARCHAR
    status_code: (UPSTREAM_ERROR)::VARCHAR
    status_detail: (SUMMARY)::VARCHAR
    status_id: (CASE WHEN EVENT IS NULL THEN 0 WHEN EVENT ILIKE '%success%' THEN 1
      WHEN EVENT ILIKE '%failed%' OR EVENT ILIKE '%error%' THEN 2 ELSE 99 END)::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    type_name: '(CASE ((600300)::NUMBER) WHEN 600300 THEN ''API Activity: Unknown''
      WHEN 600301 THEN ''API Activity: Create'' WHEN 600302 THEN ''API Activity: Read''
      WHEN 600303 THEN ''API Activity: Update'' WHEN 600304 THEN ''API Activity: Delete''
      WHEN 600399 THEN ''API Activity: Other'' END)::VARCHAR'
    type_uid: (600300)::NUMBER
    unmapped: NULL::VARIANT
