type: mapping
id: zeek_logs_4001_network_activity_1.1.0
version: '1'
name: Zeek Logs to OCSF class Network Activity
data-types:
- zeek-logs
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN RAW:conn_state LIKE ANY ('S1','SF') THEN 1 WHEN RAW:conn_state
      LIKE ANY ('S2','S3') THEN 2 WHEN RAW:conn_state LIKE ANY ('RSTO','RSTR','RSTOS0','RSTRH')
      THEN 3 WHEN RAW:conn_state='REJ' THEN 5 WHEN RAW:conn_state='OTH' THEN 6 WHEN
      RAW:conn_state IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN RAW:conn_state LIKE ANY ('S1','SF') THEN 1 WHEN
      RAW:conn_state LIKE ANY ('S2','S3') THEN 2 WHEN RAW:conn_state LIKE ANY ('RSTO','RSTR','RSTOS0','RSTRH')
      THEN 3 WHEN RAW:conn_state='REJ' THEN 5 WHEN RAW:conn_state='OTH' THEN 6 WHEN
      RAW:conn_state IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN
      1 THEN 'Open' WHEN 2 THEN 'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN
      5 THEN 'Refuse' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api.service.name: (SERVICE)::VARCHAR
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud.provider: ('Zeek')::VARCHAR
    connection_info.protocol_name: (PROTOCOL)::VARCHAR
    connection_info.protocol_num: (CASE WHEN PROTOCOL='icmp' THEN 1 WHEN PROTOCOL='tcp'
      THEN 6 WHEN PROTOCOL='udp' THEN 17 END)::NUMBER
    count: NULL::NUMBER
    device: NULL::VARIANT
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (RESPONDER_HOST)::VARCHAR
    dst_endpoint.name: (RAW:server_name)::VARCHAR
    dst_endpoint.port: (RESPONDER_PORT)::NUMBER
    duration: (DURATION)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (log_type)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('zeek-logs')::VARCHAR
    metadata.product.vendor_name: ('zeek')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RESPONDER_HOST)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (ORIGINATOR_HOST)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (ORIGINATOR_HOST)::VARCHAR
    src_endpoint.port: (ORIGINATOR_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (COALESCE(RAW:conn_state, RAW:validation_status))::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls.certificate_chain: (RAW:cert_chain_fps)::ARRAY
    tls.cipher: (RAW:cipher)::VARCHAR
    tls.client_ciphers: (RAW:client_cert_chain_fps)::ARRAY
    traffic.bytes: (ORIGINATOR_BYTES + RESPONDER_BYTES)::NUMBER
    traffic.bytes_in: (RESPONDER_BYTES)::NUMBER
    traffic.bytes_out: (ORIGINATOR_BYTES)::NUMBER
    traffic.packets: (ORIGINATOR_PACKETS + RESPONDER_PACKETS)::NUMBER
    traffic.packets_in: (RESPONDER_PACKETS)::NUMBER
    traffic.packets_out: (ORIGINATOR_PACKETS)::NUMBER
    type_name: '(CASE (400100+(CASE WHEN RAW:conn_state LIKE ANY (''S1'',''SF'') THEN
      1 WHEN RAW:conn_state LIKE ANY (''S2'',''S3'') THEN 2 WHEN RAW:conn_state LIKE
      ANY (''RSTO'',''RSTR'',''RSTOS0'',''RSTRH'') THEN 3 WHEN RAW:conn_state=''REJ''
      THEN 5 WHEN RAW:conn_state=''OTH'' THEN 6 WHEN RAW:conn_state IS NULL THEN 0
      ELSE 99 END)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown'' WHEN 400101
      THEN ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity: Close''
      WHEN 400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network Activity:
      Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN ''Network
      Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (400100+(CASE WHEN RAW:conn_state LIKE ANY ('S1','SF') THEN 1 WHEN RAW:conn_state
      LIKE ANY ('S2','S3') THEN 2 WHEN RAW:conn_state LIKE ANY ('RSTO','RSTR','RSTOS0','RSTRH')
      THEN 3 WHEN RAW:conn_state='REJ' THEN 5 WHEN RAW:conn_state='OTH' THEN 6 WHEN
      RAW:conn_state IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
  predicate: LOG_TYPE LIKE ANY ('conn.log','ssl.log', 'snmp.log')
