type: mapping
id: zeek_logs_4006_smb_activity_1.1.0
version: '1'
name: Zeek Logs to OCSF class Smb Activity
data-types:
- zeek-logs
mapping:
  fields:
    action: (CASE (CASE WHEN RAW:action IS NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0
      THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other'
      END)::VARCHAR
    action_id: (CASE WHEN RAW:action IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN RAW:action='SMB::FILE_OPEN' THEN 2 WHEN RAW:action IS
      NULL THEN 0 ELSE 99 END)::NUMBER
    activity_name: (CASE (CASE WHEN RAW:action='SMB::FILE_OPEN' THEN 2 WHEN RAW:action
      IS NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'File
      Supersede' WHEN 2 THEN 'File Open' WHEN 3 THEN 'File Create' WHEN 4 THEN 'File
      Open If' WHEN 5 THEN 'File Overwrite' WHEN 6 THEN 'File Overwrite If' WHEN 99
      THEN 'Other' END)::VARCHAR
    actor: NULL::VARIANT
    api: NULL::VARIANT
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE (4::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('smb_activity')::VARCHAR
    class_uid: ('4006')::NUMBER
    client_dialects: NULL::ARRAY
    cloud: NULL::VARIANT
    command: NULL::VARCHAR
    connection_info: NULL::VARIANT
    count: NULL::NUMBER
    dce_rpc: NULL::VARIANT
    device: NULL::VARIANT
    dialect: NULL::VARCHAR
    disposition: (CASE (CASE WHEN RAW:action='SMB::FILE_DELETE' THEN 5 WHEN RAW:action
      IS NULL THEN 0 ELSE 99 END::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed'
      WHEN 10 THEN 'Exonerated' WHEN 11 THEN 'Corrected' WHEN 12 THEN 'Partially Corrected'
      WHEN 13 THEN 'Uncorrected' WHEN 14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN
      16 THEN 'No Action' WHEN 17 THEN 'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN
      'Alert' WHEN 2 THEN 'Blocked' WHEN 20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN
      22 THEN 'Captcha' WHEN 23 THEN 'Challenge' WHEN 24 THEN 'Access Revoked' WHEN
      25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized' WHEN 27 THEN 'Error' WHEN 3 THEN
      'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5 THEN 'Deleted' WHEN 6 THEN 'Dropped'
      WHEN 7 THEN 'Custom Action' WHEN 8 THEN 'Approved' WHEN 9 THEN 'Restored' WHEN
      99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN RAW:action='SMB::FILE_DELETE' THEN 5 WHEN RAW:action
      IS NULL THEN 0 ELSE 99 END)::NUMBER
    dst_endpoint.ip: (RESPONDER_HOST)::VARCHAR
    dst_endpoint.port: (RESPONDER_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    file.accessed_time: (date_part('epoch_milliseconds', RAW:"times.accessed"::TIMESTAMP_LTZ))::NUMBER
    file.accessed_time_dt: (RAW:"times.accessed")::TIMESTAMP_LTZ
    file.created_time: (date_part('epoch_milliseconds', RAW:"times.created"::TIMESTAMP_LTZ))::NUMBER
    file.created_time_dt: (RAW:"times.created")::TIMESTAMP_LTZ
    file.modified_time: (date_part('epoch_milliseconds', RAW:"times.modified"::TIMESTAMP_LTZ))::NUMBER
    file.modified_time_dt: (RAW:"times.modified")::TIMESTAMP_LTZ
    file.name: (RAW:name)::VARCHAR
    file.path: (RAW:path)::VARCHAR
    file.size: (RAW:size)::NUMBER
    firewall_rule: NULL::VARIANT
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.event_code: (log_type)::VARCHAR
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('zeek-logs')::VARCHAR
    metadata.product.vendor_name: ('zeek')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    observables:
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (RESPONDER_HOST)::VARCHAR
    - name: '''file'''
      type: '''File'''
      type_id: 24
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''file.name'''
      type: '''File Name'''
      type_id: 7
      reputation: null::VARIANT
      value: (RAW:name)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (ORIGINATOR_HOST)::VARCHAR
    open_type: NULL::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    response: NULL::VARIANT
    severity: (CASE (0::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    share: NULL::VARCHAR
    share_type: NULL::VARCHAR
    share_type_id: NULL::NUMBER
    src_endpoint.ip: (ORIGINATOR_HOST)::VARCHAR
    src_endpoint.port: (ORIGINATOR_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    tree_uid: NULL::VARCHAR
    type_name: '(CASE (400600+(CASE WHEN RAW:action=''SMB::FILE_OPEN'' THEN 2 WHEN
      RAW:action IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 400600 THEN ''SMB Activity:
      Unknown'' WHEN 400601 THEN ''SMB Activity: File Supersede'' WHEN 400602 THEN
      ''SMB Activity: File Open'' WHEN 400603 THEN ''SMB Activity: File Create'' WHEN
      400604 THEN ''SMB Activity: File Open If'' WHEN 400605 THEN ''SMB Activity:
      File Overwrite'' WHEN 400606 THEN ''SMB Activity: File Overwrite If'' WHEN 400699
      THEN ''SMB Activity: Other'' END)::VARCHAR'
    type_uid: (400600+(CASE WHEN RAW:action='SMB::FILE_OPEN' THEN 2 WHEN RAW:action
      IS NULL THEN 0 ELSE 99 END))::NUMBER
    unmapped: NULL::VARIANT
  predicate: LOG_TYPE = 'smb_files.log'
