type: mapping
id: zscaler_zia_firewall_4001_network_activity_1.1.0
version: '11'
name: Zscaler Zia Firewall to OCSF class Network Activity
data-types:
- zscaler-zia-firewall
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION ILIKE '%Allow%' THEN 1 WHEN ACTION ILIKE '%Drop%'
      THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION ILIKE '%Allow%' THEN 1 WHEN ACTION ILIKE '%Drop%'
      THEN 2 WHEN ACTION IS NULL THEN 0 ELSE 99 END)::NUMBER
    activity_id: (CASE WHEN ACTION ILIKE '%Allow%' THEN 1 WHEN ACTION ILIKE '%Drop%'
      THEN 2 WHEN ACTION ILIKE '%Reset%' THEN 3 WHEN ACTION IS NULL THEN 0 ELSE 99
      END)::NUMBER
    activity_name: (CASE ((CASE WHEN ACTION ILIKE '%Allow%' THEN 1 WHEN ACTION ILIKE
      '%Drop%' THEN 2 WHEN ACTION ILIKE '%Reset%' THEN 3 WHEN ACTION IS NULL THEN
      0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2 THEN
      'Close' WHEN 3 THEN 'Reset' WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN 6 THEN
      'Traffic' WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (USER)::VARCHAR
    actor.user.name: (DEVICE_OWNER)::VARCHAR
    api: NULL::VARIANT
    app_name: (NETWORK_APPLICATION)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.protocol_name: (LOWER(PROTOCOL))::VARCHAR
    connection_info.protocol_num: (CASE WHEN PROTOCOL='UDP' THEN 17 WHEN PROTOCOL='TCP'
      THEN 6 ELSE -1 END)::NUMBER
    connection_info.session.count: (NUMBER_OF_SESSIONS)::NUMBER
    count: NULL::NUMBER
    device.hostname: (DEVICE_HOSTNAME)::VARCHAR
    device.location.desc: (LOCATION_NAME)::VARCHAR
    disposition: (CASE ((CASE WHEN ACTION ILIKE '%Allow%' THEN 1 WHEN ACTION ILIKE
      '%Drop%' THEN 6 WHEN ACTION ILIKE '%Reset%' THEN 21 WHEN ACTION IS NULL THEN
      0 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 10
      THEN 'Exonerated' WHEN 11 THEN 'Corrected' WHEN 12 THEN 'Partially Corrected'
      WHEN 13 THEN 'Uncorrected' WHEN 14 THEN 'Delayed' WHEN 15 THEN 'Detected' WHEN
      16 THEN 'No Action' WHEN 17 THEN 'Logged' WHEN 18 THEN 'Tagged' WHEN 19 THEN
      'Alert' WHEN 2 THEN 'Blocked' WHEN 20 THEN 'Count' WHEN 21 THEN 'Reset' WHEN
      22 THEN 'Captcha' WHEN 23 THEN 'Challenge' WHEN 24 THEN 'Access Revoked' WHEN
      25 THEN 'Rejected' WHEN 26 THEN 'Unauthorized' WHEN 27 THEN 'Error' WHEN 3 THEN
      'Quarantined' WHEN 4 THEN 'Isolated' WHEN 5 THEN 'Deleted' WHEN 6 THEN 'Dropped'
      WHEN 7 THEN 'Custom Action' WHEN 8 THEN 'Approved' WHEN 9 THEN 'Restored' WHEN
      99 THEN 'Other' END)::VARCHAR
    disposition_id: (CASE WHEN ACTION ILIKE '%Allow%' THEN 1 WHEN ACTION ILIKE '%Drop%'
      THEN 6 WHEN ACTION ILIKE '%Reset%' THEN 21 WHEN ACTION IS NULL THEN 0 ELSE 99
      END)::NUMBER
    dst_endpoint.ip: (COALESCE(CLIENT_DESTINATION_IP, SERVER_DESTINATION_IP))::VARCHAR
    dst_endpoint.location.country: (DESTINATION_COUNTRY)::VARCHAR
    dst_endpoint.port: (COALESCE(CLIENT_DESTINATION_PORT, SERVER_DESTINATION_PORT))::NUMBER
    duration: (DURATION_IN_MS)::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.name: (RULE_LABEL)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: (ARRAY_CONSTRUCT(OBJECT_CONSTRUCT('classification_ids', CASE WHEN THREAT_CATEGORY
      IS NULL THEN 0 ELSE 99 END, 'classifications', THREAT_CATEGORY, 'name', THREAT_NAME)))::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('zscaler-zia-firewall')::VARCHAR
    metadata.product.vendor_name: ('zscaler')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (DEVICE_OWNER)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DEVICE_HOSTNAME)::VARCHAR
    - name: '''device.location'''
      type: '''Geo Location'''
      type_id: 26
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(CLIENT_DESTINATION_IP, SERVER_DESTINATION_IP))::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (COALESCE(CLIENT_SOURCE_IP, SERVER_SOURCE_IP))::VARCHAR
    - name: '''src_endpoint.proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (TUNNEL_SOURCE_IP)::VARCHAR
    proxy.port: (TUNNEL_SOURCE_PORT)::NUMBER
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (COALESCE(CLIENT_SOURCE_IP, SERVER_SOURCE_IP))::VARCHAR
    src_endpoint.port: (COALESCE(CLIENT_SOURCE_PORT, SERVER_SOURCE_PORT))::NUMBER
    src_endpoint.proxy_endpoint.ip: (TUNNEL_SOURCE_IP)::VARCHAR
    src_endpoint.proxy_endpoint.port: (TUNNEL_SOURCE_PORT)::NUMBER
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes_in: (IN_BYTES)::NUMBER
    traffic.bytes_out: (OUT_BYTES)::NUMBER
    type_name: '(CASE ((CASE WHEN ACTION ILIKE ''%Allow%'' THEN 400101 WHEN ACTION
      ILIKE ''%Drop%'' THEN 400102 WHEN ACTION ILIKE ''%Reset%'' THEN 400103 WHEN
      ACTION IS NULL THEN 400100 ELSE 400199 END)::NUMBER) WHEN 400100 THEN ''Network
      Activity: Unknown'' WHEN 400101 THEN ''Network Activity: Open'' WHEN 400102
      THEN ''Network Activity: Close'' WHEN 400103 THEN ''Network Activity: Reset''
      WHEN 400104 THEN ''Network Activity: Fail'' WHEN 400105 THEN ''Network Activity:
      Refuse'' WHEN 400106 THEN ''Network Activity: Traffic'' WHEN 400199 THEN ''Network
      Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN ACTION ILIKE '%Allow%' THEN 400101 WHEN ACTION ILIKE '%Drop%'
      THEN 400102 WHEN ACTION ILIKE '%Reset%' THEN 400103 WHEN ACTION IS NULL THEN
      400100 ELSE 400199 END)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
