type: mapping
id: zscaler_zpa_user_activity_4001_network_activity_1.1.0
version: '10'
name: Zscaler Zpa User Activity to OCSF class Network Activity
data-types:
- zscaler-zpa-user-activity
mapping:
  fields:
    action: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Allowed' WHEN 2
      THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (0)::NUMBER
    activity_id: (CASE WHEN CONNECTION_STATUS IS NULL THEN 0 WHEN CONNECTION_STATUS
      = 'open' THEN 1 WHEN CONNECTION_STATUS = 'close' THEN 2 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN CONNECTION_STATUS IS NULL THEN 0 WHEN CONNECTION_STATUS
      = 'open' THEN 1 WHEN CONNECTION_STATUS = 'close' THEN 2 ELSE 99 END)::NUMBER)
      WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Open' WHEN 2 THEN 'Close' WHEN 3 THEN 'Reset'
      WHEN 4 THEN 'Fail' WHEN 5 THEN 'Refuse' WHEN 6 THEN 'Traffic' WHEN 99 THEN 'Other'
      END)::VARCHAR
    actor.idp.name: (IDP)::VARCHAR
    actor.user.email_addr: (USER_NAME)::VARCHAR
    api: NULL::VARIANT
    app_name: (APPLICATION)::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('network_activity')::VARCHAR
    class_uid: ('4001')::NUMBER
    cloud: NULL::VARIANT
    connection_info.protocol_num: (IP_PROTOCOL)::NUMBER
    connection_info.session.uid: (SESSION_ID)::VARCHAR
    connection_info.uid: (CONNECTION_ID)::VARCHAR
    count: NULL::NUMBER
    device.hostname: (HOST)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.ip: (SERVER_IP)::VARCHAR
    dst_endpoint.port: (SERVER_PORT)::NUMBER
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::ARRAY
    firewall_rule.name: (POLICY)::VARCHAR
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: (INTERNAL_REASON)::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('zscaler-zpa-user-activity')::VARCHAR
    metadata.product.vendor_name: ('zscaler')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER_NAME)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOST)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SERVER_IP)::VARCHAR
    - name: '''proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CONNECTOR_IP)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_PRIVATE_IP)::VARCHAR
    - name: '''src_endpoint.proxy_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_PUBLIC_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint.ip: (CONNECTOR_IP)::VARCHAR
    proxy_endpoint.name: (CONNECTOR)::VARCHAR
    proxy_endpoint.port: (CONNECTOR_PORT)::NUMBER
    proxy_endpoint.zone: (CONNECTOR_ZEN)::VARCHAR
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: (CASE ((0)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Informational'
      WHEN 2 THEN 'Low' WHEN 3 THEN 'Medium' WHEN 4 THEN 'High' WHEN 5 THEN 'Critical'
      WHEN 6 THEN 'Fatal' WHEN 99 THEN 'Other' END)::VARCHAR
    severity_id: (0)::NUMBER
    src_endpoint.ip: (CLIENT_PRIVATE_IP)::VARCHAR
    src_endpoint.location.country: (CLIENT_COUNTRY_CODE)::VARCHAR
    src_endpoint.name: (CLIENT_ZEN)::VARCHAR
    src_endpoint.proxy_endpoint.ip: (CLIENT_PUBLIC_IP)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: NULL::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: NULL::VARCHAR
    status_id: NULL::NUMBER
    time: (date_part('epoch_milliseconds', log_timestamp::TIMESTAMP_LTZ))::NUMBER
    time_dt: (log_timestamp)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic: NULL::VARIANT
    type_name: '(CASE ((CASE WHEN CONNECTION_STATUS IS NULL THEN 400100 WHEN CONNECTION_STATUS
      = ''open'' THEN 400101 WHEN CONNECTION_STATUS = ''close'' THEN 400102 ELSE 400199
      END)::NUMBER) WHEN 400100 THEN ''Network Activity: Unknown'' WHEN 400101 THEN
      ''Network Activity: Open'' WHEN 400102 THEN ''Network Activity: Close'' WHEN
      400103 THEN ''Network Activity: Reset'' WHEN 400104 THEN ''Network Activity:
      Fail'' WHEN 400105 THEN ''Network Activity: Refuse'' WHEN 400106 THEN ''Network
      Activity: Traffic'' WHEN 400199 THEN ''Network Activity: Other'' END)::VARCHAR'
    type_uid: (CASE WHEN CONNECTION_STATUS IS NULL THEN 400100 WHEN CONNECTION_STATUS
      = 'open' THEN 400101 WHEN CONNECTION_STATUS = 'close' THEN 400102 ELSE 400199
      END)::NUMBER
    unmapped: NULL::VARIANT
    url: NULL::VARIANT
