type: mapping
id: zscaler_zia_4002_http_activity_1.1.0
version: '17'
name: Zscaler Zia to OCSF class Http Activity
data-types:
- zscaler-zia
mapping:
  fields:
    action: (CASE ((CASE WHEN ACTION = 'Allowed' THEN 1 WHEN ACTION = 'Blocked' THEN
      2 WHEN ACTION is not null THEN 99 ELSE 0 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Allowed' WHEN 2 THEN 'Denied' WHEN 99 THEN 'Other' END)::VARCHAR
    action_id: (CASE WHEN ACTION = 'Allowed' THEN 1 WHEN ACTION = 'Blocked' THEN 2
      WHEN ACTION is not null THEN 99 ELSE 0 END)::NUMBER
    activity_id: (CASE WHEN REQUEST_METHOD is null THEN 0 WHEN REQUEST_METHOD = 'CONNECT'
      THEN 1 WHEN REQUEST_METHOD = 'DELETE' THEN 2 WHEN REQUEST_METHOD = 'GET' THEN
      3 WHEN REQUEST_METHOD = 'HEAD' THEN 4 WHEN REQUEST_METHOD = 'OPTIONS' THEN 5
      WHEN REQUEST_METHOD = 'POST' THEN 6 WHEN REQUEST_METHOD = 'PUT' THEN 7 WHEN
      REQUEST_METHOD = 'TRACE' THEN 8 ELSE 99 END)::NUMBER
    activity_name: (CASE ((CASE WHEN REQUEST_METHOD is null THEN 0 WHEN REQUEST_METHOD
      = 'CONNECT' THEN 1 WHEN REQUEST_METHOD = 'DELETE' THEN 2 WHEN REQUEST_METHOD
      = 'GET' THEN 3 WHEN REQUEST_METHOD = 'HEAD' THEN 4 WHEN REQUEST_METHOD = 'OPTIONS'
      THEN 5 WHEN REQUEST_METHOD = 'POST' THEN 6 WHEN REQUEST_METHOD = 'PUT' THEN
      7 WHEN REQUEST_METHOD = 'TRACE' THEN 8 ELSE 99 END)::NUMBER) WHEN 0 THEN 'Unknown'
      WHEN 1 THEN 'Connect' WHEN 2 THEN 'Delete' WHEN 3 THEN 'Get' WHEN 4 THEN 'Head'
      WHEN 5 THEN 'Options' WHEN 6 THEN 'Post' WHEN 7 THEN 'Put' WHEN 8 THEN 'Trace'
      WHEN 99 THEN 'Other' END)::VARCHAR
    actor.user.email_addr: (USER)::VARCHAR
    actor.user.name: (USER)::VARCHAR
    api.operation: (REQUEST_METHOD)::VARCHAR
    api.request.uid: (EVENT_ID)::VARCHAR
    api.response.code: (STATUS)::NUMBER
    app_name: NULL::VARCHAR
    attacks: NULL::ARRAY
    authorizations: NULL::ARRAY
    category_name: (CASE ((4)::NUMBER) WHEN 4 THEN 'Network Activity' END)::VARCHAR
    category_uid: (4)::NUMBER
    class_name: ('http_activity')::VARCHAR
    class_uid: ('4002')::NUMBER
    cloud: NULL::VARIANT
    connection_info.direction: (CASE ((2)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN
      'Inbound' WHEN 2 THEN 'Outbound' WHEN 3 THEN 'Lateral' WHEN 99 THEN 'Other'
      END)::VARCHAR
    connection_info.direction_id: (2)::NUMBER
    count: NULL::NUMBER
    device.hostname: (DEVICE_HOSTNAME)::VARCHAR
    device.ip: (CLIENT_IP)::VARCHAR
    disposition: NULL::VARCHAR
    disposition_id: NULL::NUMBER
    dst_endpoint.hostname: (HOSTNAME)::VARCHAR
    dst_endpoint.ip: (SERVER_IP)::VARCHAR
    duration: NULL::NUMBER
    end_time: NULL::NUMBER
    end_time_dt: NULL::TIMESTAMP_LTZ
    enrichments: NULL::VARIANT
    firewall_rule: NULL::VARIANT
    http_cookies: NULL::VARIANT
    http_request.http_method: (REQUEST_METHOD)::VARCHAR
    http_request.length: (REQUEST_SIZE)::NUMBER
    http_request.referrer: (REFERER_URL)::VARCHAR
    http_request.uid: (EVENT_ID)::VARCHAR
    http_request.url.hostname: (HOSTNAME)::VARCHAR
    http_request.url.path: (iff(TRIM(TRIM(URL,HOSTNAME),':443') = '',null,TRIM(TRIM(URL,HOSTNAME),':443')))::VARCHAR
    http_request.url.port: (CASE WHEN contains(url,':443') THEN 443::NUMBER END)::NUMBER
    http_request.url.query_string: (iff(contains(url,'?'), SPLIT_PART(url,'?',-1)::VARCHAR,null))::VARCHAR
    http_request.url.url_string: (URL)::VARCHAR
    http_request.user_agent: (USER_AGENT)::VARCHAR
    http_request.version: (REQUEST_VERSION)::VARCHAR
    http_response.code: (STATUS)::NUMBER
    http_response.content_type: (CONTENT_TYPE)::VARCHAR
    http_status: NULL::NUMBER
    load_balancer: NULL::VARIANT
    malware: NULL::ARRAY
    message: NULL::VARCHAR
    metadata.extensions: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('name', 'windows',
      'version', '2', 'uid', '1.1.0'))
    metadata.loggers: ARRAY_CONSTRUCT(OBJECT_CONSTRUCT_KEEP_NULL('version', metadata$dataflow_id))
    metadata.processed_time: (date_part('epoch_milliseconds', metadata$insertion_time::TIMESTAMP_LTZ))::NUMBER
    metadata.processed_time_dt: (metadata$insertion_time)::TIMESTAMP_LTZ
    metadata.product.name: ('zscaler-zia')::VARCHAR
    metadata.product.vendor_name: ('zscaler')::VARCHAR
    metadata.profiles: (ARRAY_CONSTRUCT('cloud','datetime','host','network_proxy','security_control','load_balancer','container','linux/linux_users'))::ARRAY
    metadata.uid: (metadata$uuid)::VARCHAR
    metadata.version: ('1.1.0')::VARCHAR
    observables:
    - name: '''actor.user'''
      type: '''User'''
      type_id: 21
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''actor.user.email_addr'''
      type: '''Email Address'''
      type_id: 5
      reputation: null::VARIANT
      value: (USER)::VARCHAR
    - name: '''actor.user.name'''
      type: '''User Name'''
      type_id: 4
      reputation: null::VARIANT
      value: (USER)::VARCHAR
    - name: '''device'''
      type: '''Endpoint'''
      type_id: 20
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''device.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DEVICE_HOSTNAME)::VARCHAR
    - name: '''device.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    - name: '''dst_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''dst_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (SERVER_IP)::VARCHAR
    - name: '''http_request.url'''
      type: '''Uniform Resource Locator'''
      type_id: 23
      reputation: null::VARIANT
      value: null::VARCHAR
    - name: '''http_request.url.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (HOSTNAME)::VARCHAR
    - name: '''http_request.url.url_string'''
      type: '''URL String'''
      type_id: 6
      reputation: null::VARIANT
      value: (URL)::VARCHAR
    - name: '''src_endpoint.hostname'''
      type: '''Hostname'''
      type_id: 1
      reputation: null::VARIANT
      value: (DEVICE_HOSTNAME)::VARCHAR
    - name: '''src_endpoint.ip'''
      type: '''IP Address'''
      type_id: 2
      reputation: null::VARIANT
      value: (CLIENT_IP)::VARCHAR
    proxy: NULL::VARIANT
    proxy_connection_info: NULL::VARIANT
    proxy_endpoint: NULL::VARIANT
    proxy_http_request: NULL::VARIANT
    proxy_http_response: NULL::VARIANT
    proxy_tls: NULL::VARIANT
    proxy_traffic: NULL::VARIANT
    raw_data: NULL::VARCHAR
    severity: NULL::VARCHAR
    severity_id: NULL::NUMBER
    src_endpoint.hostname: (DEVICE_HOSTNAME)::VARCHAR
    src_endpoint.ip: (CLIENT_IP)::VARCHAR
    src_endpoint.name: (DEVICE_HOSTNAME)::VARCHAR
    start_time: NULL::NUMBER
    start_time_dt: NULL::TIMESTAMP_LTZ
    status: (CASE ((99)::NUMBER) WHEN 0 THEN 'Unknown' WHEN 1 THEN 'Success' WHEN
      2 THEN 'Failure' WHEN 99 THEN 'Other' END)::VARCHAR
    status_code: NULL::VARCHAR
    status_detail: (REASON)::VARCHAR
    status_id: (99)::NUMBER
    time: (date_part('epoch_milliseconds', event_time::TIMESTAMP_LTZ))::NUMBER
    time_dt: (event_time)::TIMESTAMP_LTZ
    timezone_offset: NULL::NUMBER
    tls: NULL::VARIANT
    traffic.bytes: (RESPONSE_SIZE)::NUMBER
    traffic.bytes_in: (RESPONSE_SIZE)::NUMBER
    traffic.bytes_out: (REQUEST_SIZE)::NUMBER
    type_name: '(CASE ((decode(REQUEST_METHOD, null, 400200, ''CONNECT'' , 400201,
      ''DELETE'',400202, ''GET'',400203,''HEAD'',400204,''OPTIONS'',400205,''POST'',400206,''PUT'',400207,''TRACE'',400208,400299))::NUMBER)
      WHEN 400200 THEN ''HTTP Activity: Unknown'' WHEN 400201 THEN ''HTTP Activity:
      Connect'' WHEN 400202 THEN ''HTTP Activity: Delete'' WHEN 400203 THEN ''HTTP
      Activity: Get'' WHEN 400204 THEN ''HTTP Activity: Head'' WHEN 400205 THEN ''HTTP
      Activity: Options'' WHEN 400206 THEN ''HTTP Activity: Post'' WHEN 400207 THEN
      ''HTTP Activity: Put'' WHEN 400208 THEN ''HTTP Activity: Trace'' WHEN 400299
      THEN ''HTTP Activity: Other'' END)::VARCHAR'
    type_uid: (decode(REQUEST_METHOD, null, 400200, 'CONNECT' , 400201, 'DELETE',400202,
      'GET',400203,'HEAD',400204,'OPTIONS',400205,'POST',400206,'PUT',400207,'TRACE',400208,400299))::NUMBER
    unmapped: NULL::VARIANT
  predicate: protocol in ('HTTP', 'HTTPS')
